{
  "text": "BARE KNUCKLED PROJECT MANAGEMENT:\nHOW TO SUCCEED AT EVERY PROJECT\nBy Tony Gruebl & Jeff Welch\nWith Michael Dobson\nArt by Bartley Collart\nSmashwords Edition\nCopyright © 2013 Think Systems, Inc.\nCopyright © 2013 Think Systems, Inc. All Rights Reserved.\nBare Knuckled Project Management  is copyright © 2013 by Think Systems, Inc. All  \nrights reserved. No part of this book may be reproduced or utilized in any form or by  \nany means, electronic or mechanical, including photocopying recording, or by an  \ninformation storage and retrieval system, without permission in writing from the  \npublisher or the author, except for brief quotations in review articles.\nThank you for downloading this free ebook. Although this is a free book, it remains the  \ncopyrighted property of the author, and may not be reproduced, copied and distributed  \nfor commercial or non-commercial purposes. If you enjoyed this book, please encourage  \nyour friends to download their own copy at Smashwords.com. Thank you for your  \nsupport.\nE-Book Tips\nE-reading devices and software are all slightly different. Depending on what you’re  \nusing, try double-clicking or tapping on illustrations to make them full-size. Links  \n(underlined and also in blue on color devices) allow you to navigate inside the book and  \noccasionally to visit outside websites. Other devices provide a built-in table of contents  \nthat provides the same benefit. Be sure to learn the features of whatever program or  \ndevice you’re using. While we can’t always make sure that every feature works in every  \ne-reading program, we do invite you to let us know if there’s something that isn’t  \nworking for you.\nTable of Contents\nForeword\nChapter 1: Projects in Crisis\nChapter 2: The Bare-Knuckled Project Manager\nChapter 3: The Three-Sided Table\nChapter 4: No Bullshit Project Management\nChapter 5: Why Projects Fail — and How BKPM Prevents It\nChapter 6: Becoming a Bare-Knuckled Project Manager\nChapter 7: Conflict and Communications\nChapter 8: The Kranz Dictum\nChapter 9: The Next Bout\nChapter 10: Transforming the Project — and the Organization\nGlossary\nBibliography\nPhoto and Image Credits\nAcknowledgements\nAbout the Authors\nReturn to Table of Contents\nForeword\nIn March 2009, the telephone rang. I answered. “Tony Gruebl.”\n“Hey, Tony. It’s Jeff.” Jeff Welch was my client, working for a government  \nservices division of a well-known global provider of IT and strategic business  \nprocess outsourcing services. \nI was surprised to hear from him. “I thought you were in Alabama, working  \non that Air Force project,” I said.\n“I am in Alabama. That’s why I’m calling. I just got out of some meetings.  \nIt’s bad — really bad. Got a few minutes?”\nI did. Jeff’s company used me as their go-to project manager for non-standard  \n(read: difficult) projects, ever since I’d handled a large and risky LMS system  \ndeployment for them about five years ago. And I knew Jeff wasn’t the kind of guy to  \nhit the alarm over nothing.\nIn retrospect, Jeff’s call really wasn’t that much of a surprise. I’d worked with  \nthem through the bid and award process, so I knew the situation. I also knew they’d  \nhired a seasoned project manager with a military background to be their on-site PM  \nfor the project. I was supposed to provide coaching and support for that project  \nmanager, but he’d been ignoring me ever since the contract had been awarded. I  \ncould sense something was — well, perhaps not wrong, but definitely a bit off.\nJeff quickly set me straight. “You wouldn’t believe what’s going on down  \nhere. I’ve never seen such a mess. To start, I think I’m going to need to fire the  \nproject manager. No, strike that. I know I’m going to need to fire the PM.”\nThat surprised me. “You mean that guy you moved down from Virginia? I  \nthought he was really well qualified. He seemed like a strong project leader.”\n“Well, that’s what we thought,” Jeff said. “You wouldn’t believe the personal  \nissues this guy is dealing with. It has him all screwed up. That’s what my meetings  \nstarted to be  about. Then I started digging beyond the PM’s personal issues and  \nlooked into the status reports, and they’re completely wrong. Nothing on this project  \nis as it’s been reported. It’s like you’ve been flying along for hours and suddenly  \nrealize that no one’s in the cockpit! I have no idea where we are, where we’ve been,  \nor where we’re going. I’ve got to get a handle on this immediately!”\nWhen the situation is this bad, you don’t have any time to waste. “How about the  \nonsite project team?” I asked. “How are they doing?\n“They’re the ones who brought the situation to my attention,” Jeff said. “It’s a  \ngood crew. They care about the project, and they understand the need for leadership  \n— and leadership looks like it’s gone AWOL.”\nIn response to a few more questions, Jeff filled in the rest of the story. The  \nteam was following the original plan, but requirements were shifting without anyone  \nmaking sure the project was aligned with the changing goals. “We might not be in  \ntoo bad shape, but we might be totally screwed. I just don’t know. I can’t trust any of  \nthe data that’s been coming from the project manager,” he concluded.\nI already had access to their accounting system because of the other projects  \nI’d been managing for Jeff’s company. “Get me permission to take a look at this  \nproject’s financials, reports, communications, the current project plan, whatever  \nyou’ve got. I’ve got the original project plan I helped your guy create; that’ll give me  \na baseline.”\nI could hear the relief in Jeff’s voice. “Sounds good. Can you fly down next  \nweek? I need someone I can trust to peel back all the layers and find out exactly  \nwhere we are, and I’m going to be knee-deep in personnel issues. I’m going to need a  \nrevised plan and detailed status before I have to explain to the colonel what’s going  \non.”\nI knew how important this project was for Jeff’s company. “I’ll need to move  \nsome things around, but yes, I can help.”\nAnd so began a rescue effort. We quickly gained control over the project and  \nmade personnel changes, starting from the top. We had a few frank discussions with  \nthe colonel in charge and set up a workable action plan. \nIt took a year of constantly changing USAF personnel, evolving project  \nrequirements, and constant travel between Maryland and Alabama — but in the end,  \nwe got the job done.\nYou know this scenario – it happens far too often. If you haven’t yet experienced a  \nproject in complete collapse, sooner or later you will. And when it does happen, and  \nthe only option is to succeed, conventional business practices and standard project  \nmanagement approaches aren’t always up to the challenge.\nThe no-nonsense approach to getting the job done involves ruffling a few  \nfeathers, making some hard decisions, and speaking unpleasant truths to people who  \ndon’t always want to hear bad news. I think of it as taking a bare-knuckled approach  \nto project management, and that’s what this book is all about.\nYou need to understand something. This isn’t going to be a book of  \nmanagement platitudes, high-minded business practices, or a refinement of the  \nstandard project management materials taught in textbooks. It’s about practicality  \nand efficiency — keep what works and get rid of the rest. It’s about what actually  \nworks in a wide variety of project types, project teams, and project owners.\nAnd it will make project failure a thing of the past.\nFor me, living the idea of bare-knuckled project management is pretty much the way  \nI am. I’m unconventional in my approach. I push back against business norms,  \nespecially when they aren’t getting the job done. And I don’t mind getting in the face  \nof someone who’s clearly out of touch with reality.\nFrankly, I feel more comfortable articulating these ideas over a few beers in a  \nBaltimore pub than in the pages of a book. (Not to mention that my colleagues didn’t  \nlike my idea for the cover: me in a black leather jacket sitting astride a Harley.) On  \ntop of that, a lot of what I do instinctually has to be translated so that other people  \ncan do it to.\nThat’s why I enlisted the help of three colleagues.\nThe first, Jeff Welch, you’ve already met. He’s a technical solution architect  \nwho’s been designing, building, and deploying information systems in government  \nand commercial environments for nearly 25 years. Jeff is a master at taking complex  \ninformation and converting it into something easily understandable. He has been  \nintegral in challenging me to extract and codify my knowledge and practices for this  \nbook, a process that involved more than a few beers and cocktail napkins. (Note: Jeff  \nwould like all tavern owners to provide whiteboards for their patrons.) Jeff and I  \ntogether are the “soul” of the bare-knuckled project management process: this book  \nis us.\nThen there is Michael Dobson.  I first met Michael Dobson through a mutual  \nfriend, and attended one of his project management workshops many years ago. I  \nwas struck by his clarity, practicality, and expertise, and I immediately went out and  \nbought several of his books on project management. (He’s written ten of them —  \nalong with novels, business books, histories, and lots more, currently fifty books and  \ncounting.) Running a full-time business doesn’t leave a lot of time for writing, and so  \nI prevailed on Michael to take on this project as a third collaborator, taking the  \nmethodology Jeff and I developed and laying it out in written form, adding his  \nexpertise and insights to further flesh out the book.\nI also enlisted the services of Bart Collart (L10.biz).  Bart is a graphic artist  \nand I emphasize artist. Jeff has been working with Bart for many years and was one  \nof the first people he thought of when the need for an artist became self-evident.  \nPictures can communicate emotion and concepts non-verbally, which is important  \nsince many of the practices codified in this book focus on limbic brain conditioning:  \na level below the language centers of the brain.  \nOf course, many others have added their expertise and insight over the years.  \nYou’ll find a list of acknowledgements at the very end, right before the author  \nbiographies.\nWhat is this thing called Bare-Knuckled Project Management (BKPM for short)?\nBKPM is first and foremost a mindset, a limbic conditioned response to  \nproduce a good outcome even when rational decision-making goes out the window  \nbecause, as we just saw, sometimes we’re thrown into a situation that’s already out of  \ncontrol.\nBKPM uses that limbic learning to force you to get your projects on the right  \ntrack from the very first meeting. Maybe you’ll be asked to step in when things are  \nalready bad, but when you’re in charge from the beginning, you’ll make sure these  \nproblems never happen in the first place.\nIf you’ve noticed that the mass production of traditional project managers isn’t  \ndelivering the project results you need; if you’ve noticed that the most visible issue  \noften becomes who to blame rather than how to fix it; if you’ve noticed that even  \nsmart and capable people all too often end up over their heads, then you’ll benefit  \nfrom this book.\nMy promise to you is that if you use the BKPM approach from the outset,  \nproject failure won’t happen. That’s a big promise, but as you’ll see, it’s one we’ll  \nkeep.\nBut the book isn’t the end of our conversation; it’s simply the pre-read. To  \nreally experience what being a Bare-Knuckled Project Manager is all about, you and  \nI need to talk. Give me a call at 443-725-5131 (my company, Think Systems, Inc.) or  \nsend me an email (tgruebl@thinksi.com).\nI’m serious. \nCall me. \nLet’s talk through it.\n— Tony Gruebl\nReturn to Table of Contents\nCHAPTER 1: PROJECTS IN CRISIS\nThe Lousy Track Record of Project Management\nIn 2012, “Project Shield,” a $45 million US Department of Homeland Security  \ntechnology initiative in Cook County, Illinois, had “equipment failures, poor  \nplanning, and poor training…as an integrated whole, the system was worthless.”  \nContributing factors included lack of oversight, underestimation of complexity, and  \ninefficient procurement practices. (Calleam Consulting, 2002)\nIn 2010, the US Navy’s attempt to upgrade the Presidential helicopter fleet  \n(Marine One), was cancelled after burning through $13 billion. Causes included  \nunderestimation of complexity, requirements instability, and ballooning scope.\nAlso in 2010, Microsoft’s “Kin” phones were withdrawn from the market  \nafter only two months, after cutting the price in half failed to stimulate sales. Poor  \nmarketing, limited functionality, high operating costs, and a lack of executive  \nsupport were credited. Losses were estimated in the region of $1 billion.\nIn 2009, the London Stock Exchange was forced to decommission its new  \ntrading platform after only two years in service and four years in development.  \nSystem performance problems and unreliability were cited, with the root cause being  \nan inappropriate choice of technologies.\nProjects — large ones like these I’ve just cited, small ones, and everything in-\nbetween — are “failing” all around us.\nHow many of your projects get completed on time, on budget, and to spec? If  \nthe answer is “Not very many,” you’re not alone. According to the Standish Group’s  \nannual CHAOS Report, which surveys large corporate IT projects, nearly seventy-six  \npercent of projects fail in part or in whole!\nWith a pathetic success rate of only 32%, it’s no wonder that large projects  \nare a nightmare for just about every organization. Even the small ones consume  \nprecious resources (e.g., time, money, people) that could have been used to make a  \nbusiness stronger. When you start to roll in such considerations as reputation, brand,  \nand other market drivers, the cost of failed projects becomes truly mind-boggling.  \nWhen this happens, there are no excuses. There’s no place to hide… or at least there  \nshouldn’t be. \nBut there is an answer.\nFigure 1-1. Project Failure Rates. 68% of projects fail in whole or in part. (Source:  \nCHAOS Summary 2009 , The Standish Group)\nWhy So Many Projects Fail\nJust about every expert around has weighed in on the subject of why so many  \nprojects fail, and what it takes to make a project succeed. The Standish Group itself  \nlists its “Chaos Ten” list of factors that makes projects successful.\nFigure 1-2. The CHAOS Ten\nProject Underperformance: The Elephant in the Room\nProject failure is dramatic enough, but what about the cost of project  \nunderperformance? We’ve defined project failure as failing to meet one or more key  \ngoals, but even when the project achieves most or all of its requirements, it still may  \nunderperform.\nFigure 1-3. Types of Project Underperformance\n*Over budget, but complete\n*Late, but complete\n*Some functionality missing or overall functionality degraded (may also  \nhave issues with budget or schedule)\n*Unplanned resources needed to reach the goal\n*Other projects sacrificed or harmed to achieve the current project goal\n*Unplanned and unexpected risks surprised the project team\n*Project meets technical requirements but turns out not to meet real user  \nneeds\n*Speed of change makes project obsolete even before it’s completed\nSound familiar? If your reaction is, “Been there, done that,” you’re not alone.\nMere project survival usually isn’t enough in today’s fast-moving world. As  \nfamous quality guru W. Edwards Deming said, “Good enough isn’t!” When your  \nproject technically succeeds, but fails to achieve operational greatness, efficiency,  \nand excellence, or fails to correct a major organizational pain point or make the  \ncompany better in some real, tangible way — those, too, are project failures of a  \ndifferent sort. \nWhile some underperformance issues show up in the CHAOS statistics, many  \ndon’t. That makes the numbers for project success even bleaker than they already  \nappear.\nExperienced — or Effective?\nIn spite of this bad news, we frequently give our most important projects to people  \nwhose claim to success is that they sat through training courses or got a PMP®  \n(Project Management Professional) certificate from the Project Management Institute  \n(PMI).\nIs this really what you want? Or do you want your opportunities for  \norganizational greatness to be in the hands of people who can lead, facilitate,  \nnegotiate, navigate, and above all, execute.\nIt’s not enough to be an experienced project manager. You have to be an  \neffective project manager. That takes the willingness to push hard and do what it  \ntakes — skills that aren’t always welcome in a corporate environment. \nPushing hard isn’t necessarily the same as being a hard-ass. There are any  \nnumber of hard-ass project managers that drive their projects — right into the  \nground. There are also project managers who consistently make their deliverables —  \nat the cost of long-term team effectiveness. They’re like the kid who makes breakfast  \nfor Mother’s Day and leaves the kitchen a wreck. Great on paper; horrible in  \npractice. The right kind of effective blends the needs of the project with the needs  \nand well-being of the operational teams that support them. That means not only  \nsuccess today, but also the capability for success tomorrow as well.\nProjects, you see, have two defining characteristics. They are temporary and  \nthey are unique. The normal organization, by contrast, is designed for operational  \nwork — the regular and consistent activities we need to perform to keep the doors  \nopen. \nOperational work has a number of advantages. You can design your  \norganization to do it efficiently. You can train people in the processes and methods of  \nhandling the work. You can improve those processes and make them better. Just  \nabout every management system from TQM to Lean Six Sigma tells you how to  \nimprove your operational work.\nBut projects, by their very nature, break the mold. If you’re lucky, the projects  \ndon’t break the mold so much that they break down the operational efficiencies you  \nhave developed. But when you are trying to evolve your business or take risks in  \nattempting to leverage new technologies, methods, or processes, conflict between  \nprojects and operations is simply going to be a fact of life.\nProjects and Change\nProjects are always about change. They deliver new systems and tools to improve the  \norganization. They respond to challenges and crises. They force people outside their  \ncomfort zones and require new ways of thinking. And at the end of every project, the  \npeople and resources have to be folded back into the organization or sent on to new  \nproject challenges.\nWhether your organization admits it or not, this makes a lot of people  \nuncomfortable. A big project is like going off the high dive into uncharted water. You  \ndon’t ever know what you’re going to find. A big project forces change on  \ndepartments and whole organizations. Everybody resists change to some extent; it’s  \njust human nature.\nWe all know about inertia — the tendency of a body at rest to stay at rest, and  \nthe tendency of a body once in motion to stay in motion. It’s one of the fundamental  \nprinciples of physics. It’s also one of the fundamental rules of people and  \norganizations. Whenever you try to push any part of the organization to move and  \nchange, inertia kicks in. It takes force — energy — to make it happen.\nThat’s where the bare-knuckled project manager comes in.\nBare-Knuckle Boxing\nThe idea of bare-knuckled project management derives from the sport known as  \nbare-knuckle boxing.\nWhat we think of as modern boxing evolved from ancient combat sports. In  \nbare-knuckle fighting, as the name suggests, the fighters don’t wear gloves or  \npadding. Unlike a street fight, however, there are rules.\nIn England, bare-knuckle fighting became a recognized sport with a champion  \nin the early 1700s. The first English champion, James Figg, gained the title in 1719  \nand held it until 1730.\nBare-knuckle bouts lasted much longer than modern boxing matches. One, in  \n1855, lasted for six hours and fifteen minutes. The last sanctioned match took place  \nin 1899 between John L. Sullivan and Jake Kilrain, with Sullivan victorious.\nAfter the Marquis of Queensberry developed modern boxing rules in 1867,  \nbare-knuckle fighting slowly gave way to modern boxing. Some fighters adapted to  \nthe new system, including John L. Sullivan, who lost the battle to become the first  \nheavyweight champion to Gentleman Jim Corbett in 1892.\nThere has been a revival of sorts for bare-knuckle boxing. In 2011, the first  \nofficial bout since 1899 took place in Arizona.\nWhen the Going Gets Tough, They Call In the Sons of  \nBitches\nAdmiral Ernest King, the Navy chief who won the Battle of the Atlantic in World  \nWar II, is supposed to have said, “When the going gets tough, they call in the sons of  \nbitches.” \nNot all projects are wars, of course (though all wars are certainly projects).  \nBut some of the same skills and attitudes that make someone an effective military  \nleader are also those that make for an effective project manager. The commitment to  \nget the job done, the force of will to overcome resistance, and the foresight to  \nmanage problems and risks — these are just a few of the characteristics that matter.\nIt’s not always necessary to be an actual son of a bitch. General George  \nPatton was a remarkable and effective commander, but he also left a lot of collateral  \ndamage in his wake from his temper and his unwillingness to respect the  \norganizational boundaries of his role. You can’t be afraid to be a son of a bitch when  \nthe situation calls for it, but assertiveness, calm, and directness are often enough to  \ncarry the day.\nIn the movie Pulp Fiction, there’s a scene where the two lead characters (John  \nTravolta and Samuel L. Jackson) have a dead man in the back of their car, and call  \ntheir boss Marcellus for help. Shortly, help arrives in the form of a man in a tuxedo.  \n“I’m Winston Wolf. I solve problems,” he says. Although Wolf never raises his voice,  \nloses his temper, or acts with anything other than extreme politeness, he instantly  \ntakes command of the situation. To the two gangsters, the situation looks hopeless,  \nbut to Winston Wolf, it’s all in a day’s work.\nOur name for this: Bare-Knuckled Project Management — BKPM for short.\nReturn to Table of Contents\nCHAPTER 2: The Bare-Knuckled Project Manager\nThe Right Person for the Job\nSome management philosophies tell you that if you just follow these simple steps,  \nyou, too, can have perfect results. But it’s never that simple.\nYes, there are always steps to follow and procedures to manage, but that  \nleaves out the most essential part of the equation: the person. Anybody can walk up  \nto the plate and swing a bat, but that doesn’t mean everybody can become a major  \nleague superstar. It takes talent, temperament, skill, training, experience, attitude, and  \naptitude to be the best.\nTo implement Bare-Knuckled Project Management, you need a Bare-\nKnuckled Project Manager. Not everyone qualifies for the job.\nEven if you do have what it takes, you still need the other elements: training,  \nexperience, and the right process. Throughout this book, we’ll talk about the process.  \nIn this chapter, we’ll talk about the person. Who is the bare-knuckled project  \nmanager? How do you find and develop that person?\nDefining the Bare-Knuckled Project Manager\nHow is a Bare-Knuckled Project Manager different from a regular project manager?\nThe difference between a BKPM and a conventional project manager lies in  \nthe areas of attitude and skill. A conventional project manager knows the business of  \norganizing and managing a project — but as we’ve seen, that’s not enough to get the  \njob done. A project manager needs to be a fighter as well as a planner. That’s the core  \nBKPM difference.\nThe word “fighter” may raise a few eyebrows or set off some alarms, but we  \ncan’t afford to be politically correct when we talk about the reality of what a project  \nmanager faces. At the same time, we don’t want to give you the wrong idea. A  \nBKPM isn’t a brawler, or somebody who looks for trouble. Instead, a BKPM is the  \none who settles a problem.\nThinking like a BKPM is similar to thinking like a martial artist, and there’s  \nno more famous martial artist than the legendary Bruce Lee. Best known for his  \nmovie roles, Lee also developed his own martial arts system and philosophy.  \nSurprisingly, his philosophy has a lot to do with the real world of project  \nmanagement.\nThe Art of Fighting Without Fighting\nBruce Lee named his style Jeet Kune Do, but it was much more than a way of  \nfighting. Jeet Kune Do is a philosophy of life, or as Bruce Lee called it, “the art of  \nfighting without fighting.”\nFamed as an actor and considered by many the greatest martial artist of all  \ntime, Bruce Lee (李小龍) was a man for all seasons: actor, martial arts instructor,  \ndirector, screenwriter, producer — and philosopher. \nBorn in 1940 in San Francisco’s Chinatown, he moved to China and lived in  \nKowloon through adolescence, returning to the U.S. for higher education. Working  \nfirst as a martial arts instructor, Lee became increasingly involved in film and  \ntelevision roles. Gaining American recognition for playing Kato in TV’s The Green \nHornet, Lee is credited for inspiring the modern American interest in martial arts.\nAfter one season playing Kato, Lee, who had originally been trained in the  \nmartial art of Wing Chun, began to conclude that traditional martial arts were too  \nrigid and formulistic. Starting in 1967, he began to develop the foundations of Jeet \nKune Do, the “style of no style,” a martial art that existed outside of parameters and  \nlimitations.\nA highly intelligent and well-read man, Lee studied philosophy intensively,  \nand developed an eclectic philosophy of his own that grew out of his martial arts  \napproach, and included elements of Taoism, Buddhism, and Confucianism. He wrote  \npoetry, practiced an intense discipline of physical training, and even developed his  \nown approach to nutrition.\nLee died in 1973. The official cause of death was cerebral edema, possibly the  \nresult of an allergic reaction to medication.\nSome of the principles of Jeet Kune Do have powerful applications when it  \ncomes to project management. Bruce Lee believed that traditional martial arts had  \nbecome too rigid, and therefore unrealistic. \nMuch the same is true of modern project management, with its emphasis on  \ngetting a PMP® certificate that basically only shows that you’ve memorized a few  \nbooks. There’s a discipline and a process to project management, but it’s easy to get  \nlost in the formalities and lose track of the goal.\nCombat, Bruce Lee says, is spontaneous. You can’t predict it, but only react to  \nit. That doesn’t mean, however, that it isn’t predictable or controllable. \nIn real life, project management follows the same model. “No battle plan  \nsurvives first contact with the enemy” is an old military saying, and it’s also true  \nabout every project. A project plan is useful, but it’s a fatal mistake to take it too  \nliterally. Projects always contain surprises, and the BKPM has to react smoothly,  \neven fluidly, and without hesitation — just like a fighter. The BKPM faces problems  \nand solves them — simply and directly.\nCore Competencies of the BKPM\nThat gives us the core competencies of a BKPM, shown in Figure 2-1. A BKPM is  \nunafraid of conflict and confrontation; simple, direct, and effective; well disciplined;  \nwell trained and versatile; and moves forward consistently. \nFigure 2-1. Core Competencies of the BKPM\nUnafraid of Conflict and Confrontation\nNo real fighter goes around picking fights, but real fighters aren’t afraid to fight  \nwhen the situation calls for it. Conflict happens every day, and the worst thing you  \ncan do is pretend that it isn’t happening. If you’re a kung-fu master or mixed martial  \nartist, you don’t go around looking for people to beat up — quite the contrary.  \nOutside the ring, skilled fighters are often some of the nicest people you could ever  \nhope to meet.\nInside the ring, however, they do what’s necessary to get the job done.\nIssues — and sometimes people — have to be confronted directly and firmly  \nbefore they have a chance to get out of control. If you act early, it often takes less  \neffort and involves less conflict than if you wait until the situation forces itself on  \nyou.\nOf course, there are a lot of ways to handle a conflict or confrontation.  \nPerhaps you can compromise or negotiate. But sometimes you have to be firm,  \ndirect, and final. Otherwise, you’re not really being a project manager — much less a  \nBKPM. (There’s a lot more on how the BKPM handles conflict in Chapter Seven.)\nIt’s important to note that this is most decidedly not standard human behavior.  \nMost people will avoid conflict at almost any cost. They’ve learned that conflict  \nresults in bad things happening to someone, and that even winning a conflict  \nprobably means another fight down the road. BKPMs have the discipline to  \nrecognize conflicts early. They deal with the situation before there is even a clear  \nwinner and loser. In this way, problems get mutually resolved before they become  \noutright battles. \nWhen a battle does become necessary — and sometimes they’re unavoidable  \n— the BKPM will have already set up the conditions to be in their favor, much like a  \npracticed martial artist would. Or as Sun Tzu puts it, “Victorious warriors win first  \nand then go to war, while defeated warriors go to war first and then seek to win.”\nSimple, Direct, and Effective\nIf you watch a mixed martial arts (MMA) bare-knuckle fight, it doesn’t look very  \nmuch like a kung-fu movie. Instead of using elaborately choreographed fighting  \nmoves, real MMA fighters focus on the basics: simple, direct, and effective.  \nAlthough they know the fancy moves, they also know that ninety percent of the time,  \nit’s the basics that carry the day. While a good martial artist knows all sorts of  \nfighting techniques, in practice, a handful of straight, direct moves get used over and  \nover again.\nThere are a seemingly unending number of fancy moves or special tools that a  \nproject manager might use: things like the Earned Value Method (EVM), the  \nProgram Evaluation and Review Technique (PERT), Monte Carlo simulations,  \ncritical path analysis, and network diagramming, along with lots of software to help  \nyou do it. \nEvery one of these tools has a time and a place where they’re appropriate and  \neffective. Most of the time, however, they’re overkill. They add complexity and red  \ntape and don’t get the job done any faster or any better. In most cases, the simple and  \ndirect way is also the most effective. In other words, don’t borrow trouble.\nAlthough the BKPM has mastery (or at least a working familiarity) of the  \nvarious tools of project management, the trick isn’t to throw in the kitchen sink, but  \nrather use the most important and valuable tools in a direct, simple, disciplined, and  \neffective manner — a handful of straight, direct tools get about ninety percent of jobs  \ndone.\nThe BKPM’s goal is never to do the project in the formal way — the goal is  \nto do it the effective way. Results talk — bullshit walks. That’s true no matter where  \nthe bullshit is coming from.\nDisciplined\nNo matter how good you are at anything, you can always become better.\nOn the movie screen, Fred Astaire always looked like he was making up his  \ndance moves spontaneously and effortlessly. In real life, the opposite was the case.  \nAstaire was known as a demanding taskmaster, both of himself and others. His  \nlongtime partner Ginger Rogers said of him, “I thought I knew what concentrated  \nwork was before I met Fred, but he’s the limit. Never satisfied until every detail is  \nright, and he will not compromise.” \nTeamwork matters, too. As one critic observed, “Ginger Rogers did  \neverything Fred Astaire did, except backwards and in high heels.” A BKPM can’t  \nachieve greatness without helping teammates do the same thing.\nYou can’t say you’ve mastered anything until it’s reached the level of muscle  \nmemory — when your mind and body have learned it so well that it becomes  \nvirtually intuitive. That’s called limbic learning, and we’ll say more about it in  \nChapter Six.\nSelf-discipline, concentration, practice, and a commitment to excellence and  \nperfection are the hallmark of any successful BKPM.\nIn managing our projects, discipline is essential. We have trained ourselves to  \nfollow practices so well that they become nearly unconscious ways of doing  \nbusiness. We create a plan, hold a kickoff meeting, designate a project website,  \nschedule weekly calls, establish a weekly report, and expose the numbers. This  \nallows us to prevent cost/resource surprises by showing the customer each and every  \nweek what the numbers are. We constantly focus on risk. Every report we do has a  \nrisk section.\nDiscipline in a few basic steps has taught us over and over again that about 80  \npercent of project risks are both predictable and preventable — as long as you have  \nthe systems in place to identify and deal with them early.\nOver time, discipline and experience become art.\nWell-Trained and Versatile\nAs we said, a project manager (BKPM or otherwise) ought to know the art.  \nCommand of the different tools makes a BKPM more versatile, and thus more  \neffective.\nVery little of that training, however, takes place in the classroom. Theory is  \nno substitute for practical, on-the-job experience. A BKPM’s training emphasizes  \npractical learning.\nNobody, no matter how skilled, smart, or able, can become a BKPM  \novernight. BKPMs learn primarily by doing. They start as team members, develop  \ntechnical skills, and experience the life cycle of projects. They get familiar with  \nprojects that fail as well as projects that succeed, and pay attention to the reasons for  \nboth success and failure.\nBKPMs learn to adapt. They see the range of surprises and problems that crop  \nup on projects, and they learn what to do and how to react to each category of  \nchallenge.\nBKPMs learn to think in an uncomplicated manner. They avoid ornamentation  \nor excessive formality. They focus on the goal and the best way to get there.\nBKPMs learn to absorb what is useful and discard the rest. They see what  \nworks and what doesn’t. If the tool isn’t beneficial, it’s discarded.\nBKPMs are never dogmatic. They might have favorite ways of doing things,  \nbut they can put the favorite ways aside if that’s what the situation calls for.  \nOrganizations are different. Projects are different. One size never fits all.\nHow do you achieve that? Discipline. The disciplined use of tools, practice,  \nperseverance, time-on-task, and experience eventually gives way to art. There’s no  \nshortcut.\nMoves Forward Consistently\nBruce Lee explained his philosophy this way: “My movements are simple, direct,  \nand non-classical. The extraordinary part of it lies in its simplicity. I always believe  \nthe easy way is the right way. Jeet Kune Do is simply the direct expression of one’s  \nfeelings with the minimum of movement and energy.”\nThe best defense, as we know, is a good offense. You must approach the target  \nto engage with it. Sometimes you speed up; sometimes you slow down. Sometimes  \nyou expand; sometimes you contract — but you always move forward. \nThe commitment to forward movement is also a discipline. Even if the goal  \nisn’t crystal clear (which is most of the time), we can still make progress if we’re  \nmoving in the right general direction. Incremental improvement through continual  \nprogress eventually reaches the desired goal.\nNow, let’s see how the BKPM fits into the rest of the project and the process.\nReturn to Table of Contents\nCHAPTER 3: The Three-Sided Table\nRunning the Table\nOf all of the practices presented in this book, the concept of managing a project as if  \nthe BKPM is sitting at a three-sided table is one of the most fundamental.   Almost  \neverything else is designed to maintain this relationship between project owners and  \nfulfillment teams.\nOf course, no project manager, not even the most highly skilled, can do it  \nalone. Executive leadership sets the tone and provides the support; project sponsors  \nestablish the goals; the solutions team partners to do the work; and the project  \nmanager runs the plan and process. Establishing clear goals, roles, and expectations  \nfor the different project players is a necessary precondition for the BKPM.\nIn traditional project management, the PM/customer/team relationship can be  \ndescribed as a two-sided table: the project manager and team on one side, and the  \ncustomer or client on the other, as shown in Figure 3-1.\nAt first glance, this makes perfect sense. The project manager, after all, leads  \nthe team, and is accountable for delivering results to the customer. That makes the  \nproject manager the advocate and architect of the team’s solution. When the team  \nsucceeds, the project manager succeeds. When the team fails, the project manager  \nfails.\nThe customer, on the other hand, is independent. The job of the customer is to  \narticulate what he or she wants, and ultimately to pay for it. That means the  \ncustomer’s role is to put pressure on the project manager and team to deliver the  \nright solution on the right timetable at the right price.\nBut in the BKPM approach, that’s absolutely wrong. \nFigure 3-1. Traditional Project Management.  In the traditional project  \nmanagement situation, the customer/client sits on one side of the table, and the  \nproject manager and team sit on the other side.\n\nFrom Two-Sided to Three-Sided\nThe BKPM approach makes some changes to conventional project management. One  \nof these is to change how we view the relationship of the BKPM to the team and to  \nthe customer or sponsor. We call it the Three-Sided Table , and it’s a powerful tool to  \nreframe the role of project manager in the process of getting the work done.\nThe Three-Sided Table View\nLet’s talk first about how the three-sided table works, and then we’ll talk about its  \nbenefits to you and the project. In the three-sided table approach, every project has  \nthree “seats” that must be filled:\n←The customer or executive sponsor  owns the outcome, not the process. \nThis is absolutely critical. If the executive sponsor cannot clearly articulate  \nthe desired project outcome in terms of business impact, then there is little  \nchance that it will be reached.\n←\n←The project manager owns the process, not the outcome. Again, this is \ncritical. This position of purity is exactly what enables consistent project  \nsuccess.\n←\n←The partners and team  align with the direction of the project manager to  \nachieve the technical objectives  of the project. They are the primary  \nconsumers of time and budget and, in the end, render products or services.\nFigure 3-2. Three-Sided Table.  In the three-sided table approach, the project  \nmanager is independent of both the client/customer and the partners/implementation  \nteam.\nProject managers traditionally manage the “triple constraint” (Chapter Four): on  \ntime, on budget, and to spec. But that’s not how the executive sponsor should look at  \nit. \nThe value of a project  to you is how it impacts your business. If a job’s not  \nworth doing in the first place, it hardly matters if it’s on time and on budget; if the  \nproject is valuable enough to your business objectives, over budget or behind  \nschedule may not be that important.\nSome executive sponsors link the project outcome to the project manager and  \nteam, giving them a handy way to spread the blame when things go wrong, but that  \nturns a project into a death spiral. You can’t afford to do that. Here’s why.\nAs an executive, you have a different perspective than that of the project  \nmanager and fulfillment team. They may not be aware of how all the business’s  \nmoving parts fit together — and it has to be that way. That’s why you must never \nmake the project manager or fulfillment team responsible for a single project’s  \noutcome. \nWhen you violate this rule, you end up with a two-sided table, with the PM  \nand team on one side and the customer/executive sponsor on the other. Because you  \nhave a perspective and critical knowledge that the PM/team does not, the PM/team  \nfocuses on achieving whatever outcome you told them in the most direct way  \npossible.\nIn the famous case of the Ford Pinto, engineers were tasked to build a small  \ncar that weighed no more than 2,000 pounds and cost no more than $2,000 in 1968  \ndollars (about $13,000 in 2012). They achieved every one of their technical  \nspecifications — but the infamous gas tank problem nearly sank the company  \nbecause they couldn’t afford the extra $11 per car to make it safer.\nUltimately, that’s not a technical failure, but a leadership failure. Technical  \nteams are supposed to do what they’re told. If they’re told the wrong thing, it’s not  \ntheir fault that they do it. In the two-sided table, the PM and team have one goal:  \nachieve whatever outcome you gave them in the most direct way possible, regardless \nof the real effect on your business.  \nLife is full of situations that fit the model, “The operation was a success but  \nthe patient died.”\nBecause you as an executive sponsor can’t — and shouldn’t — spend your  \nday micromanaging the project manager and team, you need someone who can keep  \nboth sides (you and the implementation team) working to achieve the right kind of  \nsuccess.\nBy using the three-sided table approach, the organization, the project team,  \nand the customer realize important benefits, including:\n←The BKPM finds out the truth and shares it. There are no secrets  \nwith the BKPM; he or she is the honest broker to both sides.\n←The BKPM holds everyone’s feet to the fire. This means not only  \nbeing accountable, but constantly moving the ball forward.\n←The BKPM determines if risk is within acceptable boundaries.\n←The BKPM challenges the proposed technical solutions and  \napproaches.\n←The BKPM has profit and loss (P&L) accountability for the project.\n←The BKPM keeps unnecessary escalations away from senior  \nexecutives — and lets them sleep at night.\nAs we’ve seen, in conventional project management models the project  \nmanager and the team are considered to be on the same side — a two-sided table. But  \nin the BKPM method, we extract the project manager from the team, and thereby  \nmove the BKPM away from a defensive position in the relationship.\nIn other words, the BKPM doesn’t represent the solutions team any more than  \nhe or she represents the sponsor. That frees the BKPM to focus on the plan and the  \nprocess of project execution in line with overall business objectives.\nThree Seats for Every Project\nIn the three-sided table, every project has three “seats” that must be filled.\nCustomer/Sponsor/Outcome Owner\nThe customer or sponsor is the person or group in an organization that wants the  \nspecific outcome of a project. That person or group can be inside or outside the  \nperforming organization. \nGenerally, we use “sponsor” if that person or group is internal, and  \n“customer” if external. Examples of sponsors can be the boss, the president, the  \nCOO, or a department head. Customers are the clients who are paying to have the job  \ndone. \nA project can have a sponsor as well as a customer, if there’s an internal  \nleader who serves as the inside customer voice. \nThat’s why the customer/sponsor — and only the customer/sponsor — can be  \nthe outcome owner. It’s your responsibility, your vision, and your ability to  \nunderstand your customers and stakeholders. \nPartner/Team/Implementer\nThe partner or team consists of the people who are responsible for delivering the  \nspecific outcome desired by the sponsor or the customer. Partners can be internal  \n(staff) or external (subcontractors), or both.\nTechnical teams, not the customer/sponsor, are the experts in the “how” of the  \nproject, but not the experts in “why.” Sometimes they’ll tell you why a particular job  \ncan’t be done, or why another method is preferable. \nWhether they’re right or not depends on what the business goal actually is. \nIf you tell people that their job is to get it done cheap, and putting the gas  \ntank over a bolt (as in the Pinto) is the best way to do it cheaply, then that’s what the  \ntechnical team will do. That’s their job. \nOf course, good technical teams will point out the consequences of that  \nchoice (as the Ford engineers did), but it’s not up to them to force the change.\nBKPM/Process Owner\nThe BKPM is the arm’s length architect of the plan and process, and sits between the  \nsponsor/customer and the partner/team. The BKPM owns the process. In meetings,  \nwe say, “He who owns the agenda, controls the meeting.” For the BKPM, “he who  \nowns the process, controls the progress.”\nIn our experience, BKPMs perform better when they are independent from the  \ndevelopment team as well as from the customer/sponsor, hence the three-sided table.  \nThat arms-length relationship is essential for the BKPM to perform his or her role.\nIn the case of the Pinto, the technical team had a lot of trouble being listened  \nto by management. The same thing was true on another failed project, the Space  \nShuttle Challenger. In both cases, there was a failure of process because there was  \nnobody empowered to broker the right agreement between executive management  \nand the team. (The same problem occurred on Apollo until a BKPM — Gene Krantz  \n— stepped in, as described in Chapter 8.) \nIf the project manager is simply part of the team, then the project manager  \nwill take on the team’s perspective, and that leaves executive management out of the  \nloop. You don’t want that.\nGREAT and the BKPM\nThe GREAT model of team building identifies the critical elements needed for  \nsuccess. A BKPM makes sure each of these is clear, understood, and accepted by  \neveryone involved with the project. “GREAT” stands for:\nGoals\nRoles\nExpectations\nAttitude and Aptitude\nTime\nLet’s look at these one by one.\nGoals\nGoals exist at many levels on the same project. There is an overall project goal, the  \ndesired outcome, but to achieve it, other participants have to accomplish their own  \nsubordinate goals. \nFor the customer, the most essential goal is a successful outcome. \nFor the BKPM, the goal is a great process that results in a satisfied customer.  \nFor the team, the goal is to provide a technical solution that falls within the project  \nconstraints.\nRoles\nIn the three-sided table, we assign specific roles to the different players in the  \nprocess. Each performs a necessary function; each checks and balances the others. \nWe’ve established that the BKPM owns the process. This management  \nincludes being an honest broker between the parties — forcing the customer to own  \nthe outcome and driving the team to achieve an appropriate technical solution. \nFor the customer, the essential role is to define clearly and usefully what the  \ndesired outcome looks like. The outcome may have nothing to do directly with the  \ntechnical solution — the people who need IT solutions often aren’t part of IT  \nthemselves, nor should they be.\nThe team must find a technical solution that achieves the desired outcome —  \nif the new IT system doesn’t solve the customer need, it doesn’t matter how quickly,  \ncheaply, or elegantly it was done.\nExpectations\nEach role has expectations for what the other roles will be doing, and the standard to  \nwhich they will do it. One of the ongoing responsibilities of the BKPM is to make  \nsure those expectations are appropriate and honored. \nThe customer expects that the team will provide a workable solution; the team  \nexpects that the customer will be able to say what he or she wants.\nThe BKPM, being experienced in the ways of organizations, expects that both  \ncustomer and team will fail to do this as well as necessary, and will step in to make  \nsure it’s done right before moving any farther with the project. \nThe other two sides may not expect this, but they will be grateful in the long  \nrun when it is done.\nAttitude and Aptitude\nPolitical problems, personality issues, or simple disgruntlement complicate most  \nprojects enormously. All too often, the prevailing management response is to ignore  \nthe problem and hope it goes away on its own. This is often a contributing cause to  \nproject failure.\nIt’s human nature to have some degree of on-the-job friction. You can make it  \nbetter, but you can’t make it go away. As a BKPM, your first need is to understand  \nwhere people are. You don’t have to approve it or agree with it, but you will  \ninevitably have to work with it.\nEqually, members of the team may not possess all the skills and abilities  \nnecessary to accomplish a particular solution. It’s often possible to overcome these  \nlimitations, but only if you know what they are in advance. As a BKPM, learn what  \npeople can and cannot do so you can define your strong spots and your weak spots —  \nand do something about it.\nTime\nWhether or not the project is deadline driven, it always has a tempo. As we’ve  \nlearned, the BKPM’s motto is “always move forward,” but that’s not a project’s  \nnatural tendency. \nProjects, like every other thing in nature, are subject to inertia. When at rest,  \nthey tend to stay at rest. The only way a project moves forward is through the  \napplication of energy, and that’s an essential part of the BKPM’s function. \nWhat’s the next milestone? How can we get there? How can we keep our  \nforward momentum from stalling out?\nDefining Roles and Responsibilities\nAs we’ve seen, these three roles — BKPM, customer, team — interact in a specific  \nmanner, each with defined roles, responsibilities, goals, as shown in Figure 3-3.\nFigure 3-3. Roles and Accountability.  Each part of the three-sided table has specific  \nroles and areas of accountability.\nIn summary:\n←The customer or executive sponsor  owns the outcome, not the process. \n←The project manager owns the process, not the outcome. \n←The partners and team  align with the direction of the project manager to  \nachieve the technical objectives  of the project. \n←\nThese three separate roles and how they interact is critical to the BKPM method.\nBKPM Issues\nIn the three-sided table, the BKPM is the honest broker, who does not represent a  \nparticular interest. The BKPM owns only the plan and the process , but not the \noutcome and not the technical solution! The BKPM serves as the honest broker,  \nnegotiator, and arbitrator who makes the process work.\nStrangely, if the BKPM becomes too emotionally invested in the outcome,  \nrather than the process, it hurts the three-sided table, and ultimately the project itself.  \nThe BKPM becomes co-opted by the customer’s side, and no longer has the ability to  \nbalance outcome objectives with technical reality.\nThe other direction is equally problematic. If the BKPM becomes too deeply  \nallied with the implementation team, the need to deliver a technical solution can  \noverride the need for that solution to achieve the customer’s desired outcome. We’ve  \nall seen projects where the implementation team points proudly to a solution (“It’s  \ndone!”) and yet the customer’s fundamental needs have not really been met.\nWhile the BKPM’s investment in one side or the other doesn’t itself cause the  \nproject to fail, it significantly increases the risk. As soon as the BKPM stops being  \nseen as an honest broker, communication begins to break down, and the needs and  \ngoals of the other two sides of the table naturally begin to drift apart.\nWhile investing in the outcome doesn’t itself cause the project to fail, but it  \ndoes increase the risk. We refer to this as co-opt risk.\nThat’s not to argue that emotional involvement on the part of the BKPM is  \nwrong — quite the contrary. Emotional investment can be very positive, as long as  \nit’s invested in the right direction. For the BKPM, that means emotional investment  \nin having the best, most foolproof process; anticipating and managing all known  \nrisks; and solving the inevitable problems that crop up on even the best-run project  \nare all wonderful goals.\nSponsor/Customer Issues\nThe sponsor or customer is responsible for articulating the desired outcome in  \nsufficient detail to allow the solution team to craft a solution within the boundaries of  \nthe Triple Constraints — time, cost, and performance criteria.\nBy definition, the customer/sponsor owns the outcome of the project. The  \ncustomer naturally has the clearest insight and understanding of the potential impacts  \nof success or failure. The customer/sponsor also has the best understanding of the  \nlevel of scope change that the organization can bear in order to realize the benefits of  \nthe project. Only the outcome owner can make certain project decisions related to the  \norganization as a whole. \nMany times, the outcome owner cannot or does not explain all of the impact,  \nthe politics, and the relationship of the project to the overall organizational strategy  \nor tactical deployment. For that reason, other project participants might think that the  \noutcome owner is making terrible decisions, but they have no way of knowing all  \ncustomer actions or understanding of the ultimate outcome of the project.\nPartner/Team Issues\nThe partner or implementation team is responsible for crafting the solution  to reach \nthe outcome desired by the customer or sponsor, within the boundaries of the Triple  \nConstraint: how can we achieve the outcome within an acceptable time frame and at  \nan acceptable cost?\nIt’s the solution team, not the BKPM, who has this responsibility. It’s the job  \nof the BKPM to force the solution team to define what can be done, how long it will  \ntake, and how much it will cost. \nWhat if the outcome can’t be achieved within the boundaries of time and  \ncost? That’s certainly a problem, but if that’s the reality, it’s always better to know it  \nup front, before the project begins. The same thing is true if the solution is risky —  \nit’s something we haven’t done before, or we’re taking on a challenge at the very  \nedge of our capabilities.\nSometimes it’s necessary to negotiate between the customer and the  \nimplementation team, and that’s another reason it’s so critical to have the BKPM in a  \nposition to serve as the honest broker.\nThe BKPM as Honest Broker\nServing as honest broker, negotiator, and arbitrator is an essential part of the job of  \nthe BKPM. As an independent part of the three-sided table, the BKPM remains at  \narm’s length from the other two sides to ensure that everyone involved does his or  \nher job. Risk evaluation, assessment, and mitigation are an active part of this  \nprocess.\nThe BKPM can’t afford to take ownership of matching customer requirements  \nto team deliverables. If the customer or sponsor hasn’t yet made it clear what the  \ndesired outcome is, the BKPM can’t permit the partner/team to end up with  \nresponsibility for managing a muddle.\nSimilarly, the BKPM has to make sure that the potential solution is properly  \nvalidated. Is the process reasonable? Is the focus on achieving the outcome? Are the  \nassumptions of the implementation team appropriate and realistic?\nIn this process, the BKPM works with both of the other sides of the three-\nsided table. There is often some back-and-forth before all parties get on the same  \npage with a solution that works. Sometimes one side or another has to give a little  \nbit. Sometimes, the goals and project parameters have to be revised.\nBut all of this must take place before the work of the project begins.\nForcing the Customer\nThe BKPM’s job in this relationship is to  force the sponsor/customer, who is usually  \nsenior to the BKPM in the organization, or is a client of the BKPM’s own  \norganization, to own the clear articulation of the desired outcome. \nAnd yes, forcing is often the right word. Just because a sponsor or customer  \nwants something, it doesn’t mean that he or she truly understands it well enough to  \narticulate it.\nSometimes, the sponsor or customer resists being clear about the desired  \noutcome as a way to avoid responsibility if things go wrong. If the project manager  \naccepts this, and doesn’t force a clear and definitive articulation, the project is in  \ndeep trouble — and usually, the project manager ends up being blamed. The BKPM  \nnever allows this to happen. If the sponsor or customer won’t go on the record about  \nthe goal, the project stops right there.\nOf course, that’s never the goal anyone wants. Instead, the BKPM leads a  \nprocess of forced clarification .\nIt takes courage — and usually risk — for a BKPM to take this responsibility,  \nbut think of the alternative. If you don’t know where you’re going in the first place,  \nit’s not realistic to expect to find a way to get there.\nThe customer or sponsor must own the outcome. That’s their fundamental  \nrole. Most of the time, a sponsor likes the idea of being crystal clear, and will agree  \nto that as a requirement process requirement. This is key for the BKPM. Sponsors do  \nnot always understand how difficult it can be to achieve clarity, but because they  \nhave already committed to it, they are forced to be clear in order for the project to  \nproceed. In other words, force is applied by agreement, not by confrontation.\nThe most important step in forced clarification is the focus on why. A project \nis not an end in itself, but rather a means to an end. The more you can clarify the  \ndesired end state (the “why” of the project), the easier it becomes to define the  \n“what” (objectives) and “how” (methodology). To do that, the BKPM asks probing  \nquestions, some of which are shown in Figure 3-4.\nFigure 3-4. Forced Clarification.  Asking probing questions is the key to forced  \nclarification of project objectives. In particular, “why” is often the most overlooked  \nquestion in project management.\n←Why are we doing this?\n←\n←What’s the gap between the current situation and the goal we want to  \nreach?\n←\n←How will things be different if we succeed with this project? How will  \nthings be different if we fail or if we don’t do it at all?\n←\n←What are the dangers of success? What are the benefits of failure?\n←\n←What are we assuming about the world around us when we conceive of  \nthis project?\n←\n←How much is it worth to us to solve the issue at hand?\nForcing the Team\nAdditionally, the implementation team defines the lack of clarity. The  \nimplementation team is used as a lever to judge the level of clarity needed in order to  \nbe successful. In order to scope a project successfully, the implementation team must  \ncreate deliverables that it can achieve and it must properly define and limit those  \ndeliverables. \nFurthermore, the outcome owner must agree to the deliverables and to the  \nlimits put upon them. Failure to reach agreement keeps the project from progressing.  \nThe BKPM facilitates this process until both opposing seats of the table are satisfied.  \nThe BKPM participates in this process by exposing risks that must be  \naddressed by both other parties. The BKPM also participates by measuring and  \nportraying the level of risk being assumed by the project caused by any less-than-\nclear deliverables or specifications and develops acceptable mitigation plans to deal  \nwith them if/when they are encountered. \nHere’s another advantage of keeping the BKPM separate from this process.  \nFirst, if the solution team has to go back to tell the customer that he or she can’t have  \nthe outcome within the cost and time constraints, there’s usually pushback. If the  \nBKPM is part of the process, the BKPM can’t be an honest broker. But an honest  \nbroker is exactly what’s necessary when this happens.\nFirst, the BKPM has to review the solution. Is the team working hard enough  \nor smart enough? If not, the BKPM has to force them to find a better way.\nSecond, the BKPM has to make sure that any technical solution is honest: that  \nit’s a reasonable approach that doesn’t require ridiculously compressed timelines,  \ncost overruns or hidden costs, or — worst of all — burned-out teams.\nThird, once the BKPM is satisfied that the solution team has done the best job  \npossible, the BKPM has to take the solution to the customer. If there’s a conflict  \n(cost, time, performance, or risk isn’t within boundaries), it becomes the BKPM’s  \nresponsibility as honest broker to negotiate and arbitrate the solution.\nYes, sometimes that means the project doesn’t go forward. But it’s cheaper to  \ndeal with that up front rather than wait for an expensive failure before everyone  \nrealizes that it was doomed from the start.\nSimilar to the discussion above about the word “force,” because the BKPM  \nowns the process, we can insert gates in the plan that make it impossible to proceed  \nwithout a sufficient level of clarity in the deliverables being committed to by the  \nsolution team. This gate is usually all of the force that is needed to compel the  \nsolution team to provide the level of detail necessary and level of commitment  \nnecessary to the project deliverables. Deliverables are not the same as outcome.  \nOften time, deliverables can change and still satisfy the outcome owners. There is  \nusually more than one way to skin that cat. \nThe BKPM and the Process\nOf course, that’s not nearly all the BKPM does. The BKPM must manage the  \nprocess, and that includes many other issues.\n←Preparing (or at least validating) the overall plan. \n←\n←Making sure that customers and team members know about changes and  \nissues as they arise. \n←\n←Establishing milestones to ensure that the project consistently moves  \nforward. \n←\n←Keeping the focus on achieving the outcome, rather than getting buried in  \nthe technical details. \n←\n←Choosing the best way forward when presented with alternative  \napproaches.\n←\nNot everybody can do this job. As we’ve learned, there are a number of  \ncharacteristics of the BKPM — but we’ve left off one. The BKPM must have the  \ncredibility with both the sponsor and the team to force the process and ensure that  \neveryone takes ownership.\nIn the actual process of managing the project, the BKPM takes the lead,  \nmaking sure that everyone sticks to what they’ve agreed to. When problems arise, the  \nBKPM continues to manage the three-sided table, forcing sponsors and team  \nmembers alike to face the challenges of the project head on and to make whatever  \ncourse corrections are needed. The key to this process is exposing the issues and  \nmaking sure that it is discussed and resolved. \nAnd, as we’ve already learned, the BKPM moves forward consistently .\nPayoffs from the Three-Sided Table\nWhen the project manager is considered part of the team itself, rather than an  \nindependent part of the three-sided table approach, the project manager is part of  \nmanagement when deciding about the goals and objectives, and part of the team  \nwhen advocating a technical solution. That creates a tendency for the project  \nmanager to become an advocate, not an analyst, for the two sides. This isn’t optimal.\nThere’s often a conflict between what the customer wants and the team says  \nthey can deliver, and someone has to decide. If it’s the customer, the team can be  \nforced into an impossible situation. If it’s the team, the customer may be paying a lot  \nmore than needed to solve the problem. You need an honest broker, someone who  \nstands outside the conflict, to make it happen. That’s the BKPM.\nManagers aren’t always the subject matter experts about the type of work  \nbeing done in the project. Many people who need IT solutions aren’t IT  \nprofessionals, for example. If you push the team into an impossible project, nobody’s  \ngoing to win.\nWhat you want is the truth. (And you can handle the truth.) \nTeams don’t always understand the wider context. Some requirements on a  \nproject may be flexible, but others are absolute, and which is which depends on the  \ncircumstances. Those circumstances aren’t always obvious to outsiders. Just because  \nyou tell the team the requirement is absolute doesn’t mean it really is, or that they  \nbelieve you. What they need, as much as you, is the truth, whatever it might be.\nThe BKPM holds everyone’s feet to the fire. The BKPM challenges the  \nassumptions and ideas that the customer or sponsor puts forward. Is the objective  \nclear and specific enough to allow the team to work effectively? Are the triple  \nconstraints of time, cost, and essential performance reasonable? Is risk within  \nbounds?\nThe BKPM challenges the proposed technical solutions and approaches that  \nthe team comes up with. Are they reasonable approaches to achieving the project  \nwithin the triple constraint? What’s the level of risk?\nAs process owner, the BKPM is the escalation point for most project issues,  \nfreeing the senior executives on the customer side from dealing with any but the  \nmost serious and far-reaching issues. The BKPM pulls in executives only when  \nnecessary — letting them sleep at night.\nFinally, the BKPM is the person who needs to stop the project and hold the  \nright people accountable if the goals and the solution can’t be brought together.\nBecause the BKPM owns the process, the BKPM has P&L accountability for  \nthe project’s success or failure. The BKPM won’t let the project go forward until  \nthere’s a reasonable prospect of success. That’s in everybody’s best interest.\nThe Power of Why\nProject objectives lay out the “what” of a project: a spelled-out goal, defined  \nrequirements, deliverables, and other quantifiable measurements that correspond to  \nproject success. \nProject managers and project teams develop the “how” of a project during  \nplanning: timelines, budgets, work assignments, and status reporting. Most projects  \nare doing well just to get to the “what” and “how,” rather than blindly heading off  \ninto the wilderness hoping to stumble upon success.\nVery few projects ever get to “why.” Why do we need a new IT system? Why  \ndo we need to expand our staff? Why are we performing these steps in paying an  \ninvoice?\nSupplement your “why” questions with “what ifs.” What if we kept our  \nexisting system? What if we reduced our staff? What if we missed some of the steps  \nin paying an invoice?\nIf you don’t know what the problem is, or what the solution does (and  \ndoesn’t) do, all the project management in the world won’t improve your situation.\n←How are the problems that this project is supposed to solve being handled  \nright now?\n←\n←How does this project fit in with the other priorities and goals of the  \nprogram?\n←\n←How good does the solution have to be to solve the problem adequately?\n←\n←What would a perfect solution look like?\n←\n←Who has a stake in the outcome of the project? What does the outcome  \nlook like for each stakeholder?\n←\n←Do we really understand the problem or the solution?\n←\nIn one case, we had a client engaged in a lean manufacturing effort to find ways to  \nreduce operating costs. One step in the quality control process involved X-raying the  \nwelds in a containment vessel, finding and repairing any microscopic defects in the  \nweld, and after that pressure testing the vessel to make sure it would hold.\nThe performance record of the tests revealed that whether or not the  \nmicroscopic defects were repaired, the vessels always and without exception  passed \nthe pressure test. Given that the X-raying and repair step took time and cost money, it  \nappeared as if that step could be skipped with no degradation of quality whatsoever.\nOne staff engineer, however, took the time to ask why. If there was never a  \nproblem with vessels failing the pressure test, why were the X-rays added in the first  \nplace? Upon investigation, the secret was revealed: the vessels used to fail pressure \ntesting quite regularly, not because of microscopic defects in the welds, but because  \nof grosser errors. When the welding contractor received the X-rays showing visible  \ndefects, it inspired greater quality assurance efforts on the part of the contractor, and  \ngreater effort on the part of the welders themselves to do an outstanding job.\nIn other words, the X-rays were very important indeed — but their effect on  \nquality was psychological rather than literal. Worse, subsequent engineers who didn’t  \nunderstand the underlying “why” had gone to more expensive and thorough X-raying  \nof the welds, adding cost without adding value! Asking why allowed the company to  \nsave money without creating a new defect problem in the process.\nReturn to Table of Contents\nCHAPTER 4: No Bullshit Project Management\nA Poor Workman Blames His Tools\nA client once asked us to recommend some project management software, and said  \nthat he’d tried Microsoft Project® and he really didn’t like it very much. He was  \nwondering if Oracle Primavera® (an enterprise-level system) would be more  \nappropriate.\nWe asked about the kinds of project the client did. They were relatively small:  \nusually under $50,000, involving teams of three to five people, and taking six to nine  \nweeks.\nOur immediate assumption was that project management software might not  \nbe necessary at all, but we asked one final question: what exactly was it that he  \ndidn’t like about Microsoft Project®.\n“It keeps trying to do something called a Gantt chart,” he said, “but it won’t  \ntell me what a Gantt chart is!”\nThere are any number of good books on the techniques and tools of classical  \nproject management, and it’s not our intention to repeat them here. If you need to  \nknow what a Gantt chart is (it’s a bar graph of the project activities on a timeline),  \nyou can find that information many other places.\nWhat’s more, it’s not always important. While we often use Gantt charts  \nourselves, we don’t make a fetish out of them. Sometimes a list of critical milestones  \nand interim dates is all you really need.\nWith all the modern emphasis on getting PMP® certified, using cutting-edge  \nproject management software, and following a detailed process, something gets lost.  \nWe fail to see the forest for the trees; we mistake lots of paperwork for lots of real  \nwork.\nThe dirty little secret of project management is that it costs time and money to  \ndo it right. If you’re running a $10 million project, even $1 million might not be too  \nmuch to spend on project management if you can guarantee you’ll be on time and on  \nbudget. It all depends on the complexity of the moving parts that need to be  \ncoordinated. But if you’re running a $10,000 project, you’ll be long since done with  \nthe work before you could get halfway through a formal plan. One size most  \ndefinitely doesn’t fit all.\nThe truth is that the $10,000 project can get along just fine without much in  \nthe way of a formal plan. The $10 million project, on the other hand, really needs a  \nwhole lot more in the way of control and oversight. One of the first jobs of the  \nBKPM is to decide when it comes to project management, how much you really  \nthink you need.\nA lot of formal project management, in our opinion, is overkill. You can  \nspend more time making fancy-looking reports and charts than you spend actually  \nmanaging the project. That doesn’t provide a benefit for anybody — customer, team,  \nor BKPM.\nThe basic rule is simple: Don’t drive carpet tacks with a sledgehammer.\nIn this chapter, we’ll explore how the bare-knuckled approach differs from  \ntraditional PMI/PMBOK® project management. Which tools of project management  \ndo we use, which do we modify, and which do we ignore?\nLet’s take a look.\nEstablish Goals and Objectives (Project Initiation)\nWe’ve established that the customer must own the outcome, and we’ve also  \nestablished that this is a lot easier said than done. Customers don’t always  \nunderstand their own needs, aren’t always able to articulate them, and sometimes  \nhave a motivation to keep them from the prying eyes of team members. The BKPM’s  \nrole, as we’ve learned, is to force the process as part of getting everyone on the same  \npage.\nWhat is a project? PMI defines it as “temporary and unique,” and so it is. But  \nmore importantly, a project is a means to an end. We launch a project because we  \nhave some kind of issue: a problem, an opportunity, or a change. To resolve the issue,  \nwe first have to define it. In other words, before we ask what’s the project, we need \nto ask what’s the problem.\nLet’s say that we’re delaying sending out invoices to customers because our  \nprocess takes too long. That’s a problem, but that doesn’t tell us immediately what  \nthe project should be. Is it an IT solution? Is it a management problem? Does the  \nproblem lie in accounts receivable, or is it somewhere else? Our answers to these  \nquestions help turn the problem into a project.\nLet’s assume we learn that yes, the problem is in accounts receivable and,  \nfurther, that it lies within the IT realm. Now we have to quantify it. How fast are we  \nprocessing invoices now, and how fast do we  want or need to process them in the  \nfuture? As we answer those questions, we begin to define the outcome we want.\nIn developing the technical solution, we need both the team and the BKPM  \ninvolved. While some customers are highly knowledgeable about IT, others are not.  \nThey cannot necessarily tell from a proposed technical solution whether it’s going to  \nachieve the outcome. Again, the BKPM, serving as honest broker, works with both  \nsides to make sure (a) the technical solution is valid and can be done within cost and  \ntime parameters, and (b) that the technical solution will in fact achieve the outcome.\nIn developing the process, the BKPM, as process owner, takes the lead. That’s  \nthe project management piece. It involves planning, risk management,  \ncommunication, and project leadership.\nDon’t ever assume that people will automatically or naturally end up on the  \nsame page. This assumption has sunk any number of projects. The BKPM’s role is to  \nforce the process, and to ensure that the final product is written down and agreed to  \nby the participants. (In formal project management speak, we call the process  \n“initiating the project” and the written statement of what we’re going to do is the  \n“project charter.”)\nSetting the objective and validating the technical approach within the triple  \nconstraints is the first step in any project. Mess that up, and nothing else you do will \nbe enough to compensate. That’s the essence of strategic project management. It’s  \nhard work, it’s challenging, and it all too often gets political.\nWhen the Answer is Unknown\nEven if every stakeholder is positive, hard working, insightful, intelligent, and able  \nto put all politics aside (as unlikely as that sounds), it may not be enough to establish  \na meaningful objective. Sometimes, there’s just too much that isn’t known. We have  \nan idea of the general direction; we may even have an idea what the eventual  \noutcome needs to be; but we just don’t know enough about the work or the  \nchallenges or the details of the vision to come up with a concrete objective.\nWhat now?\nAs any research scientist will tell you, just because you don’t know what  \nyou’re looking for or how to go about finding it, it doesn’t mean you can’t move  \nforward. The experimental method is  iterative. We try again and again. \nThomas Edison wrote about the development of the light bulb, “During all  \nthose years of experimentation and research, I never once made a discovery. All my  \nwork was deductive, and the results I achieved were those of invention, pure and  \nsimple. I would construct a theory and work on its lines until I found it was  \nuntenable. Then it would be discarded at once and another theory evolved. This was  \nthe only possible way for me to work out the problem. ... I speak without  \nexaggeration when I say that I have constructed 3,000 different theories in  \nconnection with the electric light, each one of them reasonable and apparently likely  \nto be true. Yet only in two cases did my experiments prove the truth of my theory.”\nOne of the big topics in contemporary project is known as “agile  \ndevelopment,” in which requirements for engineering and technology development  \nprojects are determined iteratively. Regular project management has the challenge  \nthat sometimes customers can’t develop requirements up front; they need prototypes.  \nBy building something, examining it, learning lessons, and trying again, projects that  \ncan’t be done in a single cycle can be achieved in multiple cycles.\nThe downside, of course, is that these kinds of projects often take longer and  \ncost more money, so if you really do know your requirements in advance, everyone’s  \nbetter off. But sometimes that just isn’t possible. The choice is between spending the  \nnecessary time and money or not doing the project at all. \nIf you have to follow this course, patience is necessary. As Edison added,  \n“Many of life’s failures are people who did not realize how close they were to  \nsuccess when they gave up.”\nGood, Fast, or Cheap? (Triple Constraints)\nWhen you do have validated requirements and are ready to get to work, you have  \nadditional challenges. For example, everybody in management sooner or later hears  \nthe old joke, “Did you want it good, fast, or cheap? Pick two.” Of course, our  \nimmediate reaction is that we’d prefer to pick all three, but it’s inarguable that there’s  \noften tension among the competing demands of a project and the constraints under  \nwhich it operates.\nThe classic “triple constraint” model focuses on the three elements that are  \ncommon to virtually every project: the cost constraint (budget and resource), the time  \nconstraint (schedule and deadline), and the performance criteria (the minimum  \nnecessary to achieve success). There are, of course, many other constraints that may  \napply, such as the level of risk, the need for quality, and the presence of regulations  \nand standards.\nFigure 4-1 illustrates the Triple Constraints model. While issues of risk and  \nquality are constraining, their application to each specific project varies. Time, cost,  \nand scope, however, are universal.\nFigure 4-1. Triple Constraints.  The universal issues of time, cost, and scope apply  \nto every project.\nHierarchy of Constraints\nThe idea that success in one constraint can only be achieved at the cost of another  \nconstraint (“pick two”) is misleading and wrong. You can have all three — at least  \nsome of the time. Some constraints are absolute — violate them and bad things  \nhappen. Others, though, may have flexibility. \nThe constraints are normally ranked in a hierarchy based on the goals of the  \nproject — the why sets the priorities.\n←The driver is the constraint central to the definition of success. If you fail  \nto meet the driver, you fail to achieve the outcome.\n←\n←The weak constraint is the most flexible of the three, but is not always or  \nnecessarily the least important.\n←\n←The middle constraint,  as the name suggests, falls in between the two.\n←\nSometimes, there’s flexibility in the timing. We’d prefer a shorter schedule to a  \nlonger one, but there is no hard-and-fast deadline. Sometimes, there’s flexibility in  \nthe budget. We’d prefer to spend less, but if necessary we’ll spend more. And finally,  \nsometimes there’s flexibility in the performance requirements — some requirements  \nmay even be optional.\nIn planning your project, you must plan to achieve the project driver at all  \ncosts. The legitimate flexibility in the other constraints is a vital tool in that process.\nFor a sense of the Triple Constraints in action, think about the Apollo  \nprogram.\nApollo and the Triple Constraints\nIn his famous 1961 speech, President John F. Kennedy established the Apollo  \nprogram with the following Triple Constraints.\n←Time: “Before this decade is out”\n←\n←Performance: “Landing a man on the Moon and returning him safely to  \nthe Earth”\n←\n←Cost: Unspecified — to be determined by Congress\n←\nWhat’s the hierarchy? Most people would say the driver is performance, getting there \nand back safely.\nBut think about why are we doing the project. The motivation for the Apollo  \nprogram was the space race with the Soviet Union. Coming in second won’t do. That  \nmade time (not “the end of the decade,” but rather “before the Soviets”) the driver.  \nPerformance was the middle constraint, and cost was weak. That seems pretty cold,  \nbut it’s realistic. A single mission failure wouldn’t kill the program.\nIn managing this project, solve problems first by spending money and second  \nby taking more risk — but you can’t compromise the schedule.\nIn the Space Shuttle program, which wasn’t a race, cost was the driver,  \nfollowed by performance, with time bringing up the rear. As your driver changes, so  \ndoes the right decision — as evidenced by the fate of Challenger.\nDesigning a Process (Planning)\nBased on the understanding of the desired outcome, the nature of the technical \nsolution, and the environment of constraints, the role of the BKPM is to establish the  \nright process. That’s the process of project planning.\nThe process consists of a technical approach (there may be several to choose  \nfrom), a timeline of the work necessary to get there, and a resource budget (which  \nincludes money, of course, but also every other needed resource that’s in limited  \nsupply).\nThe goal is a clear, concise statement of what you want the end state to look  \nlike. Notice that’s not always identical to the project objectives, which is what the  \nteam is supposed to deliver. As we’ve established, if you procure a new IT system,  \nit’s not because you want a new IT system as such. You want the new IT system to  \nsolve a problem, make an improvement, or take advantage of an opportunity. That’s  \nthe goal. It’s when you start translating a goal into objectives that you start running  \ninto trouble. It’s not as easy as it looks.\nSometimes the IT team will list a series of objectives that will improve the IT  \nsystem as such, but won’t affect how well it achieves the goal. Or management will  \npropose an objective that doesn’t actually achieve the goal, usually out of a  \nmisunderstanding or the need to sound smart. Once that happens, your project once  \nagain is compromised. That’s why an independent BKPM, loyal only to the process,  \nis so critical to your success.\nFinding the Most Efficient Path\nSince both objectives and solutions are on the table, the customer and the team are  \nbrought together, facilitated by the BKPM, to find the most efficient way to achieve  \nthe outcome. The customer is confronted when the goal isn’t realistic or achievable  \nwithin the constraints, and the team is confronted with the need to offer a credible,  \nreal solution.\nThe BKPM facilitates the process, but owns neither the goal nor the solution,  \nas we’ve seen. From the BKPM’s perspective, the project becomes an entrepreneurial  \nendeavor. The BKPM is cast as an “interim owner,” or as an “outcome advocate.”  \nThat frees the BKPM to adapt as the situation may require, always steering toward  \nthe goal no matter what winds or waves buffet the ship.\nThe Project as Entrepreneurial Enterprise\nA project, temporary and unique as it is, disrupts the organization around it.  \nTemporary supervisor/subordinate relationships add complexity to the chain of  \ncommand. Some people are no longer available for other kinds of work, at least for a  \nperiod of time. Priorities get set, and not everybody gets the number one slot. \nTo some extent, a project is like a mini-company running alongside your  \nexisting organization. That mini-company, like all growing organizations, needs  \nentrepreneurial leadership.\nProject leaders aren’t always the same as project managers, in the same way  \nthat in a play the director is usually not the stage manager. The project as a whole  \nneeds leadership. The administration of a large, complex project needs someone to  \nfocus on the tracking and operations — a COO to the project manager’s CEO. The  \nBKPM, by the nature of the role, is the CEO.\nLike any executive, the project manager views the project from a  \nmultifunctional perspective: operations, sales and marketing, finance, human  \nresources, procurement, and the rest. The broader the frame of reference, the more  \neffective the BKPM tends to be. Former executives often make great BKPMs  \nbecause of that broad perspective, although this isn’t universally true.\nBusinesses worry about customer and staff. This brings us back to the three-\nsided table. The BKPM manages customer relations and also manages the staff.  \nThat’s why the BKPM must keep at a professional distance between them.\nProcess and Planning\nIf the strategic level of the project is the domain of leadership, the operational part of  \nthe project is project management. In the BKPM method, the key to project  \nmanagement is balance.\nAs we’ve said, the project charter is the written statement that brings together  \noutcome, technical solution, and constraints. The project plan is the roadmap of the  \nprocess — how we’ll get from where we are to where we want to be. \nWhile the basic steps are similar for almost every project, the level of detail  \nand formality varies, all the way from back-of-the-envelope to full-bore project  \nplanning. Our key questions are these: \nWhat’s actually in this project? \nWhat are we going to do? \nWhat aren’t we going to do? \nThe BKPM must get agreement on the scope of the project, and break down the  \nscope in sufficient detail so that the team can accomplish it. The initial high-level  \nscope is usually part of the project charter agreement, but details often come later. \nThe traditional tool for breaking down scope is called a Work Breakdown  \nStructure (WBS). While there’s software available to handle this, a set of Post-it®  \nnotes are often all you need.\nIn a WBS, you prepare an “organizational chart” of the actual work packages  \nthat need to be accomplished. This both defines the work and helps the BKPM  \norganize it. The big requirement of a WBS is that it contains all the work (and no \nmore) that is necessary to achieve the outcome. Figure 4-2 provides an example.\nFigure 4-2. Work Breakdown Structure.  The Work Breakdown Structure (WBS)  \nshows the work to be done in an organization chart format.\nEach work package in the WBS will take a certain amount of time and consume a  \ncertain amount of resources. Putting that together gives us the schedule (Gantt chart,  \nmilestone chart, or a simple calendar), the budget (costs assigned to each element,  \nusually a spreadsheet), and a list of work requirements for the BKPM to oversee and  \nmanage.\nOnce you’ve prepared the planning documents, wrap them into a project deck  \nand hold a project kick-off meeting with the key team members to show them what  \nthey’ve asked you to undertake.\nA good kick-off meeting is a powerful tool in the BKPM toolbox. It’s an  \nopportunity to build enthusiasm and commitment, a way to find out if there are  \nserious doubts or concerns, and above all, a process to ensure that everyone starts the  \nproject on the same page.\nRisk and Change\nManaging risk and managing change are two of the most dangerous issues on any  \nproject. The BKPM must do an outstanding job of anticipating and planning for  \nknown risks, preparing for unknown risks, and for managing the inevitable changes  \nthat occur on any project.\nRisk Management\nBecause project managers don’t have crystal balls (although BKPMs need steel  \nones), we have risk management. When we look to the future, we may have a fairly  \ngood idea what is likely to happen, but if we think we know everything, we’re  \ndeluding ourselves. \nThe goal of risk management isn’t to predict the future. That’s a mug’s game.  \nInstead, risk management is about trying to increase your chances of positive results.\nRisks can be both negative (threats) and positive (opportunities). A pure risk \nonly contains a threat. If we don’t have an accident, our life continues on the way it  \nwas before. Business risk combines threat and opportunity. If we release a new  \nproduct to market, we might make a lot of money, but the product may turn out to be  \na dog and we could lose a lot of money.\nIt’s generally smart to avoid or limit pure risk as long as the price is right. We  \ncan buy insurance, implement safety standards, or generally act more prudently. But  \nwith business risk, the strategy changes. Sometimes, we want to add business risk to \na project because we think we have a good chance at getting the upside result.\nThe fundamental formula for risk is R = P x I: the value of a risk is the  \nprobability of an event occurring times the impact of the event if it does occur. If  \nthere’s a ten percent chance that we’ll be late on a delivery, and the penalty is $1  \nmillion for being late, the value of the risk is 10% x $1 million, or $100,000. If we  \ncan eliminate the risk for less than $100,000, we are ahead of the game. \nWith a business risk, we add together the value of the risk for the downside  \nand for the upside. If there’s a ten percent chance of losing $4 million and a  \ncorresponding ninety percent chance of making $2 million, the expected value of the  \nrisk is (90% x $2,000,000) + (10% x -$4,000,000), which works out to $1.8 million -  \n$400,000, or $1.4 million. Even though there’s a chance of losing twice as much as  \nwe could gain, the likelihood of a positive outcome is so much higher that we’d see  \nthis as a pretty good bet. That’s assuming, of course, that losing $4 million won’t put  \nus out of business.\nNotice that the dollars involved don’t always tell the whole story. In our pure  \nrisk scenario, we decided that spending less than $100,000 to get rid of the 10% x  \n$1,000,000 risk was a good investment. But what if the cost of getting rid of the risk  \nis $110,000? In that case, you have to make a values judgment about the risk \npremium. Is paying an extra $10,000 a good investment? Your mileage may vary.\nOn the business risk, we might still pass on the investment even though its  \nexpected value is $1.4 million if the consequence of losing $4 million would be  \ncatastrophic. We buy car insurance even though there’s a risk premium involved  \n(after all, the insurance company has overhead and wants a profit) because most of  \nus can’t afford the cost of a terrible accident. The probability may be low, but the  \nimpact is very high. Risk calculations help frame a decision, but they don’t make the  \ndecision for you. You still have to do that by yourself.\nThe problem for BKPMs is that we frequently don’t have good information  \nabout how likely an event is, or sometimes even what the net impact might be. If  \nthere’s a small chance of a terrible financial loss, you can’t turn that into a neat dollar  \nfigure using P x I, but the calculation still applies. What’s “low” times “terrible”? It  \nmay be “catastrophic,” or it might only be “serious.” That may not be great  \ninformation, but you still have to make a decision.\nSome projects have relatively low levels of risk, but those projects frequently  \naren’t headed by BKPMs. If the project is serious enough to call in the big guns, the  \nchances are that the risks are equally serious.\nThe basic outline of managing project risks goes like this.\nFigure 4-3. Risk Management Process.  This six-step approach to project risk is a  \nvital part of effective project management.\n1.Identify the risks.\n2.Study the risks to understand their nature, probability, and impact.\n3.Decide what (if anything) you can or should do about specific risks.\n4.Establish a contingency reserve of extra money or time to cope with  \ngeneral and unforeseen risks.\n5.Modify your project plan based on your risk solutions.\n6.Monitor the risks on your project and act as necessary to deal with  \nnew risks that crop up from time to time.\nSome organizations already have established risk management protocols. In others,  \nyou may need to develop your own to cope with the risks on a given project. While  \nthis is valuable, don’t go overboard. You need a level of risk management that  \ncorresponds to the real risk level, and to the rewards and consequences that can result  \nfrom risk events.\nBKPMs are risk takers, but never foolhardy. You can’t be afraid of risks when  \nyou step out into the unknown of projects, but that doesn’t mean you shouldn’t be  \ncareful and well prepared. If you’re not a risk taker, you probably won’t climb a  \nmountain. But if you climb a mountain, you’ll spend a lot of money and time to get  \nyour safety gear in good shape, and you’ll be careful on the ascent.\nChange Management\nChange itself does not kill projects. Uncontrolled and unmanaged change  \nkills projects. Change is to some extent both natural and inevitable, and can result in  \nan improved project outcome. For the BKPM to manage the process, however, the  \nBKPM must have a change management approach and methodology agreed to and  \nput in place before the project begins.\nChanges can be voluntary or involuntary. Examples of involuntary change are  \nchanges that are required because a project has encountered a risk, surprise, or speed  \nbump. Voluntary changes normally (but not always) come from the customer.  \nPerhaps changes elsewhere in the organization have altered the desired outcome, or  \naffected the constraints that surround the project. Some changes are subject to  \nnegotiation; others present themselves as cold, hard facts.\nIt’s vital that changes be put in writing, signed by the customer, evaluated by  \nthe BKPM, and integrated into the process. That’s true no matter what the change,  \nwhere it comes from, how negotiable it is, or why it’s being made. Any change that  \nfalls outside the process is a danger to the project.\nSpecial Issues\nAgile vs. Waterfall\nThere are always hot topics in management circles, from Six Sigma to “lean”  \nmethodologies. One of the big issues in recent project management has been the  \ndevelopment of “agile” methods of running a project, as opposed to the traditional  \n“waterfall” method. We discussed that a little earlier in this chapter when we talked  \nabout projects in which the customer isn’t clear about the desired outcome or  \nprocess. That’s one situation that calls for agile thinking, but it’s not the only one. \nSome classes of projects have pretty clear outcomes, but the details need  \niterative development. In writing this book, for example, we did know the basic  \nphilosophy and approach even before a single word was written. However, the book  \nhad to iterate through a number of drafts to make sure the final product was clear and  \naccurate.\nIn the waterfall method, tasks follow a rigid sequence of dependencies. Task  \nB can’t start until Task A is finished. If something delays Task A, the start of Task B  \nis immediately in jeopardy. In agile, the situation is far more fluid. The project goes  \nthrough iterations, in which a rough product becomes increasingly refined and  \nrobust. One task may not follow another in any rigid sense.\nThere are advantages and risks in both approaches, but advocates for each  \ntend to oversell their virtues and downplay their faults. In most cases, we think an  \narbitrary preference of one method over another is a waste of time. The crucial  \nquestion is this: What is the simplest way forward?\nInitiatives vs. Projects\nProjects, by definition,  end. That’s in contrast to operations, which are ongoing. In  \nbetween the two, however, there’s a gray area we’ll call initiatives. Initiatives have \nsome characteristics of projects and some characteristics of operations. If you’re  \nimplementing a lean Six Sigma initiative, for example, there’s definitely a need for a  \nplan and a kick-off meeting, but the initiative doesn’t have a crisp, clear end point.\nThe most important difference to consider is that in an initiative, action is  \nmore important than outcomes. In our hypothetical lean Six Sigma initiative, you  \nhave to push forward, but without a defined end point, any progress is good.  \nSituational awareness and clarity of thought matter more than a detailed plan.\nThe Learning Customer\nOne place to prefer agile over waterfall development is when you have a “learning  \ncustomer.” The learning customer can’t specify everything clearly up front, although  \nthe customer usually has an idea about the desired end state. \nThere are many legitimate reasons why this might be the case. For example,  \nperhaps no one knows the underlying situation well enough to know what issues or  \nopportunities may arise. In an overall initiative, the learning customer is the norm,  \nnot the exception. Initiatives are big and complex, they have multiple stakeholders  \nwith different interests and points of view, and seemingly innocuous changes can  \nhave unpredictable ripple effects.\nIn this case, an iterative approach is the best you can do. Agree on an interim  \ngoal, manage the team to accomplish it, and then go over it with the customer. How  \nclose are you? What have you learned? Are you done, or do you need to do more  \nwork?\nIn the old Total Quality Management (TQM) approach, popular in the 1980s  \nand 1990s, the mantra was “continuous improvement,” an iterative way to improve  \nquality. To manage quality improvement, TQM guru W. Edwards Deming used the  \nPDCA cycle: Plan, Do, Check, Act, shown in Figure 4-4.\nFigure 4-4. PDCA Cycle.  From quality to iterative projects, the PDCA Cycle is a  \npowerful approach to achieving continuous improvement goals.\n←\nPlan: Develop a plan based on available knowledge and understanding.\nDo: Execute the plan as well as possible.\nCheck: Evaluate what you’ve done; identify problems and issues along with  \nroot causes and areas for improvement.\nAct: Decide on the next step. Are you done? How has your knowledge  \nchanged? What should you do next?\nLather, rinse, repeat.\nReturn to Table of Contents\nCHAPTER 5: Why Projects Fail — and How BKPM  \nPrevents It\nThe CHAOS Report Revisited\nThe CHAOS Report, as we learned earlier, showed that nearly three quarters of all  \nprojects could be considered failures. Failures, in the CHAOS Report, describe  \nprojects that were either cancelled before completion or that didn’t meet at least one  \nof the Triple Constraints — they were late, over budget, or didn’t meet all the  \nperformance requirements.\nNobody wants to fail. Unfortunately, as the CHAOS Report tells us, most  \nprojects do fail, either in whole or in part. No system, no matter how good, can  \nprevent every failure. But a good system can reduce both the frequency and the \nseverity of failure.\nThe CHAOS Report grouped projects into three “resolution types.” Here are  \ntheir definitions.\n←Failed. The project is cancelled before completion.\n←\n←Challenged. The project is completed and operational, but over-budget,  \nover the time estimate, and with fewer features and functions than initially  \nspecified.\n←\n←Successful. The project is completed on time and on budget, with all  \nfeatures and functions as originally specified.\n←\nFrom a technical point of view, those categories make sense, but from a customer-\ncentered point of view, things look very different indeed.\nThe Virtue of Failed Projects\nLet’s start with failed. That means the project was cancelled before completion. Is  \nthat necessarily a bad thing? If you’re attempting a risky project, you may want to  \nlook ahead to see if there are any “go/no-go” decision points. Canceling a project  \nbefore it goes off the rails can save a fortune — and make risks more worth taking.  \nAfter all, organizational success is built on the idea that we do the things valuable to  \nthe organization, not waste money on projects that should never have been started to  \nbegin with.\nIn fact, one of the most important roles of the BKPM is to force early failure . \nIf a project’s wrong-headed, destined to fail, too expensive, not worth the risk, or  \notherwise problematic, killing the project before it gets underway is arguably a good  \nthing. It saves money, avoids damage to organizational (and individual) reputations,  \nand above all, allows the organization and the customer to discover the right project, \nand do that instead.\nDon’t you want your project manager to tell you when that’s the case?  \nFailure, in this sense, should be considered a victory for everyone concerned. Failing  \nearly is dramatically cheaper and better than failing late, after all the money, time,  \nand effort has been sunk.\nThe BKPM’s role at the beginning of any project is to determine if the goals  \nare clear and doable, the budget and resources are sufficient, and the implementation  \nteam is capable of performing the necessary work. If that’s not the case, either the  \nsituation has to change or the project needs to stop then and there until the situation  \nis resolved.\nOne might argue that the highest order of business for a BKPM is preventing  \nproject failure. Whether the project never leaves the docks (stopped before the failure  \ncan be damaging) or makes it to the New World (achieves meaningful success even if  \nthe success isn’t what was originally defined), by hook or by crook the BKPM can  \nsay, “Yes, that was ugly – but we designed it that way.” This is a powerful statement  \nindeed.\nWhen you stack up the cost of hiring an outstanding BKPM against the cost  \nof letting an ill-conceived project burn through money and resources, it’s clear that  \nno matter how much a BKPM costs (and they don’t come cheap), it’s a bargain.\nWhen “Challenged” Is Just Another Word for Nothing Left to  \nLose\nChallenged has both positive and negative connotations. Sometimes, “challenged”  \nbecomes a politically correct term for “screwed.” Some aspect of the triple  \nconstraint, whether it’s time, cost, performance (or all three), has been compromised.  \nThere’s usually a small window in which that’s no problem. If your $30  \nmillion construction project ends up $250,000 over budget (a little less than one  \npercent), depending on the circumstances, people aren’t likely to be that upset. But  \noutside that window, you’ve got trouble. \nIn another sense, however, “challenged” is a good thing. A challenged project,  \nafter all, is challenging — and going after a stretch goal may be worth it even if you  \nfall short. Take, for example, the infamous Denver International Airport (DIA)  \nproject, which opened 16 months behind schedule and nearly $2 billion over budget. \nWidely derided as a project management failure, today DIA is the 5th busiest  \nairport in the world measured by aircraft movements. It has been voted Best Airport  \nin North America by Business Traveler magazine six years in a row, and Time called \nit “America’s Best Run Airport” in 2002.\nAs embarrassing and damaging as the cost and schedule overruns were,  \nDenver is probably still a lot better off than it would have been without the new  \nairport, and over the long lifetime of an operating airport, it’s still likely to deliver a  \nnet economic benefit, if one slightly slower in coming than initially planned.\nOf course, everyone involved would have preferred that these problems not  \nhappen, but with a project that massive, the idea that nothing would go wrong was  \nsimply ludicrous. “Failure” must be kept in perspective.\nIt can easily be argued that just about every project of significant scope is at  \nleast potentially challenged — fraught with the kinds of risks that cause problems:  \nunclear costs, political issues, fuzzy objectives, problematic technology. That doesn’t  \nnecessarily argue for project cancellation, but we must be conscious of risks before  \nstepping into any project.\nFake “Success”\nEven projects the CHAOS Report would define as “successful” can sometimes  \nmislead. That’s what happens when, contrary to every bit of available evidence, the  \norganization persists in claiming that the project has actually succeeded. \nMicrosoft once claimed that the Zune was successful. Apple trumpeted its  \nsuccess with the Newton. Coca-Cola proclaimed that with the release of New Coke,  \nit had won the Cola Wars. Often, there’s some temporary factor that they can cite in  \nfavor of their claim, but it’s generally clear to the rest of the world that this is  \nbullshit — at least in the long run.\nThese examples also demonstrate that an organization can fool itself into  \nbelieving almost anything it wants. This is particularly true when the CEO or top  \nleadership invests ego in the decision. Executives too often believe they control the  \noutside universe as strongly as they control their own organizations, and end up  \nforcing everyone else to drink the Kool-Aid.\nFake success can also result from stopping too soon. If you sell your stock  \nwhen it goes up a few cents in value, you make some money, but if the stock  \nskyrockets in value over the next six months, you left a whole lot of money on the  \ntable. Just because you got where you originally decided to go doesn’t mean you  \nwent far enough.\nThat’s one more argument in favor of the BKPM and the three-sided table.  \nSomeone has to have the courage and organizational position to say that the  \nEmperor, in fact, has no clothes — or conversely, that the Emperor is overdressed.\nSuccess is in some ways subjective, and so is failure. This subjectivity  \nrequires an argument for defining meaningful success. That’s also why CEOs of  \nentrepreneurial endeavors (a category which clearly includes BKPMs) don’t just stop  \nat the first failure. They learn, improve, justify, and move forward. The CHAOS  \napproach isn’t necessarily wrong, but it’s not complete. Project ownership requires  \nthat you measure the right thing  — and the “right thing” is different on different  \nprojects.\nN-Dimensional Failure\nOf course, there are real failures in project management, but they often require the  \nBKPM to put the project in a wider context and to look deep beneath the surface to  \nsee what’s really going on. Failures, you see, are seldom one-dimensional.\nProjects are normally multidimensional. Measuring project success (and, for  \nthat matter, failure) can cover cost, time, performance, risk, quality, return on  \ninvestment, regulatory compliance, degree of improvement, and more. \nWhile we’d sooner not fail at any of these, sometimes failure in one area  \nstrengthens another. Depending on relative priority and value, it may be very much  \nin the interest of the project to choose some failures if they result in other successes.  \nWhile technically a failure, we could equally argue that it was a net improvement —  \nas in the case of DIA.\nThere is almost a Darwinian dynamic that occurs in these situations when the  \norganization obtains the real improvement benefits from the project, even when they  \ndiffer from the theoretical or imagined benefits. It takes the wider organizational  \nperspective of a BKPM to recognize and articulate these kinds of successes —  \ninstead of letting them be unfairly labeled as failures.\nAs we learned in our discussion of the hierarchy of constraints, the project  \nmust achieve the driver, but has increasing flexibility in the weak constraint. If you  \nmiss the deadline, on one project it’s not a big deal, and on the other, you’re dead.  \nSame thing with cost and performance.\nIf the performance is paramount, and you have a problem, you probably  \nshould spend extra money. If it’s not, you’re better off dropping some features on  \nyour wish list.\nBut the bottom line is this — are you better off having done the project than  \nyou would have been if you didn’t do it at all?\nTypes of Real Failure — and What To Do About Them\nWhile some failures (and some successes) are imaginary, others are all too real. Let’s  \nlook at the sources of failure and how the BKPM should deal with each.\nMistakes\nOne obvious cause of project failure, it would seem, is mistakes.\nActually, that’s not the case. Mistakes (as such) are seldom the problem. After  \nall, mistakes are natural and inevitable. Because projects are complex, constrained,  \nand unique, mistake-free projects are the exception, not the norm.\nIf something is inevitable on your project, it constitutes a known risk. If you \nfail to plan for it, that’s your failure as a project manager, not the failure of the  \nperson making a mistake.\nEven on a nuclear submarine you can’t afford to assume no one will ever  \nmake a mistake. Therefore, you add safety controls, checks and balances, and other  \nsystems to catch and correct those mistakes either before they happen or at least  \nbefore they produce any bad effects.\nMistakes aren’t all created equal. Some mistakes, if made, could sink the  \nproject; others are barely noticeable. Some mistakes are both rare and difficult to  \nmake; others are all too easy. \nDepending on the severity and the ease of a particular mistake, it’s incumbent  \nupon the BKPM to ensure that adequate mechanisms are in place to control for  \nnatural error. It’s part of the process.\nWhen mistakes slip through your system, the issue to address is the system,  \nnot the mistake itself. You can’t change the past; you can only affect the present and  \nthe future. The challenge is keeping the problem from happening a second time.  \nFigure 5-1 identifies strategies for managing mistakes.\nFigure 5-1. Mistake Management\nCatch mistakes early, before they have a chance to cascade out of control.\nDon’t shame people for making mistakes; it only encourages people to hide  \nthem.\nIdentify any critical areas where mistakes can be most damaging, and put in  \nextra checks and balances.\nIdentify areas that are fault-tolerant, where less than perfect is plenty good  \nenough, and favor speed over perfection in getting those done.\nBuild some inefficiency into the plan.\nLook for the root cause of mistakes. Some are the result of carelessness,  \nothers the result of inadequate training or support.\nSeparate the person from the problem, but pay attention to both. Assume good  \nintent and attitude on the part of the mistake-maker; that’s usually right. Few  \nmistakes are deliberate or passive-aggressive — and if they are, it will  \nbecome clear soon enough.\nExecution, by and large, doesn’t have to be flawless, but rather good enough to get  \nthe job done. Overemphasis on preventing minor mistakes tends to bog the project  \ndown in “analysis paralysis,” where no one wants to act for fear of being blamed if  \nthings don’t go perfectly. Fault tolerance speeds project success.\nFailure of Vision/Wrong Vision\nThe most critical project failures can almost always be traced back to issues with the  \nvision.\nFailure of vision means the failure to define a clear vision in the first place.  \nPerhaps the customer or client doesn’t understand his or her own needs completely.  \nSometimes there’s ego involved, or a fear of appearing ignorant, or even an attempt  \nto shift responsibility for the lack of results.\nOther times, the vision is clear, but wrong. Wrong visions are ones that won’t  \nsolve the underlying issue, even if they are successfully implemented. Wrong visions  \nare misunderstanding of the problem, or misunderstanding of what solutions are or  \nare not possible. Wrong visions are misunderstanding about root causes, human  \nmotivations, or organizational issues.\nUnchallenged visions haven’t been tested or analyzed enough to know if  \nthey’re right or wrong. They have lots of hidden assumptions. Unchallenged visions  \nhaven’t been tested to see if their cost and time projections are reasonable.  \nUnchallenged visions may signify customers who don’t want to face their own  \nproblems head on.\nAll these kinds of vision problems can destroy projects.\nIn the three-sided table, as we’ve learned, the customer or client is  \nresponsible for the vision of the project, but it’s the BKPM’s job to make sure it’s  \ndone and done properly. If there’s a problem with the vision, the scope is either  \nvague or wrong, and the budget and schedule, accordingly, are based on false  \npremises. In the end, we can only choose among spending more money, taking more  \ntime, or doing less — whichever hurts least.\nFailures of vision belong first and foremost to the customer or client, but it’s  \nthe BKPM’s job to make sure that doesn’t happen, even if it means pushing back or  \nconfronting the client. Better to have the fight now instead of waiting until you’ve  \nspent all the money and missed the deadline before you agree what the actual project  \nis all about.\nAs we noted earlier, a vision can evolve, so don’t assume just because there’s  \nno vision at the outset that there won’t be any vision at the end. Help educate your  \nclient or customer when it’s best to allow a vision to develop iteratively.\nFigure 5-2. Without Vision, the Project Perishes\nThe single most important thing you can do as a BKPM is to apply costs to  \nproposed visions to help customers see the consequences of their choices.\nAsk what other options have been considered. If none have, consider some.\nAsk what the ideal situation will look like if the problem is solved  \ncompletely.\nAsk if it would still be worth doing if it took twice as long or cost twice as  \nmuch.\nChanging Vision\nChange doesn’t kill projects. Unplanned and unmanaged change kills projects.\nIn the realm of changes, change orders, and modified projects, we distinguish  \nbetween ordinary technical changes and the sort of change that modifies the overall  \nvision, rather than just the technical dimension itself. \nThere are various reasons why a project vision can change or evolve. If  \nthere’s a research and development (R&D) component to what you are doing, you’re  \nnaturally going to discover some things you didn’t expect. This may require  \nadjusting the vision of your project. \nSometimes external circumstances force a change in vision. Economic  \nassumptions may change. The competitive environment may alter. Technological  \nbreakthroughs can happen.\nIn all these cases, what’s real is real, even when it’s not convenient. Although  \nthe project has now changed in important and material ways and the goalposts have  \nmoved considerably, this kind of evolutionary change isn’t the same thing as a failure  \nof the project. It may even be an improvement.\nBecause this kind of change cannot easily be controlled, you can find yourself  \nfar from where you started, with resources, budget, and deadline structured around  \nthe original (obsolete) objective.\nIf there’s reason to believe your project vision is likely to evolve (R&D,  \ncompetitive environment, fast-moving technology), structure the project with the  \nidea of change in mind. Build in flexibility of schedule and budget so that you can  \nrespond to inevitable change without driving the project off its rails. Drive an  \nunderstanding of the likelihood of change with the other sides of the three-sided table  \nso that they will be ready and prepared when change is required.\nUsing the three-sided table approach, the BKPM must work with project  \nsponsors/customers and technical team members to accommodate and adapt to  \nchange — even (or especially) in circumstances where one or both are likely to be  \nresistant. Project customers may be reluctant to accept the ways reality has changed.  \nImplementation teams resist throwing away work products, even if they’re no longer  \nrelevant to the modified goal.\nDirectional projects are ok, although they are often better as initiatives, not  \nprojects. But it is possible to structure an initiative with a discrete set of goals,  \nbudget, and timeline, using an iterative process.\nIn one large IT project, we structured the project in phases. The first phase  \nfocused on achieving an understanding of the issues, problems, and circumstances,  \nleading to clarity in the second phase, and further refinement in the third phase.  \nBecause the object of the project was progress in the right direction, both BKPM and  \nclient considered this a success even though the outcome never achieved the initial  \nvision.\nIn this project, frankly, the initial vision was ridiculous, and everyone but the  \noutcome owner could see this. However, the outcome owner wanted the project  \npursued, and they had the money and control.\nHow can you argue against this? The simple bottom line is that you can’t! To  \nput a project like this into the BKPM model, you must frame the project so that the  \nlack of vision/wrong vision combined with the desire to pursue an impossible  \nobjective turns from inevitable failure to an iterative search for success.\nUnknown Unknowns\nEveryone in project management knows the famous quote by former Secretary of  \nDefense Donald Rumsfeld. “[A]s we know, there are known knowns; there are things  \nwe know we know. We also know there are known unknowns; that is to say we know  \nthere are some things we do not know. But there are also unknown unknowns—the  \nones we don't know we don't know.”\nWhile Rumsfeld came under a lot of criticism for this point, it’s actually a  \nwell-known axiom in risk management. Some risks are “known knowns.” We  \nunderstand the risk, we know the probability, we can measure the impact, and there  \nis no excuse for not being prepared.\n“Known unknowns” are situations in which we are aware of specific gaps in  \nour knowledge and understanding. We don’t know what the competition is about to  \nrelease, or what new breakthrough in technology is going to happen, but we are  \naware that these kinds of surprises do happen. We can prepare for these kinds of risks  \neven in the absence of having all the data.\n“Unknown unknowns” are the risks we aren’t aware of on any level. If they  \nhappen, they’re likely to come as a complete surprise. How can we prepare for this  \nkind of situation? There are actually a number of potential strategies.\nFigure 5-3. Managing Unknown Unknowns\nBe aware that unknown unknowns are out there, and that they can disrupt  \nyour project. Stay alert to signs and signals that suggest that a surprise is in  \nthe offing.\nDon’t commit all your resources in advance. Keep a reserve handy.\nAdopt a three-dimensional approach. After all, anything that happens can only  \nhave three types of impact on your project: make you late, drive up your cost,  \nor drive down your performance. If you have strategies for recovery in all  \nthree dimensions, it matters a whole lot less what the surprise actually is.\nDig deeper. Some “unknown unknowns” are only unknown because we  \nhaven’t looked hard enough.\nInterestingly, Donald Rumsfeld missed one more possibility. In addition to known  \nknowns, known unknowns, and unknown unknowns, don’t fall for unknown knowns. \nThese are issues you really do know, but for some reason are blind to them. \nAssuming that the client knows what he or she wants, that team members  \ndon’t have any agendas of their own, or that everyone understands a situation the  \nsame way can get you into trouble. Too often, the truth is right in front of our eyes,  \nbut we don't see it.\nVarious cognitive biases can interfere with your ability to see what’s clearly  \nthere. Look out for such problems as the ambiguity aversion effect, in which people  \nprefer a decision that’s less ambiguous over a decision that’s clearly better;  \nconfirmation bias, in which we focus only on facts that support what we already  \nbelieve; or the famous Hawthorne Effect, in which almost any change triggers at  \nleast some temporary improvement just because people feel someone’s paying  \nattention. (You can download a free encyclopedia of cognitive biases from  \nhttp://efanzines.com/RandomJottings/RandomJottings06.pdf   .)\nReturn to Table of Contents\nCHAPTER 6: Becoming a Bare-Knuckled Project  \nManager\nThe Evolution of a Bare-Knuckled Project Manager\nNo one starts out as a BKPM. A BKPM has skills and abilities born of experience,  \nand you have to earn — and learn from — the experience.\nIn fact, very few people start out in life looking to become project managers  \nin the first place. In many ways, it’s an accidental profession — good project  \nmanagers are drafted into the field.\nThat’s true even in the current world, where some colleges and universities  \noffer degrees in project management, and the industry organizations are talking about  \nproject management career paths. Most of us learn to manage projects based on the  \ntechnical or business field where we start out. IT professionals learn to manage IT  \nprojects. Construction workers become construction project managers. Financial  \nprofessionals learn to manage financial projects.\nYou’ll hear that any competent project manager can manage any sort of  \nproject — whether or not he or she has subject matter experience. There’s some truth  \nin that, but not a whole lot.\nFigure 6-1. The BKPM Zone. The growth pattern of project managers starts with  \nnovice PMs and grows to master PMs — but true Bare-Knuckled Project Managers  \nare few. They are the best of the best.\nYou can certainly manage a project without being an expert in the topic, but there’s  \nusually a minimum you have to know in order to be effective. Of course, some parts  \nof project management are generic enough that experience in one field helps you  \nmanage projects in another, but that’s never quite as good. \nAs you reach executive levels in project management — the levels where  \nBKPMs come into play — the problem changes. Projects at this level often cut  \nacross many functional lines and involve specialists with diverse backgrounds. As a  \nBKPM, you may know some of the fields, but you’re unlikely to know them all. Or  \nyou take on a project not because you’re the recognized expert, but rather because  \nyou’re the only leader available for the job.\nHow, then, do you become a BKPM? What are the steps and stages in the  \nBKPM’s career progression? Normally, there are a series of stages in a project  \nmanager’s career:\n←“Working” Project Manager  (part-time project manager, full-time  \ntechnical specialist)\n←\n←Junior Project Manager  (managing one or more simultaneous projects,  \nusually small in size)\n←\n←Journeyman Project Manager  (trained and usually certified in project  \nmanagement, knows the fundamentals and has reasonable experience)\n←\n←Master Project Manager  (skilled and experienced, knows the field, may  \nor may not be a great leader)\n←\n←Bare-Knuckled Project Manager  (a trained, capable, and effective  \nleader who gets the job done)\n“Working” Project Manager\nAt the beginning of your rise in the project management hierarchy, you’re often what  \nwe call a “working” project manager. That means you simultaneously serve as a  \ntechnical resource on the project as well as the project manager. This sets up a  \nconflict.\nNotice that the PMI approach presumes that if you’re the project manager,  \nthat’s your whole job. It’s not an unreasonable position to take. Project management  \nnormally takes more time and involvement than anyone suspects when the project  \nbegins. In the real world, however, it’s usually the case that new project managers  \ndon’t have that luxury. As a result, certain problems are all too common.\nSelf-bottlenecking. Too often, the inexperienced PM decides that he or she is  \nthe most competent technical team member (which may well be true; that’s probably  \nwhy he or she got appointed to the job in the first place) and should therefore take on  \nthe toughest technical challenges. This almost always backfires, because you become  \nyour own technical bottleneck, consumed with your own work and thus unable to  \nhelp the rest of your team.\nLack of independent perspective. In the three-sided table model, the project  \nmanager must be separate from the implementation team. When the PM is also a  \nmember of the working group, the three-sided table is corrupted right from the start.\nLack of training and experience.  Newly minted project managers of this  \nstripe seldom get much (if anything) in the way of training or coaching, and may not  \nknow the simplest of project management tools. This creates a lack of confidence,  \ncompounded by a lack of fundamental skills. Some organizations provide a Project  \nManagement Office (PMO) to support these project managers, while others expect  \nthem to somehow learn on the job.\nJunior Project Manager\nMinted, but not yet honed, junior project managers usually have just enough project  \nmanagement knowledge to be dangerous. While technical skills may be extremely  \nhigh, practical experience in the ins-and-outs of projects is often lacking. Junior  \nproject managers may have been to an introductory project management class or two,  \nbut seldom have any meaningful hands-on experience with the process.\nWhether a junior project manager will mature into a fully capable BKPM has  \nmore to do with attitude and personality than with mastery of the technical minutiae  \nof project management. This isn’t to say, of course, that there isn’t value in learning  \nthe technical fundamentals, but rather that they aren’t enough. An outstanding project  \nmanager can always find someone to keep the project books.\nCommon problems with junior project managers revolve around ownership  \nand overload.\nGrabbing for control.  The desire for control often manifests itself most  \nstrongly when people feel a general lack of control, and that’s a common  \ncharacteristic of a junior project manager. Feeling threatened and disrespected, a  \njunior PM may be too aggressive, taking ownership for things they do not — and  \nshould not — own. \nToo many projects. At the junior PM level, projects are relatively small, and  \nit’s often not economically feasible to have one PM for one project. Multiple project  \nmanagement becomes inevitable. Multiple projects are, however, more complex than  \na single project of the same total scope and budget. Different customers, different  \npriorities, and resource conflicts eat away at any attempt to control.\nSeizing up. When the level and complexity of work gets too large for  \nsomeone to handle, the natural reaction is to seize up under the collapsing pressure of  \nowning too much. This leads to forgotten and abandoned projects, with neglect  \ndriving some projects out of existence.\nJourneyman Project Manager\nIn recent years, there’s been a move to professionalize project management. We’ve  \ntalked about PMI’s PMP® designation, based on understanding the PMBOK®  \napproach to project management. Universities offer undergraduate and graduate  \ndegrees in project management. Numerous training organizations offer certificates of  \ntheir own.\nThese types of credentials show that the person has at least a minimum level  \nof competence and a reasonable amount of actual experience in project management.  \nThat’s important, but it’s not enough. What none of the credentials do, however, is  \ndemonstrate whether or not the person has the temperament, drive, and style to be  \neffective in the rough-and-tumble world of projects. That’s the difference between a  \nwell-qualified project manager and a BKPM.\nMany project managers are comfortable staying at this level, managing  \nrelatively repetitive projects in an increasingly familiar field. They have a reasonable  \nbatting average, but they’re definitely playing in the minor leagues with no particular  \ndesire to move forward.\nOften, project management offices (PMO) are set up to provide technical  \noversight and support of individual projects, lessening the need for large numbers of  \ntrained and qualified project managers. Journeyman PMs are often drafted for this  \nrole. They have the technical expertise in project management, but may not have the  \nleadership ability to run large projects themselves.\nA well-run PMO can be of significant benefit to an organization, but there are  \ncommon problems resulting from the preponderance of journeyman project  \nmanagers.\nOverconfidence. The PMP® credential all by itself tells you very little about  \nwhether a project manager is competent or not. It merely tells you that the PM in  \nquestion has a command of certain basic tools and procedures. Nevertheless, a PM in  \npossession of a new credential may take on a level of arrogance completely  \ninappropriate to the actual accomplishment, and start acting as if the PMO is the  \nowner, subject matter expert, and Supreme High Factotum for every active project.\nProcess over Product.  The formal project management process is elaborate  \nand comprehensive, but as we’ve learned, it can easily be overkill based on the  \nnature of a given project. Credentialed PMs may emphasize the formal process  \nregardless whether it’s the right tool for the situation.\nMaster Project Manager\nThere are project managers with substantial experience and ability who don’t quite  \nmeasure up to the BKPM standard. While highly competent in many respects, these  \n“master project managers” have a command of their subject area but sometimes lack  \nboth the executive leadership ability and the broader perspective necessary for peak  \nperformance.\nMaster PMs normally have a good technical background, not merely in the  \nsubject matter of the project, but also in the discipline of project management. This  \ncan include the PMP® or similar credentials, but training in such topics as Six  \nSigma, Agile methodology, or almost any substantial technical management  \ndiscipline can work. Many master PMs have credentials in more than one of these  \nareas. However, the presence of credentials doesn’t make someone a master PM, and  \nthe absence of credentials doesn’t prove someone isn’t.\nFor large but routine projects, master project managers know how to keep the  \nsystem moving forward. They are well organized, detail oriented, prudent, and  \ngenerally effective. For that reason, master PMs often get assigned responsibility for  \nmanaging the PMO. This is often a good use of talent, because the master PM is an  \noperations officer, not an executive one.\nIt is when things deviate from the standard that trouble is in the offing. At the  \nbeginning of this book, we cited the CHAOS Report findings that the majority of  \nlarge projects fail. These projects generally are not managed by junior staff, but  \nrather by project managers with significant experience — and yet they still fail.  \nCommon problems with master project managers include the following.\nDifficulty confronting the customer.  The traditional saying “The customer is  \nalways right” doesn’t always work where projects are concerned. As we discussed in  \nthe three-sided table, the project manager must be willing to push the client or  \ncustomer just as hard as the implementation team. Master project managers are  \ncomfortable pushing the implementation team, but when it comes to the customer,  \nthey are less willing to confront defective vision and to tell the customer up front  \nwhen the proposed project is likely to fail.\nThinking Inside the Box.  Because the customer sets the master PM’s  \ndirection and isn’t subject to much challenge, the range of discretion and initiative  \navailable to the master PM is often limited. Answers are pursued within a relatively  \nnarrow span.\nOwned by the System.  When the organization uses a PMO to support its  \nproject managers, the PMO usually becomes part of the bureaucracy rather than a  \ncenter for innovation and success. The PMO oversees the full range of projects,  \nfailures as well as successes, but usually doesn’t have final P&L responsibility.  \nFailure in this environment is usually well documented, but that doesn’t  \nautomatically translate into improvement.\nBare-Knuckled Project Manager\nThere may not be much of a difference in the education and credentials of a BKPM  \ncompared to a master PM, but there’s a world of practical difference. While BKPMs  \ntypically rise through the ranks, what distinguishes a BKPM is leadership. All the \ntextbooks and credentials in the world aren’t enough.\nAs most of us know, no matter how technically challenging the project, it’s  \nalmost always the people and political issues that take up the project manager’s time  \nand keep him or her up at night. No classroom or certificate can teach you how to  \nhandle that part of the job. It not only takes a high level of skill to navigate the  \npolitical seas, it also takes gravitas — the respect you get from experience,  \ntemperament, and confidence. It takes a certain number of years and more than a few  \nscars to achieve this level.\nUsing the three-sided table approach, the BKPM is a partner of the  \ncustomer/client, not a subordinate. By managing the interaction between customer  \nand implementation team, the BKPM is in a position to ensure a project’s success in  \na way that other project managers can only dream about. Some of the specific  \nqualifications and qualities of the BKPM that lead to success include the following.\nHonest Broker. The BKPM does not and cannot drink the corporate Kool-\nAid. This can be uncomfortable for some executives who aren’t used to being  \nchallenged, but this attitude is for everyone’s good. The BKPM is an arm’s-length  \nstrategist — he or she does not take a side. This independence allows the BKPM to  \nserve as a referee when necessary, and to serve as an objective analysis.\nExecutive/Fighter.  By their very nature, executives own the problems and  \nissues in their portfolio. Working with substantial independence and initiative, they  \nchart and lead the path to success. Of course, if a problem is easy, it’s usually already  \nbeen solved. A BKPM, as we’ve learned, is also a fighter, able to face and overcome  \nthe myriad obstacles that stand between success and ourselves.\nUnleashing Your Inner BKPM\nThe standard for becoming a BKPM is very high. You need experience, command of  \nthe process, credibility, courage, and honesty. All of these things take time, and even  \nthen, not everyone internalizes these qualities. \nTo add to the challenge, BKPMs must also approach the job with an  \nappropriate level of humility. We are, after all, pressed into the service of others.  \nKeeping ego out of the process, focusing on results, and not seeking power for its  \nown sake all help separate the BKPM from the normal range of executives.\nNot seeking power for its own sake isn’t the same thing as not seeking — and  \nexercising — power as appropriate. However, the real power of a BKPM is the  \npower that comes from respect, as measured by results.\nYou need to approach the project with an open mind. The plan is simply a  \nbaseline. It has little to do with reality. That’s why the project manager needs to think  \nlike a martial artist, seeing the subtle movements in the project environment and  \nchoosing the right response.\nYou need commitment. You must take ownership of the process. You have the  \nresponsibility of making the goals and objective clear, even when parties resist being  \npinned down. You must oversee and validate the technical solution, and make an  \nindependent judgment about the likelihood of meeting the triple constraints.\nImagine the benefits to the organization when that kind of person manages  \nyour toughest projects. Risk goes down, accountability and control go up. The  \norganization actually improves as a result. You have an honest broker to keep open  \ncommunication between the customer and the team. You get sound advice and  \nalternative options. And all that helps you get a good night’s sleep.\nThe BKPM should be a highly compensated individual — just like Pulp \nFiction’s Winston Wolf. \n(He drives an NSX.)\nPersonality Styles of the BKPM\nWe’ve talked about Bruce Lee, General George S. Patton, and a few other famous  \nfigures that embody the traits of a BKPM. But what if you’re not like that? Are  \nBKPMs limited to a very few personality types, or can different people aspire to  \nreach the level of a true bare-knuckled project manager?\nWe believe that there’s more than one way to reach the highest pinnacles of  \nsuccess. General Patton — loud, brash, hard charging, and effective — was a BKPM,  \nbut so was his boss, General Eisenhower. Although Eisenhower was much less  \nflashy, he was no less driven and goal-oriented. Both men got the job done in spite of  \ntremendous obstacles. What distinguishes a BKPM isn’t a particular personality  \nstyle, but a way of doing business.\nThere are many tools used to classify personality and temperament types,  \nfrom DiSC to the Myers-Briggs Type Indicator (MBTI), but those are a bit too  \ncomplex for everyday practical use. Instead, let’s use a simpler, more classic  \napproach, with four easily identifiable types that represent the vast majority of  \npeople. Figure 6-2 shows how this works.\nFigure 6-2. Personality Types and the BKPM. Check the words that describe you.  \nMany people have elements of all four groups, but most of us have a dominant work  \nstyle. What’s yours?\nWe’re sure you recognize all four of these types from your everyday life. If you have  \ntrouble spotting them (or trouble classifying yourself), here’s a simple method.  \nNotice that the two axes of the grid are Task ➜ People and Direct ➜ Indirect. \nFigure 6-2 summarizes the characteristics of each. You can determine your  \npersonality style according to this model — or make a good guess about somebody  \nelse — by observing certain key behavior. The “Rating Temperament” exercise helps  \nyou make this determination quickly and easily.\nRating Temperament\nTo determine your temperament type (or the type of someone else), rate your opinion  \nof how the person in question reflects the described characteristic.\nDirectness\nDirect people tend to be fast-paced, say what they mean, and be more  \nnaturally assertive. They make quick decisions. They are often more likely to  \ninterrupt or “talk on top of” other speakers.\nLow High\n12345\nIndirectness\nIndirect people tend to have a slower conversational pace, listen first and talk  \nsecond, and provide background first before getting to the point. They usually  \nwait until there’s a real gap in the conversation before speaking up.\nLow High\n12345\nTask Orientation\nTask-oriented people show their emotions less, focus on tasks and goals, and  \nspend less focus on relationships and people.\nLow High\n12345\nPeople Orientation\nPeople-oriented people tend to express emotional reactions and feeling easily  \nand openly, and believe relationships and people are important in the work  \nenvironment.\nLow High\n12345\nScoring and Application\nDirect and Task-Oriented =Focuser\nIndirect and Task-Oriented =Operator\nDirect and People-Oriented =Integrator\nIndirect and People-Oriented =Relater\nNo one style is the “right” style. Everyone has natural strengths and weaknesses.  \nWhen it comes to work:\nFocusers get the job done no matter what obstacles stand in their way — but  \nsometimes leave a swath of damage in their wake. \nIntegrators are natural brainstormers and problem solvers with a never-\nending supply of ideas — but don’t always follow through. \nOperators are great planners and naturally detail oriented — but can get  \nbogged down in the small stuff. \nRelaters are great team builders and excellent motivators — but can get so  \nwrapped up in the people that they lose track of the goal.\nIn other words, everybody has advantages…and everybody has disadvantages.  \nBKPMs can come from any of the four types, but through hard work, maturity, focus,  \nand self-awareness they have managed to limit their weak spots and extend their  \nabilities past their own style to be versatile no matter the situation. \nSome people are hybrids, carrying the strengths and weaknesses of more than  \none category. Some even exhibit one style at the office and a completely different  \none at home.\nClearly, all four sets of skills and aptitudes are valuable for an organization.  \nGreat BKPMs are versatile. Even though we all start with a preference, that doesn’t  \nmean we can’t learn to do effectively what may not always be natural.\nYou can use temperament for self-examination: determine your strengths and  \nweaknesses and gain insight into how you can improve. In mentoring others, you can  \nidentify where another person may need support.\nTo lead others more effectively, pay attention to their style. People tend to  \nthink their own style is natural, so if you move your behavior in their direction,  \nyou’re more likely to get results. If you are dealing with a direct person, be more  \ndirect; with an indirect person, slow down. With task-oriented people, focus on the  \ntask; with people-oriented types, focus on relationships.\nGreat leaders always grow themselves and the people around them. The  \nBKPM leaves people and organizations stronger than they were before.\nLimbic Learning\nRegular learning, however, can only take you so far. In our discussion of Jeet Kune \nDo, we remember that Bruce Lee said that combat was spontaneous. You can’t  \npredict it, but only react to it. That doesn’t mean, however, that it isn’t predictable or  \ncontrollable.\nThe type of learning that allows you to react effortlessly and spontaneously  \ndoesn’t come from books, seminars, or even from (normal) experience. It comes  \nfrom limbic learning.\nGood steel has to be forged. It’s hammered, beaten, and melted into shape.  \nIt’s stressed and edged and honed. All the qualities that make a good sword make a  \ngood BKPM. The way that’s done is through the limbic system, the place where  \nemotions live.\nThe limbic system is a small structure located in the middle of the brain, in  \nbetween the brain stem and the cortex. The brain stem is the center of alertness and  \narousal, while the cortex is the home for most of our higher-level thinking and  \nlearning. Mediating between the two is the limbic system, home to human emotion. \nThis limbic system serves as a link and as a reinforcer. Purely intellectual  \nlearning doesn’t change behavior enough all by itself. The limbic system must be  \ninvolved for true change to take place.\nHow Limbic Learning Works\nFormer Special Forces interrogator Gregory Hartley describes the process of limbic  \nlearning this way: \n“Any condition that creates unease, restlessness, instability, and/or  \nunpredictability…[causes you to] experience a temporary loss of control that may  \noverwhelm you. You lose your ability to function at your peak state because you  \nmove out of organized thought and into an emotional state, or limbic mode.”  \n(Hartley and Karinch, 26)\nThat’s why top athletes and martial artists practice their sport or fighting skills under  \nstress. As Hartley says, “When the time comes, their bodies automatically know what  \nto do.”\nThat’s limbic learning in a nutshell, and it’s the powerful and overwhelming  \nquality that distinguishes the BKPM from other project managers. Projects, after all,  \noperate in an environment of continual stress: unease, instability and unpredictability  \nare the norm, not the exception.\nNo matter how technically competent you may be, if your learning lives only  \nin your cortex and not in your limbic system, it won’t be available to you under  \nconditions of stress — exactly the time where you are most likely to need it.\nThe true learning of a BKPM comes not from the classroom, but from field  \nexperience. The ability to operate under these conditions can only be gained by  \nexperiencing these conditions, over and over again. \nRegardless of temperament or personality type, what all BKPMs have in  \ncommon is that they have learned to operate with the deep learning that is only  \npossible when the limbic system is engaged.\nIf you’ve managed projects long enough, you’ve experienced the kinds of  \nstress and uncertainty that trigger limbic mode, but not everyone is able to smooth  \nthe transition and make the learning permanent. If the stress becomes too much, your  \nbrain loses the ability to function logically. \nWhen you’re trying to develop the high performance leaders you need for  \nyour toughest projects, there’s no substitute for stress. At the same time, you need to  \nprovide the support structure that keeps people from being overwhelmed. When you  \nachieve that balance, deep learning takes place.\nEvery effective BKPM goes through this seasoning process not once, but  \nmany times over. Whether it’s a conscious training approach taken by enlightened  \nmanagement, or simply the result of having been thrown into the deep end of the  \npool a few times, the learning becomes a reflex action, not something conscious or  \ndeliberate.\nAt the same time, the process does overwhelm people, and the results aren’t  \npretty. While sometimes this failure results from the personality and temperament of  \na specific individual, a lot of times the failure results from a lack of overall support  \ngiven by the organization. \nIt’s vital that you watch for the signs of too much stress, and provide support  \nwhen needed.\nManaging Limbic Learning for Positive Results\nHow do you take charge of your limbic learning? The first step is to seek out  \nchallenging situations. Many people shy away from the sort of stress and challenge  \nthat would provide limbic learning opportunity, but the BKPM-in-the-making learns  \nto welcome the challenge and the stress.\nThe situation alone doesn’t make a BKPM, of course. The second step is to  \nmanage the overall stress and risk so that it pushes you to the edge, but not over it.  \nThat’s a delicate balance, so the way to manage it is to put more weight on your side  \nof the teeter-totter. \nPeople who are cut off from human contact and relationships, or people who  \noperate solo, often don’t have the support structure that helps keep stress within  \nlimits. A BKPM needs a team. A BKPM-in-the-making needs a mentor — in fact,  \nmultiple mentors are better.\nTo achieve limbic learning, you must create a situation that imprints the right  \nlessons on the mind of the learner. The Trane Company for many years operated  \n“Project Management War Games,” an intense around-the-clock four-day simulation  \nof a project. Students were given a packet of information, developed a plan, sold the  \nplan to “clients,” managed “subcontractors,” and dealt with an increasing set of  \nproblems and disasters as the imaginary project moved toward completion. \nStudents regularly reported that the training was one of the most powerful  \nexperiences of their lives, and many had the experience of finding themselves in  \nstressful real-life situations that corresponded to the lessons they had already learned.  \nThe high stress of the training class was paired with the low risk that the project was  \nimaginary, and no real failure was possible.\nThat’s the key to building BKPMs in your organization: the combination of  \nhigh stress and low risk. The high stress is easy enough, but the low risk requires  \nsome planning.\nInterrogator Greg Hartley points out that US pilots and special forces  \npersonnel go through an imaginary POW experience known as SERE: Survival,  \nEvasion, Resistance, and Escape. The military candidates go through an immensely  \nhigh stakes process, with elements modeled on CIA psychological warfare practices.  \nStress is very high — as high as they can make it. \nUnlike the real thing, however, students in the SERE program know it’s a  \ntraining class, know it will eventually end, and know that if it truly becomes too  \nmuch, they can stop it. That makes the risk relatively low. \nThe combination of high stress and low risk enables people to internalize the  \nlessons and be better prepared in the event of actual capture, and makes it easier for  \npeople to succeed and to internalize that feeling of success. Organized limbic  \nlearning can be a powerful tool.\nOf course, real-life situations (high stress and high risk) create limbic learning  \nas well. Unfortunately, real life can imprint the wrong lessons, or do enough damage  \nto the trainee to eliminate the long-term value of the lesson. Be deliberate in your  \ntraining approach and you’ll get better — not to mention safer — results.\nReturn to Table of Contents\nCHAPTER 7: Conflict and Communications\nManaging Conflict\nWhat do you think of when you think of conflict?\nCommon responses include anger, strong emotion, resentment, defensiveness,  \nand argument — all of which can easily occur.\nIn its simplest form, however, “conflict” simply means disagreement.  \nDisagreement is an everyday occurrence, and most disagreements get resolved easily  \nand quickly. While strong negative emotion and bad reactions remain a danger, the  \nBKPM must be fearless and direct to handle conflict before it gets out of hand.\nBruce Lee, as you’ll recall, defined his Jeet Kune Do method as “the art of  \nfighting without fighting.” When it comes to conflict management and the BKPM,  \nthat’s exactly the right approach to take. While it may not be feasible (or even  \ndesirable) to avoid every fight, most conflict situations can be resolved at a far more  \nequitable and reasonable level.\nIn this chapter, we’ll show you a model for understanding conflict, plotting  \nyour response to any conflict situation, and achieving the results you want from both  \na short-term and a long-term perspective.\nFigure 7-1. The BKPM Conflict Resolution Model. Different situations call for  \ndifferent modes of conflict resolution.\nMethods of Conflict Management\nNot every conflict situation should be approached in the same way. Sometimes the  \nstakes are immediate and overwhelming; other times they are trivial and  \ninsignificant. Sometimes it’s vital that your point of view carry the day — other  \ntimes it’s better if someone else wins. \nThat’s why the first stage in conflict management is to select the right  \napproach for the situation.\nWhat is the right approach, and how do you determine what it is in a given  \nsituation? To answer that, we must first answer two questions:\nHow important is it to me to achieve my objectives in this conflict?\nHow important is it to me that you achieve your objectives in this conflict?\nThe first question is obvious. Do you have a dog in this fight? How important is it to  \nyou that you win or achieve your goal? \nIf your experience tells you that a certain technical choice on the project is  \ngoing to cause trouble, it’s important that you keep that choice from being made. If  \nyou’re the leader and your leadership is being challenged, it may be important to  \nmake clear who’s in charge. If the customer isn’t going on the record about the  \nproject objective, you must make them do so.\nThe second question, however, is less obvious. This issue isn’t whether the  \nother person wants to achieve his or her objective, but whether you want them to.\nThere are a number of reasons why it might be important to you that the other  \nperson achieves his or her objective. First, that person might be the customer, and if  \nthe customer ain’t happy, ain’t nobody happy. Second, the other person may care  \nmore about the outcome than you do. If we’re choosing where to go to lunch, you  \nmight not have a strong opinion, but if the other person has food restrictions, it’s  \nimportant that the restaurant serve appropriate food. Third, the long-term relationship  \nmay be more important than the short-term issue at stake. Winning today may set up  \na resentment that causes you to lose tomorrow.\nTo choose the correct conflict response, you need to know where you stand on  \nboth these issues. Figure 7-2 shows you how to make the right choice.\nFigure 7-2. Choosing the Right Response. The best strategy for conflict  \nmanagement depends on your goals.\nAvoidance\nImagine your extended family has gotten together for Thanksgiving. Sitting around  \nthe table, some cousin you haven’t seen in years decides to bring up, say, the issue of  \nabortion. No matter what position you hold on the issue, it’s pretty clear that this  \nconversation is headed for a bad end. \nIf your opinion and your imaginary cousin’s opinion are diametrically  \nopposed, it’s very unlikely that a dinner-table argument is going to change anybody’s  \nmind. The most likely outcome is a ruined dinner for everybody.\nWhat’s the best strategy? Change the subject. Ignore the bait. Ask the  \nimaginary cousin to bring up the topic at a more appropriate time. In other words, the  \nconflict strategy most appropriate here is avoidance. You don’t have to fight every  \nbattle, and you certainly don’t have to fight on somebody else’s timetable.\nIn a work environment, the same logic applies. Perhaps someone’s raised a  \ncontentious side issue, but it’s not important for the project at hand. Don’t waste  \neverybody’s time — especially yours — on a conflict that really doesn’t need to  \nhappen.\nYou may also use avoidance as a temporary tactic. If someone’s lost his or her  \ntemper, the first order of business may be to get that person calmed down. Trying to  \nwork through substantive issues, no matter how important, when someone is  \nconsumed with emotion is usually doomed to failure. Deal with the emotional issue  \nfirst, then adopt a new strategy to work through the problem.\nIf someone uses avoidance to run away from an issue that should be  \nconfronted, that’s a different strategy. That’s cowardice, and it’s a bad idea. Avoiding  \nunnecessary conflict is smart; avoiding important conflict will sooner or later do  \nharm to the project — and to you.\nWithdrawal\nEarlier, we mentioned a conflict about where to have lunch. That’s (usually) trivial,  \nbut it still qualifies as conflict: it’s a disagreement. If you really don’t have a strong  \nopinion in the matter, you may choose to resolve the conflict by yielding to the other  \nperson’s wishes in the matter. That’s called withdrawal.\nWhen problem-solver and BKPM Winston Wolf starts giving orders to the  \ntwo hit men in Pulp Fiction, one of them (John Travolta’s character, Vincent) balks.  \n“A ‘please’ would be nice,” he says.\nWolf’s immediate response is annoyance, but he decides to explain himself  \ninstead. “If I’m curt with you, it’s because time is a factor. I think fast, I talk fast, and  \nI need you guys to act fast…. So pretty please, with sugar on top, clean the [expletive  \ndeleted] car.”\nWolf’s agenda is to get this situation resolved quickly and well. A conflict  \nwith Vincent over something as simple as “please” won’t address anybody’s real  \nneed. The “please” matters to Vincent, and saying “please” (or “pretty please with  \nsugar on top”) costs Wolf little or nothing.\nStanding on principle on every little issue adds dramatically to the supply of  \nstress and unhappiness in your life, and accomplishes very little. Giving in on the  \nsmall stuff lets you reserve your attention for the issues that matter.\nThere’s a secondary benefit to withdrawal as a conflict management  \ntechnique. Psychologist Robert Cialdini describes the “Rule of Reciprocity,” the  \ninternal pressure that pushes us to repay in kind whatever another person has  \nprovided us. (Cialdini, 17). \nThat’s not simply a commitment to the Golden Rule. Cialdini argues that the  \nrule is so deeply ingrained in human nature that it tends to work no matter what the  \ncircumstances. If you give in on an issue, even if it’s a small one — even if the other  \nperson doesn’t actually care about it very much — you dramatically increase the  \nlikelihood that the other person will tend to reciprocate, and give in on another issue  \n— potentially one that matters to you much more.\nWhen you yield to the other person’s wishes not out of choice but rather  \nbecause you think you’re going to lose the conflict, withdrawal turns into surrender. \nSometimes you’re certain to be defeated, so surrender may make sense as a strategy  \nin certain cases. As long as there’s hope of victory, however, it may make greater  \nsense to fight on. Other tactics — compromise and negotiation — may help you eke  \nout at least a partial victory.\nCompromise\nAs that great negotiator Mick Jagger sang, “You can’t always get what you want/But  \nif you try real hard, you might just get what you need.” If your needs and the needs  \nof the other party are less than total, a compromise may resolve the issue  \nsatisfactorily.\nIn a compromise, you settle for less than your ultimate goal, and so does the  \nother person. If you propose a price of $1 million and the other side counters with  \n$500,000, you might agree on $750,000. Whether that’s a good deal or not depends  \non your costs. If it’s going to cost you $800,000 to fulfill the contract, then meeting  \nthe other side half way isn’t an acceptable option. You’re still going to lose money.\nThe important consideration in a compromise is whether both parties feel that  \nthey have gotten an acceptable outcome. If we’re arguing with our spouse about  \nwhether to vacation on the beach or in the mountains, and we decide to compromise  \nand vacation in the city, we may have swapped one unhappy person for two unhappy  \npeople. That’s not an improvement. \nCompromise is also not simply about splitting the difference. A traditional  \nbargaining technique is to make your initial offer far below what you’re willing to  \npay (or far above what you’re willing to accept), because splitting the difference will  \nactually move the final price dramatically in your direction. Watch out for bargainers  \nwho try to tilt the field prematurely.\nForcing\n“It’s my way or the highway.” There are times and situations where you don’t really  \ncare (or can’t afford to care) what other people think or want — it’s necessary that  \nyou impose your will on the situation and move forward. That’s forcing, and \nsometimes you have to do it.\nThe disadvantages with forcing are obvious. First, you’re likely to encounter  \nresistance. Second, you can’t easily force someone who has more power than you do.  \nThird, even when you win, you may create long-term hostility that can complicate a  \nlater situation.\nWhile good leadership and good judgment will help you identify times and  \nplaces where forcing is the right strategic choice, there are several situations that call  \nimmediately for forcing:\n←When you have no time.  Often, you can achieve the same results with  \nnegotiation that you can with forcing, but negotiation takes time. When a  \ndecision or action must take place immediately, debate may not be an option.\n←\n←When other strategies fail . You may be perfectly willing to negotiate or  \neven compromise, but if the other party is unwilling or unable to move,  \nforcing is often the only option available to you.\n←\n←When a choice has to be made. It may be that more than one choice is  \nlegitimate and defensible, but a choice still has to be made. In such situations,  \nit’s often the job of the leader to make the call and to force a common  \ndirection on the entire team or project.\n←\nWhen leaders rely on forcing as a favorite style, ignoring opportunities for  \nempowerment, team involvement, and participation, forcing all too easily turns into  \nbullying.\nConfrontation/Negotiation\nHarvard Negotiation Project researchers Roger Fisher and William Ury tell the story  \nof the two sisters fighting over the last orange. They agree to compromise, cutting  \nthe orange in half. The first sister takes her half, eats the fruit, and throws away the  \npeel. The other sister throws away the fruit, and takes the peel into the kitchen to use  \nin the cake she is baking. (Fisher and Ury, 59)\nNegotiation differs from compromise because it seeks a “win/win” outcome  \nrather than splitting the difference. It’s possible because the issues in a conflict aren’t  \nalways reciprocal ( e.g., my victory requires your loss), but can often be resolved in a  \nway that allows both parties to get all (or at least most) of what they want and need.\nNegotiators have to confront the conflict directly, look for the root cause,  \nidentify the underlying goals and objectives of each party, build mutual trust, and  \nfind a solution to achieve the “win/win” objective. Skill in negotiation is one of the  \nmost important things a BKPM can bring to the table, especially when navigating the  \ncomplex relationships of the three-sided table. \nGiven a choice between studying project management techniques and  \nstudying negotiation, we think a BKPM is better off in the long run by sharpening  \nand improving negotiation skills.\nSome authorities, including PMI®, use the term confrontation instead of \nnegotiation when describing the different approaches to conflict resolution. PMI®  \ntraining materials, in fact, often claim that confrontation is the most important and  \neffective method of dealing with conflict, but that assumes a “one size fits all” view  \nof conflict that we think is simplistic and wrong-headed. \nThere is no one single correct approach to conflict, as we’ve seen. Effective  \nBKPMs switch easily back and forth among the different styles of conflict resolution  \nbased on what’s most appropriate for the situation at hand.\nThere are potential problems and limitations in negotiation. First, negotiation  \nusually takes time and effort, and not all issues are worth the necessary investment. \nSecond, not every issue contains a win/win opportunity. However, many more  \nissues do have a win/win option than you’d think — but you often have to look for it.  \nThird, and perhaps most importantly, effective negotiation requires that the  \nparties have some degree of mutual trust. When you look at trouble spots around the  \nglobe, what stands in the way of a solution isn’t so much finding a win/win, but  \nrather establishing enough trust to make a deal possible in the first place. \nWhen negotiation fails, for whatever reason, the result is stalemate. The \nBKPM must then take a different approach to resolve the conflict.\nPlanning for Conflict\nWe’ve emphasized that an effective BKPM is an “honest broker” in the relationship  \nbetween the customer and the implementation team. Both sides necessarily depend  \non the BKPM’s objectivity, honesty, and clarity whenever difficult issues and  \nconflicts arise.\nOne important part of any conflict management strategy is how people view  \nyou, and that’s something that can only be developed over the long haul. Such  \nqualities as being genuine and generous, having a customer perspective, and  \npracticing transparency provide numerous benefits. \nYour empathy — your ability to recognize and acknowledge the emotions and  \nissues of the other person, whether or not you agree with them — brings people  \ncloser. In conflict resolution, they’re all important assets. Cultivate them over the  \nlong haul, and you’ll find almost every conflict situation works out better.\nThe Role of Trust\nTo depend on a BKPM’s objectivity, honesty, and clarity requires trust. By the time a \nconflict occurs, it’s too late to start building trust. Conflict — especially mismanaged  \nconflict — tends to erode trust, and once gone, it’s hard to replace. That trust  \nrelationship is especially critical when the ship is out at sea, half way through the  \njourney, and being battered by storms, mutinies, and scurvy.\nThere are at least three important types of trust in the BKPM/Owner/Team  \nrelationship. The first is the trust that comes from integrity and honesty: character-\nbased trust. If someone tells the truth 90 percent of the time and lies 10 percent of  \nthe time, we call that person a liar. Even a small lapse in character can loom large in  \nsomeone’s decision whether to trust you. A BKPM must always keep his or her word,  \nso only make promises you intend to keep.\nA second type of trust is  competency-based trust . You can have a lot of  \nintegrity and still be completely incompetent — but that doesn’t create meaningful  \ntrust. At the beginning of the project, when people don’t yet know you, the evidence  \nof your competency is your existing track record. As you get into the project, your  \ntrack record becomes irrelevant: your competency is assessed based on today’s  \nproject results.\nA third type of trust is prediction-based trust . The BKPM essentially promises  \nto achieve an agreed-upon outcome, which involves making certain predictions as to  \nhow a given strategy or approach will work. BKPMs make predictions about  \npotential risks and the effect of risk mitigation strategies. BKPMs interpret the tea  \nleaves of the external environment, to prepare for the inevitable environmental  \nchanges that can sweep away previously established project assumptions.\nPhysicist Niels Bohr famously said, “Prediction is very difficult, especially  \nabout the future.” (This is also often attributed to Yogi Berra.) However, BKPMs are  \nfrequently held accountable for making predictions no matter how uncertain the  \nenvironment. And more importantly, sometimes the honesty required can be brutal.  \nThe BKPM can’t shy away from the necessity, but you can provide empathy in the  \nprocess.\nThe way we can do this is to go back to one of the core principles of project  \nmanagement: Preparation is cheaper than problem solving. \nConflict is not only inevitable in projects; it’s usually predictable as well.  \nRisk and uncertainty is baked in. The BKPM can usually anticipate most areas of  \npotential project stress and, better yet, prepare for them. \nThat’s one of the most important reasons for effective risk management, as we  \ndiscussed in Chapter Four.\nSituation ➜ Behavior ➜ Outcome\nPeople are usually predisposed to particular conflict management styles. Some  \npeople avoid conflict reflexively. Others are ready to go to DEFCON One at the  \nslightest hint of trouble. Modifying these natural tendencies is an awareness of the  \ndynamics of a particular situation. If your spouse criticizes your driving, you’re  \nprobably going to react differently than if a police officer does.\nThe difficulty is that these decisions are often made on a very short timeline,  \nresulting in failure to understand the dynamics and ramifications of the situation.  \nCoupled with the natural tendency to react in a certain way, we end up with the  \ndriver yelling at the police officer — not a winning strategy in most circumstances.\nThe three-step process for avoiding emotion-driven reactive behavior is  \nknown as SBO: Situation, Behavior, and Outcome. In the SBO model, you describe a  \nsituation, identify the relevant behaviors, and show how they relate to the outcome.\nThat works well when you’re telling a story about a past situation, but it  \ndoesn’t quite tell you how to plan for a current or future one. When you’re looking at  \na potential problem or conflict trigger on your project, you need to first identify the  \nsituation that promises trouble, and second to define the outcome you would like.  \nThen — and only then — are you in a position to strategize the specific behaviors  \nand actions necessary to link situation to outcome.\nOwner Pressures\nIn the three-sided table, we define the customer as the “outcome owner,” and that  \nrole creates important, and often unspoken, pressures. The person directly identified  \nas the customer may not actually be the end customer, but rather is an intermediary.  \nIf the corporate CEO wants a new data system, the CIO gets the job. The CIO, in  \nturn, may appoint a senior staffer to be the “customer” from the point of view of the  \nproject manager and of the team. The BKPM sometimes has access to these higher-\nlevel customers, but often does not.\nEven if the official customer is the real customer, he or she may not be the  \nonly one. Projects often have constituencies, and within the project’s constituency,  \nthere may be multiple (and sometimes incompatible) needs and objectives. These  \nexternal project stakeholders may have significant political power, and this makes  \nthe outcome owner subject to a wide range of pressures.\nThe BKPM’s role is not merely to broker the relationship between outcome  \nowner and implementation team, but also to “have the back” of the front-line  \ncustomer. In other words, the BKPM acts as COO to the customer’s CEO, and in turn  \nacts as the CEO to the project team. \nThe BKPM must be aware, sympathetic, and supportive of the front-line  \ncustomer. This makes conflict between the BKPM and outcome owner even more  \nsensitive. The front-line customer has to believe that the BKPM will act to protect  \nthe customer, and anything that undermines that essential trust can be devastating to  \nthe project.\nAccess Portals\nThe BKPM must build access portals — and sometimes escape portals — into the \nproject plan to bridge the gap with the customer when conflicts and problems arise.  \nThis goes back to our earlier understanding that the best strategy for conflict  \nmanagement and resolution is to be prepared for it well in advance of the actual  \nneed.\nAccess (and escape) portals come into being as a result of understanding the  \nproject context and preparing for risks, as shown in Figure 7-3. \nHere’s an example of how access portals work.\nIn our discussion of the Triple Constraint, we identified that there was by  \ndefinition some flexibility in the Weak Constraint. When you as a BKPM help the  \ncustomer understand the project dynamic, you both reach an advance agreement as to  \nwhat sort of slippage is acceptable, and what is not. \nWhen a situation arises that upsets the original course of the project, the  \nBKPM steers the damage into the Weak Constraint, where it will do least harm.  \nBecause the BKPM has already reached an understanding with the customer, there  \nisn’t any conflict. It’s been dealt with in advance.\nFigure 7-3. Access Portals. The BKPM must build “access portals” into the project  \nto bridge the gap with the customer when conflicts and problems arise.\nA good project manager identifies critical risks that can affect the project objective  \nand creates plans and strategies to deal with them if they occur. Of course, we all  \nprefer that risks just pass us by, but in the real world, that’s not always the case.  \nBecause the BKPM reviews risks and responses with the customer in advance, when  \na risk actually occurs, there’s already advance agreement on how we will respond.\nAnother type of escape portal is created when the BKPM is transparent on the  \nuse of resources, both in the plan and in the project execution. No matter how much  \neffort or skill is applied, sometimes the project begins to consume more than was  \nplanned. Rather than let the situation fester, the BKPM works with the customer to  \ndiagnose the problem, and supports the customer in the executive decision to  \ncontinue the project — or cancel it before things get out of hand.\nCustomers are often in a delicate position. They may not always have the  \ntechnical understanding, nor experience in the kinds of issues that often arise. In the  \ncustomer/BKPM relationship, the BKPM has P&L responsibility for the project, but  \nthe customer owns the cost/benefit analysis. You provide information on how much it  \nwill cost, but only the customer can decide if it’s worth it.\nAccess portals and escape portals aren’t ways for a BKPM to dodge  \noperational responsibility for the project, but rather are ways to enhance it. When a  \nBKPM is prepared for trouble, and the strategies are laid down and shared in  \nadvance, conflict is avoided and the BKPM and customer can push forward on the  \nsame page.\nReturn to Table of Contents\nCHAPTER 8: The Kranz Dictum\nPlan for Trouble Long Before It Arrives\nOn January 21, 1967, during a launch pad test of what was intended to be the first  \nmanned mission of the Apollo program, a cabin fire broke out. Astronauts Gus  \nGrissom, Edward White, and Roger Chaffee perished in that fire.\nThe accident review board was never able to pinpoint the exact cause of the  \nfire, but what they found was worse: a series of design and construction flaws that  \nmade catastrophe all too likely. When the Apollo 1 capsule was shipped to Kennedy  \nSpace Center, there were 113 significant incomplete planned engineering changes.  \nAfter delivery, NASA issued an astounding additional 623 engineering change  \norders! \nGus Grissom was reportedly so upset that he hung a lemon on the simulator.  \nAfter expressing their concerns about the amount of flammable material in the cabin,  \nthe astronauts gave the program manager, Joseph Shea, a portrait of the three  \nastronauts praying, with a caption that read, “It isn’t that we don’t trust you, Joe, but  \nthis time we’ve decided to go over your head.” (Figure 8-1)\nAlas, the appeal to higher authority was not successful.\nFigure 8-1. Apollo 1 Parody Crew Portrait. Concerned with engineering issues on  \nthe Apollo 1 spacecraft, astronauts (from left to right) Edward White, Gus Grissom,  \nGus Grissom, Roger Chaffee created this crew portrait for program manager Joseph  \nShea, captioned, “It isn’t that we don’t trust you, Joe, but this time we’ve decided to  \ngo over your head.”\nOf course, no project, no matter how well run, can be immune to all disasters, and  \nthe BKPM is never so presumptuous as to think he or she can control all risk. While  \nany particular accident can usually be avoided, it’s absurd to think they all can be.\nGrissom himself recognized the unavoidable risks in spaceflight. “You sort of  \nhave to put that out of your mind,” he said in a 1966 interview. “There's always a  \npossibility that you can have a catastrophic failure, of course; this can happen on any  \nflight; it can happen on the last one as well as the first one. So, you just plan as best  \nyou can to take care of all these eventualities, and you get a well-trained crew and  \nyou go fly.”\nThe key words in Grissom’s statement are plan and well-trained. The BKPM \nknows that problems and mistakes are inevitable, and designs the process with that  \nin mind.\nWhile there wasn’t anything NASA could do about Apollo 1, there was a lot  \nthey could do about future Apollo missions. In fact, one of the key reasons Apollo 13  \nreturned safely to Earth has to do with the reaction to Apollo 1. Mission director and  \nBKPM Gene Kranz developed the “Kranz Dictum,” which guided the response.  \nWhen the next failure inevitably happened, the team was prepared. Plans had been  \nlaid in, and everyone was well trained.\nThe Kranz Dictum needs to be part of every BKPM’s toolkit.\nThe Kranz Dictum\nOne of the big reasons that the Apollo 13 crew returned safely to Earth is because of  \nthe actions of NASA lead flight director (and BKPM) Gene Kranz.\nIn the movie version of Apollo 13, Kranz (played by Ed Harris) frequently  \nsays, “Failure is not an option!” The quote is made up for the movie, but the  \nsentiment is real. \nHere’s the real story.\nFigure 8-2. Apollo 13 Mission Control. Mission Control celebrates splashdown of  \nApollo 13. Gene Kranz is second from the left, clapping.\nFollowing the launchpad fire of Apollo 1, which killed astronauts Gus Grissom, Ed  \nWhite, and Roger Chaffee, Gene Kranz spoke to his team the following Monday and  \ndelivered what became known as the “Kranz Dictum.”\nHere’s what he said.\nSpaceflight will never tolerate carelessness, incapacity, and neglect.  \nSomewhere, somehow, we screwed up. It could have been in design, build, or  \ntest. Whatever it was, we should have caught it.\nWe were too gung ho about the schedule and we locked out all of the  \nproblems we saw each day in our work. Every element of the program was in  \ntrouble and so were we. The simulators were not working, Mission Control was  \nbehind in virtually every area, and the flight and test procedures changed daily.  \nNothing we did had any shelf life. Not one of us stood up and said, “Dammit,  \nstop!”\nI don't know what Thompson's committee [investigating the accident]  \nwill find as the cause, but I know what I find. We are the cause! We were not  \nready! We did not do our job. We were rolling the dice, hoping that things would  \ncome together by launch day, when in our hearts we knew it would take a  \nmiracle. We were pushing the schedule and betting that the Cape would slip  \nbefore we did.\nFrom this day forward, Flight Control will be known by two words:  \n“Tough and Competent.” Tough means we are forever accountable for what we  \ndo or what we fail to do. We will never again compromise our responsibilities.  \nEvery time we walk into Mission Control we will know what we stand for.\nCompetent means we will never take anything for granted. We will never  \nbe found short in our knowledge and in our skills. Mission Control will be  \nperfect. \nWhen you leave this meeting today you will go to your office and the first  \nthing you will do there is to write “Tough and Competent” on your blackboards.  \nIt will never be erased. Each day when you enter the room these words will  \nremind you of the price paid by Grissom, White, and Chaffee. These words are  \nthe price of admission to the ranks of Mission Control.” (Wasser, 2005)\nFace the Future, Not the Past\nThe traditional project manager isn’t part of the three-sided table; he or she is part of  \nthe project team. Accountable for the team process but not accountable for the  \nproject vision or objective, the traditional project manager does what he or she is  \ntold. Since vision issues are at the heart of most project failures, this yields a mixture  \nof successful and unsuccessful outcomes —  no matter how good the traditional  \nproject manager is!\nWhen a BKPM enters the picture, the roles shift. The BKPM is accountable  \nfor the vision process. If a project is wrong or unrealistic, the BKPM confronts the  \nissue before the project even gets started, using forced clarification as a process to  \nbring the project in line with reality. Either the vision (performance criteria/scope)  \nchanges, the circumstances (resources/time) change, or the project needs to be  \nrethought — sometimes even cancelled.\nAs we’ve noted, the BKPM doesn’t create the vision, but is still responsible  \nfor the process that establishes it. The BKPM pushes back against both customer and  \nteam, and oversees course corrections as the project unfolds.\nVisions are necessarily rooted in reality. You can’t just imagine some castle in  \nthe sky and call it a project vision — though sadly, it happens all the time. A real  \nvision starts with a clear understanding of the current situation and a realistic  \nappraisal of the available resources and constraints that shape its accomplishment.  \nThe outcome of the project can be a stretch goal, but it can’t be detached from the art  \nof the possible.\nWhen a project is in trouble, it’s necessary to revisit the vision. If reality —  \nconstraints, needs, resources, and issues — has shifted, the objective may shift as  \nwell. Moving the goal posts is sometimes legitimate — and sometimes necessary.  \nSometimes the goal posts move on their own, whether you want them to or not.\nSometimes, a project needs to be terminated before it spirals out of control.  \nOther times, we learn that the customer needs have evolved, and the project as  \noriginally specified no long solves the underlying problem. Things have to change.  \nAlthough nobody enjoys hearing bad news, the BKPM has to step up to the plate  \nearly.\nA change in vision isn’t the same thing as a failure of the project. Apollo 1  \nwas an unambiguous failure, but Apollo 13 was not. Apollo 13’s original objective  \nwas to go to the Moon, but when one of the oxygen tanks exploded, the vision and  \nmission changed. The old goal was no longer operative, and a new goal — get the  \nastronauts home safely — took center stage.\nWhen the Project Has Already Failed\nSometimes failure isn’t the end of the project, but rather the beginning. In other  \nwords, as in the case of Apollo 13, we undertake some projects because disaster has  \nalready occurred.\nSometimes, the disaster is outside the project. If a hurricane hits the data  \ncenter, it’s not a failure on the part of data center management. If the data center  \nconstruction didn’t take extreme weather into account, however, that does constitute \na failure of management of a different project.\nOther times, the disaster is inside the project. If building the data center is six  \nmonths behind schedule and $2 million over budget, there’s probably something  \nwrong with the vision, performance, or environment.\nIn both cases, the recovery and rescue effort is a separate project. If you’re \ncalled in because the data center is late and over budget, you start with where you  \nare: late and over budget.\nMeasuring success under these circumstances is relative. If you’re already  \npast the deadline to open the new data center, you can’t very well get the center  \nopened on time — not unless you have a time machine, anyway. And that $2 million  \nis already spent; you can’t get it back. The question isn’t how well you can perform  \nagainst the original baseline, but how well and quickly you can get the job done from  \nwhenever you’re forced to start.\nBe Honest and Thorough About Project Risks\nNo project manager — not even the BKPM — has a crystal ball. Rumsfeld’s famous  \n“unknown unknowns” lurk in the darkness, waiting to trip you up. Good risk  \nmanagement helps a lot. Actively search for the kinds of risks and issues likely to  \nharm your project. Adjust the project plan to protect yourself when you can; keep  \nsome reserves and flexibility to deal with the rest. Share your knowledge with other  \nstakeholders. The project vision has to include consideration of risks, or it’s  \nincomplete.\nWhat about the unknown unknowns? Isn’t it true that no matter how good you  \nare, sometimes things just happen? Well, yes…but that doesn’t mean you can’t be  \nready for it. Earlier we listed a number of strategies for managing unknown  \nunknowns. Notice they all require getting out in front of the problem.\nWe use the term “acts of God” because some of the things we do as humans  \nhave risks that can only be controlled by God Himself. That is not, however, an  \nexcuse for disregarding or ignoring them. Many risk management plans deal only  \nwith manageable risks, but that gives you an unrealistic picture of your project  \nsituation.\nWas the loss of the Apollo 1 astronauts preventable? With 20-20 hindsight,  \nthe answer is clearly yes. Project pressures, especially in the time constraint,  \ncombined with the complexity and newness of the technology, increased the risk of  \nsomething going wrong. Given the inherent tension, there’s tremendous pressure on  \nproject managers to push forward and hope for the best.\nFrom our BKPM perspective, this constitutes a failure of the three-sided  \ntable. In the case of Apollo 1, the Apollo Spacecraft Program Office Manager was  \nresponsible for managing the design and construction of both command module and  \nlunar module — but his mandate was to run the technical side of the shop, not to  \nserve as the independent broker between owner and solutions team. As a result, he  \ndidn’t have the positional authority to call a halt when the sheer number of  \nengineering changes threatened to overwhelm the project.\nWhile Gene Kranz managed to become a BKPM within the NASA  \nenvironment, the design of the organization didn’t encourage or support that kind of  \ninitiative, and he succeeded through grit and determination. A strong leader, he was  \nwilling to push back against management as well as to demand excellence from the  \nteam.\nBy the time of the Challenger disaster, the three-sided table had collapsed  \nonce again. One of the members of the accident investigation commission was well-\nknown physicist Richard Feynman. Rather than stick to the investigation channels  \nestablished by the commission leadership, Feynman talked to frontline managers and  \ntechnical personnel. “When I left the meeting [with NASA engineers],” he wrote, “I  \nhad the definite impression that I had found the same game as with the [O-ring]  \nseals: management reducing criteria and accepting more and more errors that weren’t  \ndesigned into the device, while the engineers are screaming from below, ‘HELP!’ and  \n‘This is a RED ALERT!’” (Dobson and Feickert, 23)\nThe danger in the two-sided table is made very clear by the fact that NASA  \nmanagement put the risk of catastrophic shuttle failure at about 100,000 to 1, while  \nthe engineering consensus was that it was closer to 300 to 1. Considering the actual  \ntrack record of shuttle flights, the real number appears to be closer to 50 to 1.\nClearly, however, there was no one in the loop to bridge the gap between the  \ntwo assessments of risk. The lack of a functioning BKPM was a proximate cause of  \nthe disaster.\nIt is inevitable that people, over time, lower their guard as a reaction to the  \ninsidiousness of chance and probability. When people live with risks that never  \nhappen, they start to forget that the risk even exists — then, SMACK! the risk \nhappens. \nThe Kranz Dictum should remind us that risk never goes away.\nDon’t Hide Bad News\nIn a project with the UK Ministry of Defense involving high-stakes testing for senior  \nmanagers, past problems with the process had led to mandated governmental  \noversight and monitoring to ensure consistency and fairness in the project.\nUnfortunately, a BKPM was not at the helm. There were serious underlying  \nproblems. Personnel were constantly changing. Long days were common. Software  \ntools were obsolete. Only heroic action on the part of team members kept the project  \nfrom collapsing on the spot.\nThe project manager, however, did not share these problems with the  \ncustomer. When asked, he repeated told everyone that things were fine, but he was  \nholding the project together with sheer force and a good dose of luck. \nThen it came time to renew the project.\nIn a competitive bid situation with a great deal of cost pressure, the project  \nmanager’s failure to raise the alarm early meant that the company couldn’t suddenly  \nadd in a huge amount of money to upgrade. Had the project manager been forthright  \nabout the problems all along, the bid could have included an upgrade requirement,  \nand those problems could have been dealt with. Both the project manager and her  \nemployer were left vulnerable.\nThere’s an old Saturday Night Live  skit where a Russian news reporter in  \nChernobyl is saying, “Nothing is wrong here. Especially near the nuclear reactor.”  \nIt’s better to say it now than to wait until disaster is upon us.\nThe effective BKPM will never wait until the last minute to face the truth, no  \nmatter how unpleasant it may be. Often, the problem can be solved, albeit at a cost.  \nIn some cases it may be necessary to walk away from the project altogether, or at  \nleast to dramatically rethink the whole thing. In both cases, the problem usually gets  \nworse the longer you wait.\nThe question of how you present bad news is also important. Again,  \npreparation is the best tool you have going for you. Figure 8-3 provides additional  \ntools to present bad news or problem issues in the most effective manner possible.\nFigure 8-3. Tools for Presenting Bad News.  The need to deliver bad news may  \nhappen to any project manager. Prepare in advance by using the following strategies.\n←Don't own the outcome; own the process.\n←\n←Problem-solve the solution. Come up with multiple approaches. The old  \nsaw, “Don’t bring me problems, bring me answers” is good policy, even  \nthough it’s not always possible.\n←\n←Don’t commit to one solution alone, but rather develop a set of options to  \npresent to the customer so you can make the decision jointly. This is true even  \nif there’s only one good option. Add some less-good options into the mix  \nbecause lots of people want to feel there’s a choice, no matter how  \nconstrained.\n←\n←Avoid being maneuvered into a solution prematurely. The “ready-fire-\naim” syndrome has sunk many projects. An answer that makes the situation  \nworse is always possible, so make sure to “murder board” your solutions.\n←\n←Cultivate your “walk away” power. If you’re seen as someone out to  \nprotect his or her own role at all costs, no one will see you as an honest  \nbroker. When you put the project ahead of your own career interest, the gain  \nin extra trust actually increases the likelihood of your survival.\nEmbrace Redundancy and a Certain Amount of Inefficiency\nIt may sound strange for a BKPM to embrace redundancy and a certain amount of  \ninefficiency, but both of these are invaluable tools for managing a troubled project.  \nFor example, part of the survival of Apollo 13 was because someone put together an  \nemergency kit that contained duct tape. No duct tape, no improvised CO 2 filters. \nOf course, that same emergency kit was also on every other Apollo flight —  \nand generally went unused. That’s inefficiency in action. Most spacecraft systems  \ncontain redundancy. If one fails, the mission doesn’t end in catastrophe because the  \nbackup is there to take up the slack.\nIt’s reasonable to debate how much redundancy and how much inefficiency is  \nappropriate to the level of actual project risk, but as long as risk and uncertainty are  \npart of your project environment, build in some margin to help you manage it.\nRedundancy and a certain amount of inefficiency can be highly desirable  \nwhen you’re managing projects with significant risk. Things will go wrong, and \nhaving some flexibility in the project parameters to deal with them dramatically  \nincreases your odds of success. Think about the kinds of resources you’ll need to  \ncope with the unexpected. By the time you experience the emergency, it’s too late to  \nput together the kit.\nTraining and preparation are part of the inefficiency and redundancy in a  \nproject. We train people for work above and beyond their daily responsibilities; we  \nprepare for eventualities that never happen. We said earlier that part of becoming a  \nBKPM is having enough real world experience (which usually includes the bruises  \nand scars to show for it). But a capable BKPM isn’t enough without a trained and  \nready team to do the work. Preparing an organization for crisis response takes effort  \nand time. Expend the effort and time all along so you have the capability ready when  \nyou need it.\nUse the Eisenhower Grid to Prioritize Efforts\nGeneral and President Dwight D. Eisenhower (another BKPM) said, “What is  \nimportant is seldom urgent, and what is urgent is seldom important.” He grouped his  \naction items into four quadrants, illustrated in Figure 8-4.\nFigure 8-4. The Eisenhower Grid. Sort action items into four quadrants to set  \nproper priorities.\n←\n←Group A is reserved for tasks that are both important and urgent — a \ntextbook description of a crisis. Those tasks get done immediately and  \npersonally. That doesn’t necessarily mean that you do every aspect of them  \nyourself, but that you oversee the work directly and are accountable for it  \npersonally.\n←\n←Group B tasks are those that are urgent, but not important. They get \ndelegated, both the work and the oversight. A lot of busywork falls into Group \nB.\n←\n←Group C tasks are important, but not urgent. While they have long-term  \nbenefit, the lack of urgency means they often fall through the cracks. Setting  \nan end date gives those tasks a bit of artificial urgency and increases the  \nlikelihood they get done. Those also get overseen personally. Group C tasks,  \nby definition, are proactive.\n←\n←The Trashcan contains tasks that are neither important nor urgent . \nThey’re trivial, and can be dropped altogether (or at least delegated to  \nsomebody else). If a job’s not worth doing in the first place, don’t do it poorly  \n— just don’t do it.\n←\nWhile crisis management (Group A) is clearly necessary, notice that all the things  \nyou do to get ready for a crisis, such as training, always fall into Group B. They’re  \nimportant — critically important — but because they aren’t urgent, we often don’t  \nget around to doing them at all.\nManage Both Facts and Feelings\nIf there has to be conflict between BKPM and outcome owner, try to have it in the  \nvision phase (or in the case of a troubled project, the modification of vision phase).  \nCan the project be accomplished in a satisfactory manner within the available  \nresources and time? If the answer is no, it doesn’t do the customer any favors to go  \nahead. Don’t reenact the Charge of the Light Brigade on somebody else’s dime.\nIf you have an unreasonable project owner who demands the project move  \nforward, remember that if you accept the project, you become accountable for  \ndelivering. Don’t set yourself up for unnecessary and inappropriate failure.\nWhen Winston Wolf arrives at the scene of the problem in Pulp Fiction, \ntransparency and situational awareness are uppermost in his mind. “About the car,”  \nhe asks. “Is there anything I need to know? Does it stall, does it make a lot of noise,  \ndoes it smoke, is there gas in it, anything?” If the car has problems, he will either  \nhave to modify his strategy or abort the project.\nFortunately, Vincent answers him by saying, “Aside from how it looks, the  \ncar’s cool.”\nBut the BKPM can’t afford to take empty assurance for granted. “Positive?”  \nWolf asks. “Don’t get me out on the road and I find out the brake lights don’t work.”\nIt’s only when Wolf is satisfied that the circumstances of the project are as  \nrepresented that he’s willing to move forward. When you own responsibility for the  \nproject’s process, you must know all the relevant facts.\nWatch out for emotion. Under stress, it’s all too easy to get caught up in the  \nemotional “fight or flight” syndrome, when the limbic system kicks in and  \ncomplicates your thinking process. Smooth the potential conflict by positioning the  \nthree-sided table toward problem solving rather than blamestorming. Figure 8-5  \nprovides some useful phrases.\nFigure 8-5. Problem-Solving Phrasebook. Prepare in advance so that in the event  \nof problems, you can say the following:\n←“We said there were risks, and we discussed this risk.”\n←\n←“We agreed that if this risk occurred, we would take the following  \nactions.”\n←\n←“We need to regroup and evaluate this new situation before moving  \nforward.”\n←\n←“Let’s discuss possible reactions and determine our next steps.”\n←\n←“Based on these developments, let’s determine the new outcome that will  \nbest satisfy your needs.”\nAdvance preparation is key. Your objective must be to handle the new circumstance  \nor risk event calmly, as if it had been a possible outcome all the time. \nChange the dynamic. Change the perspective. If there’s opposition, look at the  \nproblem from the opponent’s point of view. Help the project owner clarify the vision.  \nWork to develop mutual options.\nReturn to Table of Contents\nCHAPTER 9: The Next Bout\n\nThe Program and the Project\nWhen John L. Sullivan, Muhammad Ali, or Bruce Lee finishes a fight, it’s time to get  \nready for the next bout. A fighter’s career consists of many encounters. A champion  \nfighter manages his career as effectively as he manages each individual bout.\nAs we know, the fundamental characteristic of a project is that it ends. That’s  \nwhat distinguishes it from operational (everyday) work. The BKPM, on the other  \nhand, goes on. A BKPM may be something more than just a project manager: he or  \nshe might be a senior manager or executive with ongoing responsibilities. Other  \ntimes, a BKPM moves from project to project, and in the overlap often becomes  \nresponsible for more than a single project.\nThe transition from project to project, or between projects and on-going work,  \nhas special issues as well. A BKPM understands how to bridge the different roles and  \nwhat steps are needed to move from one bout to the next.\nIf the organization delivers projects to customers (in other words, the BKPM  \nis customer-facing), the BKPM is also part of the sales and marketing team. BKPMs  \nidentify potential areas for new business, provide technical understanding and insight  \nto account managers to help them sell new business, and support the overall sales  \neffort for new work. \nAnd, of course, the BKPM provides a competitive advantage. What makes  \none contractor better than another? One key consideration is always the quality of its  \nleadership. A BKPM, by his or her very nature, is viewed by customers as a senior  \nexecutive; their track record of execution earns them that position.  With a BKPM on  \nyour team, your case for winning the business gets much stronger. Who wouldn’t  \nwant Gene Krantz on their space mission, Fred Astaire in their musical, or Winston  \nWolf cleaning up their mess? BKPMs not only get the job done, they get the job.\nClosing Time (Come Back Tomorrow)\nOne oddity you’ll find in many project plans, including plans developed by supposed  \nproject management experts, is that they often stop dead when the technical work  \nends. They leave out the often complex and sometimes dangerous process of closing  \nout the project and transferring the results to their new owners. There’s often a lot  \nmore work here than you’d think.\nOnce the project is (a) complete, (b) turned over, and (c) closed out internally,  \nthere are two additional steps you must do — not so much because they benefit the  \ncurrent project (that’s over now), but because they set you up for the next bout.\nAs we’ve said, BKPMs need experience and the accompanying wisdom that  \ngoes along with it. Here’s how to make that a systematic process, not only for you,  \nbut also for any future BKPMs that may be part of this project.\nThe two steps are (a) measurement of the outcome, and (b) lessons learned  \nthrough the process.\nMeasurement of the Outcome\nIt’s at the end of the project that you learn again how vital it is to define the objective  \nat the beginning. There’s an old management joke: The customer says, “Bring me a  \nrock.” \nThe project manager gets a rock and brings it back to the customer. “No,” the  \ncustomer says, “that’s not the rock I wanted.”\nThe project manager goes and gets a different rock. “No, that’s not it either.”  \nAnd so on.\nUnless you define the nature (and often the reason) of the rock you want, the  \nproject’s in deep trouble even before you start work. If the definition of project  \nsuccess comes down to personal opinion, customers trump BKPMs or team  \nmembers, and higher rank beats lower rank. In some cases, there isn’t any other  \nlegitimate way to measure success, so we fall back on the traditional principle, “If  \nmama ain’t happy, ain’t nobody happy.”\nFortunately, that happens in the minority of projects. In most cases, you can  \nmeasure the degree of success using objective criteria. The best way to do that, of  \ncourse, is to establish those criteria at the outset. \nTraditionally, objectives must be S-M-A-R-T, or sometimes S-M-A-R-T-E-R.  \nThese criteria help define and measure whether you have a properly stated and  \nframed goal in place.\nFigure 9-1. S-M-A-R-T and S-M-A-R-T-E-R. Your project objective must satisfy  \nthese conditions in order to make the project possible.\nWhether you prefer “S-M-A-R-T” or decide you prefer being “S-M-A-R-T-E-R,”  \nmake sure that your objective meets one additional criterion:  able to be measured at  \ninterim milestones . It’s a dangerous idea to wait until the end of the project before  \nyou can tell whether you made the goal or not. Being able to check progress at key  \nintervals gives you the opportunity to make course corrections before it’s too late.\nIf you can’t measure it, it isn’t real — and it’s hard to get paid for it.  \nBeginning with the three-sided table approach to developing the goal, process, and  \nmethodology, the BKPM approach emphasizes the importance of concrete, realistic  \ngoals. Those goals are always and necessarily measurable. Identifying the  \nappropriate measurement of the outcome is inherently linked to the goal itself.\nWhat if the nature of the project changes? As we discussed in the previous  \nchapter, it’s always possible for problems, evolving needs, and environmental factors  \nto force a change in the project, and that means old goals and old metrics can become  \novertaken by events. The BKPM solution is to evolve the metrics along  \nsimultaneously with the objectives. This must be done at the same time,  negotiating  \nwithin the project’s triple constraints. Synchronizing goals and metrics post-mortem  \ndoesn’t work.\nDon’t Do “Lessons Learned”\nEvery book on project management agrees on the importance of a “lessons learned”  \nactivity at the end of the project. \nWe disagree. “Lessons learned” in real life almost always turn out to be  \ncompletely useless. Figure 9-2 gives some reasons why.\nFigure 9-2. Why “Lessons Learned” Aren’t Useful. Although “lessons learned”  \nmake sense in theory, in practice they are a lot less useful than you’d think.\nThe pressure of new work makes us skip them.\nMost people and organizations never learn how to do them right.\n“Lessons learned” too often turns into “blamestorming,” in which the goal is  \nfiguring out who to pin it on rather than how to make it better.\nEven when lessons learned are done well, the recommendations sit on the  \nshelf and don’t get used to improve future projects.\nRecovering Value\nInstead of futile “lessons learned” project post-mortems, in BKPM we use a more  \npowerful technique: recovering project value.\nAs we’ve discussed, part of becoming a BKPM is acquiring the wisdom from  \nyour experience. That’s usually the argument for you to do “lessons learned” on an  \nalmost continual basis, whether you’re supported by the rest of your organization  \n(and team) or not. But if it doesn’t work — and it doesn’t — you need something  \nelse instead.\nPost-it® Notes, that essential tool of project management, was an incidental  \nbyproduct of a failed project. A 3M scientist accidentally developed a “low tack”  \nadhesive, but nobody could figure out what it was good for until a colleague used it  \nto stick a bookmark in his hymnal.\nYou do a lot of creative work on a project, and the act of facing and solving  \nproblems may open up doors that no one expected. Ask yourself and your team what  \nsecondary benefits may be extracted from the project, and you may be pleasantly  \nrewarded.\nOperational experience translates into better projects. As General (and  \nBKPM) Ulysses S. Grant said, “It is well and wise to learn from our mistakes, but I  \nprefer to learn from the mistakes of others.”\nWhat distinguishes a BKPM “recovering value” process from “lessons  \nlearned” is that the BKPM approach focuses on the future, not the past. It avoids  \n“blamestorming.” It looks at much more than just the plan and the process. It insists  \non follow-through. We want to know not merely what the lessons are, but how  \nexactly we plan to implement those lessons for future projects.\nIn other words, “recovering value” isn’t the last task of the old project. It’s the  \nfirst task of the next project.\nIndividual Incentives vs. Organizational Incentives\nWe were there to witness a situation in which a very senior government executive  \nmet with a roomful of contractors engaged in implementing a number of IT  \nplatforms. The official made his desires clear. \n“Look, don't tell me that everything is proceeding according to requirements if  \nthey are not. There are things being put into motion way up the line, promises  \nbeing made, based on whether we have this system in place and operational by  \nthis date. We've had meeting after meeting about why things aren't getting done,  \nbut no one is actually telling me that we are going to miss our end date. I need to  \nknow. Tell me the truth. Are we going to make our end date?”\nDead silence.\nAlthough every single contractor knew there was a problem and knew that the  \nend date was going to come and go without an operational system, no one was  \nwilling to speak up. \nWhy did this happen? Well, under the terms of the contract, as long as each  \ncontractor had fulfilled his or her technical obligations, there would be no blame  \nattached, nor consequences imposed. If the system were late, the result would  \ninevitably be a contract extension and quite probably additional funds.\nIn other words, this situation had a structural conflict between the needs and  \ngoals of the organization and the needs and goals of the contractors. This situation is  \nhardly unique to government, but it brings up one of the most challenging long-term  \nissues any BKPM can face: the question of motivation.\nHave you ever met an unmotivated person? When we ask that question, every  \nhand shoots up. But let’s think differently for a minute. Have you ever met someone  \nwho spends more time and energy each day scheming to get out of the work than it  \nwould take to actually get it done? Most likely, your answer is yes. And if that’s the  \ncase, then you have to admit that this person is actually quite motivated — just in the  \nwrong direction.\nWhen any BKPM confronts noncooperation, the most important skill is  \ndiagnosis. If someone isn’t doing what I want, why not?\nThere are three fundamental reasons, as shown in Figure 9-3.\nFigure 9-3. The Iron Laws of Human Motivation.  When someone isn’t performing  \nas desired, you must understand why before taking effective action.\nThe Diagnostic Question: “Why is someone not doing what I want him or  \nher to do?”\nPossible reasons:\n1.  They don’t know what I want. \nSolution: Communication\nA “don’t know”situation isn’t a motivation issue, but rather a  \ncommunications issue. Make sure they understand what you  \nwant them to do. Are your directions clear? Has the importance  \nbeen communicated? \n2.  They can’t do what I want. \nSolution: Remove the obstacle\nA “can’t do” situation isn’t a motivation issue either. If  \nsomeone really can’t do what you want, it may be training,  \ntools, or aptitude that stands in the way. You must diagnose the  \nbarrier and see if you can remove it. Sometimes that involves  \nchanging the person, but usually you don’t have to go that far.\n3.  They won’t do what I want. \nSolution: Change the incentives\nOnly “won’t do” situations are motivational in nature.  \nRemember, people don’t do what you want, but rather what you  \nreward, and they tend not to do what you punish. If you have a  \n“won’t do” situation, modify the motivations to change the  \nbehavior.\nThe Motivation Question: Why won’t someone do what I want him or her to  \ndo?\nPossible reasons:\n1.  Performance is punished.\nSolution: Remove the punishment\nIf doing a good job on an unpleasant assignment results in you  \ngetting all the unpleasant assignments, you’ve been punished \nfor performance. The likely result is lower performance in the  \nfuture. In addition, other people notice this, and their  \nperformance suffers as well. Identify any ways in which people  \nreceive a negative incentive for doing what you want, and  \nchange it. Perhaps you can’t undo all the negative  \nconsequences, but you can at least add positive rewards to  \ncompensate.\n2.  Failure is rewarded.\nSolution: Remove the reward\nIn the example above, failing to meet the due date means a  \ncontract extension and more money. Combined with the lack of  \npenalty for missing the deadline, the motivation is all too  \nobvious. As in the previous case, you must undo the rewards \nfor failure if you can, or at least add negative consequences for  \nfailure or additional positive consequences for success.\n3.  Performance doesn’t matter.\nSolution: Establish incentives\nWhen even outstanding performers get assignments that seem  \npointless, motivation naturally suffers. If you’re supposed to  \nfile lengthy reports and as far as you can tell, no one reads  \nthem, those reports are likely to get short shrift. If you’re told  \nthis is an emergency and you jump to it, only to find out that it  \nwas never an emergency, you feel as if you’ve wasted your  \ntime. No one likes pointless work. If the work is indeed  \npointless, remove it. If there’s a point but the performers can’t  \nsee it, make sure they know about it. As with the other two  \ncategories, consider adding rewards for performance or  \npotential consequences for nonperformance.\nAbove all, it’s critical to align the rewards and negative consequences of your team  \nwith the goals of the client and the organization. If people support the goals, they  \nneed to have their own incentives tied in. Inaction is not a BKPM principle. When  \nmotivation is at stake, you must act and act quickly.\nWhen a Project Becomes an Initiative\nProjects end, but some programs and initiatives are ongoing. Often, they resemble a  \nproject in superficial ways, but there are usually key differences that the BKPM must  \nrecognize and manage.\nUnlike projects, initiatives are either ongoing or have an end so far in the  \nfuture that it’s almost the same thing. Unlike projects, initiatives don’t always have  \ndefined end states, such as an internal “continuous improvement” program. Unlike  \nprojects, initiatives are made up of such large components that there isn’t any such  \nthing as a single discrete process that leads from start to finish.\nApollo 11 was a project. Apollo itself was a program, consisting of multiple  \nprojects. The Kennedy-inspired mission to “landing man on the moon and returning  \nhim safely to this earth,” on the other hand, was an initiative, driven at the highest  \norganizational levels. Initiatives are by their nature tied deeply into overall  \norganizational strategy. They are almost always very political, affecting numerous  \ninterests and careers.\nWithin the space program, there were many BKPMs. Earlier, we discussed  \nmission director Gene Kranz, but he was far from the only leader. But the space  \nprogram itself was led not by an astronaut, not by an engineer, not by the  \nadministrator of NASA, but by the then-Vice President of the United States, Lyndon  \nJohnson. It was Lyndon Johnson who first drew Senate attention to the Soviet  \nSputnik launch, and in the process coined the phrase “space race.” When he became  \nPresident, John F. Kennedy put Lyndon Johnson in personal charge of the space  \nprogram, and when he became President after Kennedy’s assassination, Johnson  \ncontinued to make the space program a top priority.\nLyndon Johnson was by any fair standard, bare-knuckled, but he wasn’t a  \nproject manager as such. He was an executive politician, one of the most skilled  \npractitioners in American history. \nWhile BKPM principles can drive the process, it’s even more important for  \nthe BKPM to keep the separation between owning the process and owning the  \noutcome. A smaller focus — an Apollo mission, the Saturn V booster, the flight  \nsimulator program — is where the BKPM excels.\nWatch also for large, complex, and amorphous initiatives in which there’s no  \nopportunity to tame the process or deliverables. Hurricane Katrina was the cause of  \nthe worst civil engineering disaster in United States history. Among the casualties  \nwere FEMA director Michael “You’re doing a heckuva job” Brown and New Orleans  \nPolice Superintendent Eddie Compass, both of whom lost their jobs. The U. S. Army  \nCorps of Engineers was assigned direct blame for the levee system failures, but  \nescaped responsibility under the sovereign immunity doctrine.\nThere were successes in Katrina. The United States Coast Guard, the National  \nHurricane Center, and the National Weather Service were all commended for their  \nactions before, during, and after the incident. But no matter how well they  \nperformed, the overall initiative can only be classified as a tragic disaster.\nSuccess for the BKPM and success for the initiative aren’t always the same  \nthing. It’s absolutely the case that the BKPM does everything possible to save the  \noverall initiative, but when that isn’t possible, the BKPM delivers excellence in  \nwhatever arena he or she can control.\nThe OODA Loop\nA decision, Fletcher Knebel wrote, is something a man makes when he can’t find  \nanybody to serve on a committee. Of course, the BKPM can’t afford to take that  \nattitude. We must decide, and we must own our decisions.\nUnited States Air Force Colonel (and BKPM) John Boyd developed a  \npowerful decision-making model known as the OODA Loop (Observe, Orient,  \nDecide, and Act), shown in Figure 9-4. Although it was originally designed for  \ncombat operations, it’s gained increasing use in commercial operations and process  \nmanagement.\nFigure 9-4. The OODA Loop.  Observe, Orient, Decide, & Act.\nThe decision-making process is a recurring cycle. The more rapidly and the more  \neffectively you process this cycle, the better your decisions are likely to be.\nThe first step of the process is to observe. What are the circumstances around  \nyou? What are the environmental conditions? Is there outside information available?  \nHow have previous decisions been working out? What controls or constraints limit  \nyour range of action?\nNext, it’s vital to orient yourself. As Boyd himself wrote, “The second O,  \norientation – as the repository of our genetic heritage, cultural tradition, and previous  \nexperiences – is the most important part of the O-O-D-A loop since it shapes the way  \nwe observe, the way we decide, the way we act.” Decisions often get stuck in this  \nstage, especially when there are multiple actors in the process. After each participant  \napplies his or own filters to the issue, there may be nothing else. The BKPM must  \nbreak through the cycle powerfully but accurately. This involves understanding our  \nown basic assumptions and attitudes, and learning how to correct for our internal  \nbiases.\nThe third step is to decide. A decision is in many ways a hypothesis, because  \nit’s uncertain. If the situation is complex, have you threaded your way through all the  \ntradeoffs? Are you clear about what you want the decision to accomplish? Are you  \nwilling to accept the downside risks or negative side effects?\nA decision by itself accomplishes nothing. The BKPM must therefore act,  \nimplementing the decision and monitoring the effects. And that in turn leads us back  \nto observe, restarting the OODA Loop for our changed situation.\nThis applies not only to decisions within a project, but it also brings us full  \ncircle to “recovering value.” That’s the “observe” stage for the next project.\nReturn to Table of Contents\nCHAPTER 10: Transforming the Project — and the  \nOrganization\nThe Road to Excellence\nMost projects, as we’ve seen, fail, and that’s a terrible problem for most  \norganizations. Projects are often our most important product. Projects are the way  \nchange takes place. Projects are the way problems get solved. Projects are the way  \nwe expand our business reach. Projects are the way we grow and prosper. When  \nprojects fail, the organization fails along with it.\nThe projects you choose, the resources you provide, and above all, the  \nleadership you show make the critical difference between success and failure.  \nProjects fail for many reasons, but the most important reason is lack of leadership.\nProject leadership isn’t the same thing as ordinary organizational leadership.  \nProjects are temporary, which means that most project teams are temporary as well.  \nTeam members usually have permanent homes in other departments or other  \ncompanies, along with supervisors, regular job requirements, and everything else that  \ncomes with the territory.\nAnd those permanent supervisors are usually not the same people as the  \nproject manager. Project managers are temporary, part-time bosses with limited  \ncontrol over their team members. Project managers often can’t fire people (though  \nthey can kick them off the team), or even discipline them officially. \nIn some ways, project managers are like the character Blanche DuBois in A \nStreetcar Named Desire , who famously said, “I have always depended on the  \nkindness of strangers.” We have all the responsibility, but usually not the official  \nauthority.\nThe Bare-Knuckled Project Manager understands that reality, but doesn’t let it  \nstand in the way. Leadership is far more than official supervisory authority. In fact,  \nsupervisory authority is usually not all it’s cracked up to be. Just because someone is  \nsupposed to do what you say doesn’t mean they actually will. Enabling great  \nperformance is the work of leaders. Ordinary project managers may be good enough  \nfor ordinary projects, but when the challenge is there, you need to “send for the sons  \nof bitches.”\nNothing matters more to your success than putting the right people in charge  \nof it. No system, approach, method, or tool will deliver the results you need without  \nthe leadership of those in charge. That’s why the essence of Bare-Knuckled Project  \nManagement is to find (or grow) Bare-Knuckled Project Managers who can get the  \njob done.\nThe differences between a BKPM and a master project manager are key:\n←The master project manager pursues career growth.\n←The BKPM pursues results, and career growth follows.\n←\n←The master project manager pursues career stability.\n←The BKPM pursues consistent results, and career demand follows.\n←\n←The master project manager pursues success.\n←The BKPM pursues wins.\nThe Bare-Knuckled Customer\nWe’ve talked about the Bare-Knuckled Project Manager, but let’s not forget the Bare-\nKnuckled Customer. Unlike project managers (of any sort), customers don’t have to  \ngo through certification, learn a set of tools, or really much of anything else. The  \nminimum qualifications of a customer are: (1) a need, and (2) the ability to pay.  \nEverything else is optional.\nWhile the job of the BKPM is to succeed regardless of the obstacles or  \nchallenges the customer, the organization, or the environment may provide, a great  \ncustomer is a powerful asset in getting the job done. Through forced clarification and  \nthe three-sided table, the BKPM ensures that the customer is clear about desired  \noutcomes, understands the risks and choices that need to be made, and is willing to  \nmake a commitment.\nWhen a regular customer becomes a Bare-Knuckled Customer (BKC), he or  \nshe knows how to push the BKPM and the team for better results. The BKC knows  \nwhat he or she wants, understands the costs and challenges perfectly, and demands  \nthe highest level of performance from the others at the three-sided table. The BKC  \nunderstands where a hands-on approach is helpful, and where hands-off is better. \nBy understanding the overall bare-knuckled approach to project management,  \nthe BKC is an active, supporting partner in the drive for success.\nThe Bare-Knuckled Technical Team\nTechnical professionals are drawn from all walks of life, and bring their own unique  \nperspectives to the job. Understanding the technical issues and challenges at stake,  \nthey make the detailed day-to-day decisions and choices that build the solution and  \ndeliver the desired outcome. \nThe danger with skilled technical professionals is that they’ll dive down the  \nrabbit hole of technical minutiae, spending disproportionate amounts of time and  \nenergy on minor issues, or even worse, push toward a technically elegant solution  \nthat isn’t what the customer really wants or needs. That’s why the BKPM isn’t part of  \nthe solution team, but remains an independent part of the three-sided table.\nTechnical professionals, too, can take a bare-knuckled approach to the job.  \nBare-Knuckled Technical Professionals (BKTP) know how and when to push back.  \nSometimes the proposed solution is wrong-headed, or the customers and project  \nmanagers have a completely unrealistic picture of what’s involved. Work is like an  \niceberg: ninety percent of it is invisible to outsiders. That’s why most jobs cost more  \nand take longer than you think.\nThe first element that distinguishes the BKTP from an ordinary technical  \nprofessional is assertive communication . The assertive part is the willingness to push  \nback. A lot of technical professionals have that. It’s the communications part where  \nthey often fall short. Each technical discipline has its own language, and it’s often  \nnot the same language the customer speaks. (It may not always be the same language  \nthe BKPM speaks.) A true BKTP knows how to translate and convey the real issues  \nin a way that project manager and customer can understand.\nThe second element that distinguishes the BKTP is perspective. It’s easy to \nknow your own field and your own issues. It’s much more challenging to learn to see  \nthe world as others see it. The better you understand the issues and concerns of the  \ncustomer and the project manager, the more effective you’ll be in coming up with  \nmeaningful, useful solutions.\nThe third element of a BKTP is positive energy. While empty happy talk  \nbenefits no one, the technical professional who’s a reliable wet blanket (and we all  \nknow who we’re talking about) loses credibility and effectiveness at a rapid rate.  \nPositive energy is contagious. It makes people more willing to listen. It drives the  \npeople around you to higher levels of achievement. \nPerhaps most importantly, if you’re known as a positive team player in  \ngeneral, you’ll be listened to on the occasions when you have to deliver very  \nnegative news. That’s something worth cultivating.\nThe Bare-Knuckled Organization\nSome BKPMs are outside hired guns, brought in to fix troubled projects or to  \nprovide special skills. Other BKPMs are internal, whether they head the PMO or  \nserve in an executive role overseeing the largest and toughest projects. Either way,  \norganizational support is a crucial element that allows the job to get done.\nAs we’ve seen, it’s primarily the responsibility of the BKPM to ensure that  \nthis support takes place. Through the three-sided table, the BKPM pushes the  \ncustomer organization to face the reality of the project — to put up or shut up. That’s  \nvital for any project, but the organization can think and act better if it takes on a  \nbare-knuckled identity of its own.\nBare-knuckled organizations recruit, develop, and promote bare-knuckled  \nteam members. Using limbic learning as a career development strategy, they develop  \nBKPMs and help develop similar skills in line customers and technical teams as well.\nBare-knuckled organizations develop meaningful strategic and tactical  \nvisions. They know where they want to go and what it will take to get it there. They  \nface the tough choices and hard decisions without self-imposed blinders. They  \nclearly articulate what they want so that BKPMs, line customers, and team members  \nunderstand what they have to do.\nBare-knuckled organizations aren’t afraid of pushback — they welcome it.  \nThey’re always willing to hear unpleasant news without shooting the messenger, and  \nunderstand that fixing problems is more important than assigning blame.\nBare-knuckled organizations grow. By developing maturity in others, they  \ngrow in maturity themselves.\nBare-knuckled organizations succeed.\nThe Real World\nBeing a bare-knuckled project manager, a bare-knuckled customer, a bare-knuckled  \nteam member, or a bare-knuckled organization is a journey, not a destination. We  \ncan’t get there overnight, and no matter how well we perform today, we’re capable of  \nperforming even better tomorrow.\nNo matter how hard we try, none of us will achieve perfection. That means  \nthe BKPM always and necessarily swims in shark-filled waters. We have to train,  \ncounsel, and push our customers. We push team members to and beyond their limits.  \nWe challenge organizational assumptions and ways of doing business.\nYou can’t be willing to tell the Emperor he has no clothes if you’re desperate  \nto keep your job. The BKPM has to put the customer’s needs ahead of the customer’s  \npoint of view, and that means giving people unpopular and unpleasant news.\nWhat appears to be risking career suicide, however, is actually good for us as  \nwell. Too many people think you have to choose between being ethical and being  \nsuccessful, but we’re convinced that’s completely backward. Being strongly ethical  \nimproves your chances of success. People who have integrity and competence are  \nalways in demand — if not right here and right now, then somewhere else and soon. \nIn fact, the opposite is true. People who put their ethics on hold to do what the  \nboss says may get short-term praise, but they’re the first to be thrown to the wolves  \nwhen the sled needs to be lightened.\nIn other words, for a BKPM, our jobs are in jeopardy when all we do is our  \njobs.\nGeneral George S. Patton\nA Way of Life\nBeing bare-knuckled isn’t just about running successful projects. A bare-knuckled  \napproach is, as far as we’re concerned, the best way to live our lives. Who wants  \nempty safety and useless accomplishments when we can achieve greatness? Taking  \nsmart risks and putting ourselves on the line is the path to work that we take pride in,  \nfor achievements we can point to, for successes we helped bring into being.\nIn his famous speech on taking command of the United States Third Army,  \nGeneral George Patton defined for all times what it means to be bare-knuckled.\n“There is one great thing that you men will all be able to say after this war is  \nover and you are home once again. You may be thankful that twenty years  \nfrom now when you are sitting by the fireplace with your grandson on your  \nknee and he asks you what you did in the great World War II, you won’t  \nhave to cough, shift him to the other knee and say, ‘Well, your granddaddy  \nshoveled shit in Louisiana.’ No, sir, you can look him straight in the eye and  \nsay, ‘Son, your granddaddy rode with the great Third Army and a son-of-a-\ngoddamned-bitch named Georgie Patton!”\nA project is ultimately about the destination, but the journey matters as well.  \nBare-Knuckled Project Managers get the job done. It is, after all, their raison d'être. \nBut BKPMs also make the journey itself interesting, challenging, and fun. It’s great  \nto be a BKPM, and it’s great to work for or with one as well. \nAt the beginning of this book, we invited you to call us so that you can  \nexperience first-hand what it means to have a BKPM at the helm of your project. Now  \nthat you know what a BKPM is, and how BKPMs work, we hope you’ll take us up on  \nthat invitation.\nThanks for reading. We look forward to hearing from you.\nReturn to Table of Contents\nGlossary\nAccess (Escape) Portals. A strategy the BKPM builds into the plan to allow  \nbridging the gap with the customer when conflicts and problems arise. Access portals  \ninclude agreeing about areas of relative flexibility, agreeing about responses to  \nforeseeable risks, agreeing about approaches to unforeseeable risks and issues, and  \nagreeing about processes for conflict resolution.\nAgile. A method of software development that uses an iterative process with multiple  \ncycles to bring the final product ever closer to the goal. Contrast with waterfall.\nBKPM. Bare-Knuckled Project Manager, or alternately Bare-Knuckled Project  \nManagement. You can also have Bare-Knuckled Customers, Bare-Knuckled  \nTechnical Professionals, and even a Bare-Knuckled Organization.\nCo-Opt Risk. What happens when the three-sided table breaks down and the project  \nmanager becomes aligned with one of the remaining two sides.\nDriver. The leg of the Triple Constraint that cannot fail without bringing down the  \nwhole project.\nForced Clarification. The process by which the BKPM ensures that the customer or  \nsponsor defines the outcome, a necessary precondition to moving forward with the  \nproject.\nG-R-E-A-T. An acronym for team building, which works best when people are clear  \nabout Goals, Roles, Expectations, Attitudes and Aptitudes, and Time.\nIterative Approach. When the outcome isn’t clear up front, the project may go  \nthrough cycles and multiple prototypes to gain increasing clarity and understanding.  \nMay be part of an agile process.\nJeet Kune Do. A martial arts “style of no style” developed by Bruce Lee, and a  \nmetaphor for the BKPM approach.\nMiddle Constraint. The Triple Constraint that falls between the driver and the weak  \nconstraint.\nPMBOK®. A PMI publication, short for A Guide to the Project Management Body  \nof Knowledge, that provides a widely accepted standard for the practice of project  \nmanagement.\nPMI®. The Project Management Institute, a leading association of project managers.\nPMO. Project Management Office, a division inside the organization that provides  \nservices, direction and support to the range of multiple projects that are taking place.\nPMP®. Project Management Professional, a certification for project managers  \noffered by PMI.\nRecovering Value. The BKPM alternative to ineffective “lessons learned,” a strategy  \nto extract value from the project experience and results to benefit the organization  \nand future projects.\nS-M-A-R-T-(E-R).  An acronym to measure whether a project objective is  \nsufficiently detailed and clear: Specific, Measurable, Agreed upon, Realistic, Time  \nconstrained, Ethical, and Rewarded.\nThree-Sided Table. A BKPM approach to project management in which the BKPM  \nowns the process (but not the outcome), the sponsor or customer owns the outcome  \n(but not the process), and the partners and team own the technical solution.\nTriple Constraint.  The traditional set of constraints that shapes the world of any  \nproject, consisting of the time constraint, the cost (or resource) constraint, and the  \nmandatory performance criteria, ranked in the order of flexibility as driver, middle  \nconstraint, and weak constraint.\nWaterfall. What agile practitioners call conventional project planning, in which  \ntasks have clear beginnings, endings, and dependencies. \nWeak Constraint. The Triple Constraint that has the greatest flexibility.\nWinston Wolf. A character in the film Pulp Fiction, used here as a metaphor for the  \nBKPM in action.\nWork Breakdown Structure (WBS).  A method of breaking a project down into its  \ncomponent work packages, usually portrayed as an “organization chart” of the  \nproject work.\nReturn to Table of Contents\nBibliography\n————— , A Guide to the Project Management Body of Knowledge (PMBOK®  \nGuide), 3rd Edition, Newtown Square, Pennsylvania: Project Management Institute,  \n2004.\nCalleam Consulting, Ltd., “Catalog of Catastrophe,” Why Technology Projects Fail:  \nA  ResourceA Resource Center for Advanced Learning  (website), 2012: \nhttp://calleam.com/WTPF/?page_id=3#2011   , retrieved August 13, 2012.\nCialdini, Robert B. Ph.D., Influence: The Psychology of Persuasion  (revised edition), \nNew York: Quill (William Morrow), 1991.\nDobson, Michael, Random Jottings 6: An Encyclopedia of Cognitive Bias , Bethesda, \nMaryland: The Institute for Sidewise Thinking, 2011. (Free download at  \nhttp://efanzines.com/RandomJottings/RandomJottings06.pdf   .)\nDobson, Michael and Heidi Feickert, The Six Dimensions of Project Management:  \nTurning Constraints Into Resources , Vienna, Virginia: Management Concepts, 2007.\nFisher, Roger, and William Ury, Getting to Yes: Negotiating Agreement Without  \nGiving In, New York: Penguin, 1981.\nHartley, Gregory, and Maryann Karinch, How to Spot a Liar: Why People Don’t Tell  \nthe Truth and How You Can Catch Them  (revised edition), Pompton Plains, New  \nJersey: Career Press, 2012.\nSinek, Simon, Start With Why: How Great Leaders Inspire Everyone to Take Action , \nNew York: Portfolio/Penguin, 2009.\nThe Standish Group International, Inc., CHAOS Summary 2009: The 10 Laws of  \nCHAOS, Boston, MA: Standish Group, 2009.\nSun Tzu (孫子), The Art of War, (trans: Lionel Giles, 1910), Project Gutenberg  \nedition (e-book).\nTarantino, Quentin and Roger Avary, Pulp Fiction (screenplay), New York: Miramax  \nFilms, 1994. Script retrieved from http://screenplayexplorer.com/wp-content/scripts/\nPulp-Fiction.pdf, August 29, 2012.\nWasser, Alan, “LBJ’s Space Race: What We Didn’t Know Then (Part 1),” The Space \nReview (online journal), June 20, 2005. Retrieved from  \nhttp://www.thespacereview.com/article/396/1   ,September 10, 2012.\nReturn to Table of Contents\nPhoto and Image Credits\nThe cover art and all original illustrations for this book were created by Bartley  \nCollart working under his company name, L10. Bart’s website is at www.L10.biz  . He \ncan be reached at bcollart@L10.biz  , or (703) 879-1833.\nCover and back cover photographs were taken by Nick Gruebl.\nAll other photographs are from Wikimedia Commons or the Library of Congress  \nPrints and Photographs Division, and are either in the public domain or are otherwise  \nfree for use.\nJohn L. Sullivan Cigarette Advertising Card produced by Allen and Ginters, 1870s-\n1890s. (http://commons.wikimedia.org/wiki/File:John_L._Sullivan1.jpg   ). Public \ndomain; copyright expired.\nJohn L. Sullivan image in Figure 2-1: From a Currier & Ives print from the Library  \nof Congress Prints and Photographs Division. Public domain; copyright expired.  \n(http://www.loc.gov/pictures/item/90710653/   )\nJeet Kune Do symbol, copyright © and trademark ® by Bruce Lee Estate. Per  \nWikimedia Commons, “The copyright holder of this work allows anyone to use it for  \nany purpose including unrestricted redistribution, commercial use, and  \nmodification.” (http://commons.wikimedia.org/wiki/File:Simbolo_JKD.jpg   ) \nGas metal arc welding. Photograph in the public domain because it was taken by a  \nU.S. Air Force employee during the course of his or her official duties. Photo credit:  \nUSAF 040112-F-1663P-001.  \n(http://commons.wikimedia.org/wiki/File:GMAW.welding.af.ncs.jpg   )\nApollo 11 Crew: Official NASA photograph, not protected by copyright.  \n(http://commons.wikimedia.org/wiki/File:The_Apollo_11_Prime_Crew_-_GPN-\n2000-001164.jpg  ) \nPortrait of Apollo 1 astronauts praying. Official NASA photograph, not subject to  \ncopyright. (http://commons.wikimedia.org/wiki/File:A1prayer.jpg   ) \nMission Control celebrates successful splashdown of Apollo 13. Official NASA  \nphotograph, not subject to copyright.  \n(http://commons.wikimedia.org/wiki/File:Mission_Control_celebrates_successful_sp\nlashdown_of_Apollo_13.jpg   ) \nPortrait of George S. Patton by the U. S. Army, public domain. Original in the  \ncollection of the Library of Congress Prints and Photographs Division, Reproduction  \nNumber LC-USZ62-25122.  \n(http://commons.wikimedia.org/wiki/File:GeorgeSPatton.jpg   ) \nReturn to Table of Contents\nAcknowledgements\nNo book is ever the sole achievement of the listed authors, and this book is no  \nexception. Thank you to those who encouraged us to take on this book as a project  \nincluding (but not limited to) close family, Dana, Mom, Dad, Mel, Nick, Andy, John,  \nAnibal, and Alexia; colleagues Bill Webster, Valerie, Kristy, Bryan and the team,  \nColin, Shawn, Jose, David, and Elizabeth; close customers Jeanne, Alix, and John D;  \nand early influencers, Donna, Ralph, and Joe.\nWe drew inspiration from the work of authors George Gilder, John Eldredge,  \nRandy Alcorn, Greg Hartley, Maryann Karinch, and Simon Sinek. \nMany thanks to Nick at NGIP for the cover and author photographs for  \nBKPM as well as to Valerie Smith and Bryan Wolbert for agreeing to let us use their  \nimages for the cover of this book.  Valerie is Chief Administrative Officer, Vice  \nPresident, and an active project manager for Think. Bryan is Executive Vice  \nPresident, Chief Operating Officer, and a Sr. Project Manager.  They are true \nrepresentatives of Bare-Knuckled PM and practice the art every day. Thanks to Linda  \nMann for proofreading.\nOur special thanks to those who awaken the sleepers and free the shackled in  \nprivate and business life.\nAs always, any errors and omissions are ours alone.\nReturn to Table of Contents\nAbout the Authors\nTony Gruebl\nTony Gruebl (right) is a Six Sigma Master Black Belt and president of Think  \nSystems, Inc. (Think), a technology project management and business intelligence  \n(BI) consulting company he started in 2004. \nHis experience includes an extensive list of BI technology implementations  \nand strategic project management and control engagements for domestic,  \ninternational, and multinational firms over a twenty-year span. \nIn 2007, he led a series of technology implementations for a partner company  \nthat resulted in his team winning the AT&T Supplier Recognition Award in Customer  \nService from among 5,000 suppliers (as noted in the Wall Street Journal  and Yahoo \nFinance on 6/5/07). \nBefore starting Think, Tony was the Chief Operating Officer of a Washington,  \nDC, non-profit firm that is also one of the company’s current clients. \nThis follows a career built in the Business Intelligence technology space, in  \nwhich he served as vice president of a Pennsylvania-based OLAP financial software  \nprovider and Director of Consulting for a Bethesda, Maryland-based IT company  \nspecializing in focused solutions for the federal government. \nTony earned an MBA in Financial Management and Technology  \nEntrepreneurship from Rensselaer Polytechnic Institute, studied abroad at the  \nCopenhagen Business School, and completed his undergraduate work at Towson  \nUniversity. He lives in Perry Hall, Maryland, with his wife, Dana, and their four  \nchildren and loves motorcycles and clinging to his God and guns. \nJeff Welch\nJeff Welch (left) is a technical executive who specializes in the use of technology to  \ndeploy training, simulations, and performance-enhancing information systems  \nthroughout commercial, DoD, and civilian Government markets. \nHe is a program/project manager and solution architect with twenty-three  \nyears of broad-based expertise in systems development. While being highly  \ntechnically oriented, he is also a proficient Instructional Systems Designer and  \ninstructor/speaker. Jeff relates to customers, stakeholders, and team members at  \nexecutive through developer levels. He drives vision and business practices to  \nmaintain a top-line focus while balancing the operational needs of the projects he is  \nleading. \nJeff is a proven problem solver and has a natural ability to motivate staff  \nthrough unique challenges. He is also known for his ability to write and present  \nhighly technical concepts and project plans in a manner that non-technical  \nstakeholders can understand and is often called upon to provide a liaison between  \ntechnology-based services and other business units (e.g., executive stakeholders,  \noperations managers, designers, and developers).\nOutside of the workplace, Jeff is an eclectic personality who has many  \ninterests and hobbies. He is a private pilot, enjoys whitewater kayaking, and is an  \navid homebrewer who invents his own brewing equipment and recipes. He supports  \nhis son’s motocross and daughter’s equestrian activities and is the loving husband to  \nhis wife, Shelby, of more than twenty years.\nThink Systems, Inc.\nThink Systems was formed in 2004 as a provider of project management, process  \nimprovement, solution design, and software implementation and customization  \nservices and for large and small companies. What we really love to do is solve  \nbusiness problems and own difficult projects, particularly in the technology space.  \nWe provide strategic and tactical project management, project control, PMO support,  \nbusiness analysis, and technical support as needed. \nBryan Wolbert and Valerie Smith are also principals of the firm. Bryan is  \nExecutive Vice President and COO and brings 15 years of business analysis and  \nproject management capability and he has been a volunteer firefighter for over 20  \nyears. Valerie is Vice President and Chief Administrative Officer of Think where she  \nmanages the infrastructure of the company for our team while simultaneously  \nrunning a large cornerstone project for one of our partners. \nThe company name, “Think Systems,” is derived from the practice of  \nsystematizing business methods, people, and their efforts in order to achieve  \nsuccessful software implementation outcomes. We architect and own the processes to  \nachieve the outcomes that our customers envision. \nEvery implementation requires paying special attention to the embedded  \nbusiness processes and new ones created by adopting new software and creating  \nworkable solutions. And, since we are usually engaged to own the project  \nmanagement process, we focus tirelessly on risk management. Properly managing  \nrisk in a changing environment and “thinking about systems” in this way, rather than  \njust installing software or simply checking off project management tasks, has  \nresulted in implementation success for our customers and business success for Think  \nSystems. \nThink Systems, Inc., is headquartered in Baltimore, Maryland.\nThe authors may be reached through Think Systems, Inc. at www.thinksi.com  , or \n443-725-5131.\n####",
  "file_path": "S:\\software\\PDFFiles\\Bare Knuckled Project Management How to Succeed at Every Project.pdf.pdf",
  "cached_at": "2025-08-06T10:22:44.990424",
  "text_length": 240762,
  "cache_key": "504ada5f9fbc63c60e185f5cd944f285"
}